{"_default": {"1": {"title": "First Time Milking", "category": "Fetish", "author": "Kessler", "short_description": "Two women treat man to a 'milking'.", "story": "I had not seen Linds in a while. She stopped by with her friend Joan. I had never seen Joan before. She was beautiful, long brown hair and long slender shapely legs to match. They both wore short skirts that hugged their figure. They stopped by to pay a visit and check up on me. I quickly found out the real reason for their visit. They wanted to know if they could have a party at my place and to invite a few friends from college and the local area. I really did not have a problem with that but played like I did. And of course Linds knew just how to sway me over to her way of thinking. \n\nLinds got that look in her eyes that I know so well, and Joan smiled wickedly at me and turned to Linds saying, \"Well, I guess we will have to convince him somehow.\"\n\nLinds giggled, \"Hmmm, it has been a while since I had him between my feet and toes. Maybe that would work.\" I looked at her feet. She wore pumps and her high arches looked so inviting. \n\nI laughed, \"Ladies, that would definitely put me in the right frame of mind.\"\n\nThey both laughed and Linds said, \"To the bedroom then!\" We made our way up the stairs making sure I positioned myself behind them. Joan was directly in front of me and I had a great vantage point of her tight ass and shapely calves. \n\nJoan looked over her shoulder at me and smiled. \n\nLinds commented, \"Joan, you have to try that milking thing out on Mr. C.\" \n\nWe made our way into my bedroom and Linds said, \"Only if he wants to.\"\n\nI sat on the bed removing my clothes and asked them, \"What is this milking thing you two are talking about?\"\n\nLinds said, \"It is something Joan has been doing with her boyfriend. I will let her explain it to you.\"\n\nI had gotten over feeling uncomfortable in the nude in Linds presence. However, being naked in front of Joan, whom I just met, made me feel a bit uneasy. \n\nI stretched out on the bed and Joan smiled saying, \"Mmmmm, Linds you were right, for a 40 year old man he does not have a bad looking body.\" \n\nThis put me more at ease with her. I watched as they both slipped off their shoes. Joan's feet looked amazing. Linds was wearing pumps and Joan had on a pair of black mules. \n\nLinds sat on the bed cross-legged next to my right hip. She pulled her long hair back over her shoulders and then grabbed my already hard cock and began to fondle it. \n\nLinds approached the foot of the bed saying to me, \"Make room for me and spread your legs please.\"\n\nI did as she instructed and watched as she took a seat on the bed between my legs. She also sat crossed-legged. Her legs were amazingly long and shapely. Her calves were smooth and nicely formed. She lifted each of my legs up and rested them on top of her crossed thighs. With my legs raised atop her thighs she was able to scoot in closer to me between them. Linds continued to stroke my shaft causing me to moan. She leaned over me, her beautiful face hovering over mine smiling as she said, \"I love the way you feel in my hands.\"\n\nJoan said, \"Let me.\" And reached over grabbing my cock. Linds released me and leaned over to the bedside stand and pulled out the bottle of baby oil from the drawer. She applied a generous amount over my cock and Joan's stroking hand. Joan's fingers were slender and much longer than Linds and wrapped completely around my throbbing shaft. \n\nAs Linds applied a liberal amount of oil Joan smiled saying, \"That's better, I like the slippery feel and smacking sound a cock makes in my hand.\" \n\nAfter a few more strokes she stopped stroking my shaft and began to rub her long thumb very slowly up and down along the sensitive glands at the head of my cock. She finished each slow torturous thumb rub by squeezing the head of my cock firmly. Her doing this to me caused my body to tense up and raise my hips into the air. She saw what her thumb rubbing was doing to me and smiled. Linds saw this and reached in with her left hand grabbing the shaft of my cock between her fingers and stroked it while Joan continued to relentlessly rub and squeeze my sensitive head. \n\nLinds said, \"He likes it when you do that with your thumb.\"\n\nJoan replied, \"I can see that. His body is really tense.\"\n\nI moaned each time Joan's thumb passed over my cock's swollen head. She was relentless as was Linds who continued to pump my shaft. It did not take long before I started to ooze precum. I watched as it leaked out of my slit and on to Joan's thumb. \n\nJoan giggled saying, \"There it is. Amazing what my thumb can do.\" \n\nLinds said, \"His cock is throbbing in my hand.\"\n\nJoan said, \"That's a good sign.\"\n\nLinds and Joan stopped what they were doing and Joan began to fondle my balls as she explained to me about how she wanted to milk me. She explained that she would insert her finger up my ass pumping it against my prostrate. All the while keeping me hard. She said it would allow me to remain hard much longer and my orgasm would be much more intense and longer.\n\nAfter explaining all this to me I was pretty sure it was not for me. I said, \"I do not like anything stuck up my ass. I prefer to remain a virgin there.\"\n\nLinds laughed, \"Oh c'mon just try it once. I will keep playing with your cock while she does it.\"\n\nJoan said, \"It will not hurt you. I have done this many times to Ron, my boyfriend, and he says it is so intense. I know what I am doing and I promise to be gentle.\"\n\nThey both continued to talk to me about it trying to convince me. Joan kept playing with my balls. I watched as her slender fingers worked their magic. Finally after much deliberation I agreed. I further explained that the moment I said stop they would have to stop. They agreed.\n\nJoan slid my legs off of hers and got up from the bed. She made her way over to where she had placed her purse and brought back with her a small jar of KY jelly. I commented, \"Do you always carry that with you.\" \n\nShe smiled at me saying, \"I never leave home without it.\"\n\nShe assumed her position between my legs, only this time scooted herself in even closer causing my hips to spread even wider and my buttocks to tilt up higher towards her.\n\nLinds looked on and asked Joan what should she do?\n\nJoan told her to get me to the point of precum again while she does her thing.\n\nLinds immediately placed her foot in my lap and inserted my cock in between her big toe and second toe. She began to jerk my cock the length of my shaft all the way up to the head where she paused and gently wiggled her toes back and forth a few times then stroked me again. It was driving me crazy and she knew it. I fit very tightly between her toes. \n\nJoan said, \"I can tell u have done this before.\" She poked her finger in the jar and pulled out a healthy dollop of KY.\n\nLinds said, \"It shouldn't take too long before he starts oozing. I just have to work his head between my toes.\"\n\nHer toes were working me over good. I began moving my hips up and down and my moans of pleasure were coming more frequently.\n\nLinds raised up her other leg and laid it across my lower abdomen pressing it against the shaft of my cock propping it upright. The sight and weight of her smooth shapely calf across my abdomen excited me further. \n\nJoan reach down between my butt cheeks and I felt her gently separate them she lowered her face down a bit to get a better view. She smiled at me and said, \"Nice virgin bud you have there. Now you have to relax and let my finger slide in. Do not tighten it up. I promise it won't hurt.\"\n\nI felt her apply the lube against my rectum and then she gently entered her finger up to the first digit. I could not help but tighten my muscles. She smiled at me and said, \"Relax now, I am going to move it around a bit so you get use to my finger.\" Linds continued to stroke me between her toes as I felt Joan's finger moving up down and around inside me. After a while I felt her finger enter me further. I asked, \"Is that it?\"\n\nJoan laughed, \"Oh no. Only half way, I still got more to go sweetie. I can feel your muscles contracting around my finger. You have to relax and accept me.\" Then she smiled at me and said, \"I love pumping my fingers inside a virgin. At this moment you probably feel a sensation of being violated. That's okay, the feeling of being violated is normal, don't worry after a while the feeling will go away. You and I are going to be real close.\" Her smile broadened even wider as she pushed her finger in even further.\n\nI said, \"I am trying to relax but God u have long fingers!\"\n\nThey both laughed and Joan said, \"That's funny…Ron tells me the same thing.\" She then added, \"I am going to move it around again so you get use to it.\"\n\nI began to breath harder and Linds asked, \"How you doing sweetie? Does it feel okay?\"\n\nAll I could do was grunt and take short breaths.\n\nI tried to take my mind off of what Joan was doing to me as I concentrated on Lind's golden toes working over my cock. I could not help but move my hips up and down. She applied more oil to her toes and reached down with a free hand to stroke my shaft while her toes began to squeeze and work harder on the sensitive area of my head. \n\nJoan concentrated on what she was doing to me as I felt her finger move even further inside me. She said, \"almost there now.\" \n\nI gasped, \"Thank goodness.\"\n\nLinds commented on how my cock was throbbing and twitching.\n\nJoan said, \"That's good he is responding to what I am doing to him.\"\n\nLinds said excitedly, \"There it is, he is starting to precum now.\" \n\nI looked at Linds toes and saw beads of my precum ooze out of my slit and onto her beautiful toes.\n\nSuddenly I felt Joan's finger slip in further and press against what had to be my prostrate. I arched my back up and groaned loudly, \"Oh God!\" \n\nJoan said, \"That's it I am all the way in now. See how he responded Linds?\" Linds laughed, \"Hell yes! He bucked so high my knee almost rammed into my chin.\"\n\nJoan bent her head down further to examine what she was doing to me saying, \" I just poked something inside him never touched before.\" \n\nLinds said, \" That's so wonderful.\" \n\nI relaxed a bit then Joan moved the tip of her finger back and forth against my prostrate. she called it my squirt button. Each time she touched it I felt a tingle race down my legs and into my toes. I also felt a tingle at the head of my cock. \n\nJoan said, \"Now we start to milk him Linds. Stop stroking him for a while. Keep him between your toes. I am going to pump his squirt button.\" \n\nLinds kept my cock locked between her toes. Joan began to slowly pump her finger in and out of my rectum, each time ensuring she made contact with my so called squirt button. She was right about me feeling violated. Yet it felt amazing. I remained hard as I felt her finger move in and out of me. Each time her finger hit my button I felt it in my cock. Suddenly she created a new sensation as I felt her enter me with two fingers. She increased the speed of her thrusts and before long I saw my cum oozing out of my slit. At first I thought it was precum but there was too much of it and it flowed freely. The sensation was strange, as I had no prior feeling of it coming. The flow was beyond my control. Each time she made contact with my prostrate more would flow out in a steady stream. I could not help but moan as I watched it flow onto Lind's perfect toes and foot. \n\nLinds was beside herself as she looked on in awe, \"Oh my God he is leaking like crazy look at it, all over my foot! It feels so hot. I love it!\" \n\nJoan laughed, \"I know. It's great. All I have to do is keep hitting his button.\" \n\nJoan reached in with her free hand and lifted my heavy balls up fondling them as she increased the pace of her fingers inside me. After several minutes my tense muscles began to tire and I began to let myself go. I became more relaxed as Joan's relentless pounding continued. I could feel the knuckles of her remaining fingers push against my ass cheeks each time she shoved her fingers inside me. Joan recognized the state of relaxation I was feeling and looked up at me smiling, \"That's better now, just relax and let us milk you dry.\" She told Linds to start jerking me again while she tries something new.\n\nJoan removed her fingers from me and repositioned herself saying, \"So you like toes and feet eh, well I am gonna finish milking you with my toes.\" \n\nLinds said, \" You go girl, give him those long sweet toes, that's what he wants. \" \n\nI watched as Joan remained seated between my legs and pulled her knees up to her chest. She then reached back down spreading my cheeks with her hands. I felt one of her big toes enter my rectum slowly and smoothly. All the way in and then I felt it hit my squirt button just as her finger had done before. \n\nShe said, \"Oh yes he is very receptive, good and loose now.\"\n\nMy God! It felt amazing as she began to rub the tip of her toe against my prostrate up and down and around. Seeing her long beautiful legs between my legs and feeling her toe pressing against my insides excited me to no end. I rose up onto my elbows, my body shaking with sexual bliss. Linds looked at me and giggled as she continued to squeeze the head of my cock between her toes and stroke my shaft with her fingers. All the while Linds continued to flex her foot as her toe rubbed and pressed my button. \n\nI was shaking with excitement, delirious and on the edge as I watched a slow steady stream of cum ooze out onto Lind's foot every time Joan's slender ankle flexed, moving her toe inside me. I watched the muscles in Linds calf move each time her ankle flexed. I could not help but moan each time I saw this and felt her toe press inside me. \n\nEach time, my body shook uncontrollably when Lind's toe rubbed my sensitive head and Joan's toe hit my button. \n\nLinds said, \"Wow! I have never seen him like this. He is losing it Joan.\" Linds reached over and ran her hand gently along the side of my flushed face. \n\nJoan said, \"I know. That's what I like about milking a guy. It gives me complete control.\" \n\nI gasped through my excitement. \"Amazing! Your legs are so beautiful Joan.\" I leaned forward and tried to touch them but I could not. \n\nJoan laughed and said, \"Why thank you.\" She then raised her right leg and gently placed her calf across the top of my cock and began to rub it back and forth. My cum was flowing continuously as I watched it ooze onto her shapely calf. Her toe continued to work my rectum and Linds slid her toes down my shaft stroking it faster. \n\nJoan smiled wickedly at me and commented, \"That's nice isn't it?\"\n\nI fell back onto the bed closing my eyes as I felt myself being swallowed by these leggy vixens.\n\nSeeing me do this they both laughed as they continued to work me over with their hands, toes, and legs. \n\nLinds said, \"I think all this stimulation is almost more than he can stand. He does not know if he is cumming or going.\" \n\nJoan giggled, \"You don't know how true a statement that is. Right now his brain is telling him one thing but his body is doing something else.\"\n\nThe sensation caused by Joan's toe was incredible and prevented me from a complete orgasm. I continued to ooze my juices for several minutes. I could not control it. My level of excitement was controlled by the pressure of Joan's toe and Lind's feet and toes on my throbbing cock.\n\nIt was a strange sensation in that I was being held back from an exploding orgasm. At the same time the urge was not as strong. Joan had a lot to do with that, as she seemed to know just the right amount of pressure to apply with her toe. \n\nAfter what seemed like an eternity Joan finally said, \"Lets make him explode now.\" \n\nLinds smiled hungrily and said, \"Yes. Lets.\" Then she asked me, \"Are you ready to explode?\"\n\nMy senses were a wreck as I breathed heavily. My heart was racing and my blood felt like fire burning in my veins. I responded through heated breath, \"Yes…yes.\"\n\nJoan and Linds laughed seeing how I was struggling beneath them.\n\nJoan said, \"Okay. I am going to start pumping him and you work your magic Linds.\"\n\nLinds raised her left leg that was resting across my abdomen and locked the base of my shaft between the big toe and second toe. She kept the head of my cock locked between the same toes of her right foot and preceded to jerk me with her feet. Joan tucked her right leg back into her chest and inserted her other big toe into my hole. When she did this I came out of my skin shouting, \"No! no! Not both of them!\"\n\nJoan leaned forward placing both her hands on my hips saying, \"Sssshhhhhh, just relax and let it go,\" as she consoled me I felt her slowly push her other toe deeper inside me saying, \"almost there sweetie.\"\n\nI squirmed watching her as she looked down between my legs intensely. All the while feeling her toe slip further in along side the other one. Once I felt the tips of her remaining digits push against the outside of my rectum I knew her toe was fully inserted. She looked up and smiled at me and wrapped her arms around the front of her long tucked legs and resting her chin on top of her knees said, \"There that's not so bad now is it? Both my toes are inside all the way.\" I felt her wiggle them up and down inside me as she giggled. This caused me to thrust my hips up involuntarily as I released a long groan saying, \"Oh my God.\"\n\nLinds continued to pump my hard throbbing shaft and leaned over to look at Joan's feet saying , \"Oh my God, that looks awesome! I definitely want to try that.\"\n\nJoan said, \"Here we go.\" She started to slowly pump her toes in and out of me while Linds quickened her jerks on my cock. I matched their pumping and jerking as best I could with thrusts of my own. Each time I felt Joan's toes enter me and press against my squirt button I could not help but grunt. Linds matched Joan's pumping toes with her jerking of my shaft. After a while we reached a good rhythm. Both girls realized this as well and Linds said, \"Now we got it going good.\" \n\nJoan looked over at Linds saying, \"Yep, it won't be long now.\" \n\nJoan said, \"He is really loose down here now. He is getting use to my toes.\"\n\nShe began to pump her toes in and out much faster and harder. She unwrapped her arms from around her legs and grabbed my balls with both sets of her fingers and began to fondle them by gently squeezing them and pulling on them. She cupped my swollen balls from underneath with her left hand lifting them up and slowly ran the tips of her fingernails of her right hand across the taught skin sending more shivers through my body. The sensation of her nail tips rubbing back and forth across my nuts sack was a totally new sensation to me. The muscle tone in her legs looked amazing as she flexed her ankles and pumped her toes in and out of my hole. All the while the smile never left her petite pretty face as she concentrated on what she was doing to me. Feeling her fingers fondling my balls and watching her long legs while she smiled at me from above her knees was driving me crazy. My cock was twitching like never before between both sets of Linds toes as she began to concentrate most of her efforts on the swollen head of my cock. Seeing and feeling all this I could not help but raise up in the seated position almost shouting out, \"Oh God, oh God!\", in unison to Linds strokes and Joan's pumping toes. Their efforts felt so strong as my limp body was totally given to them. I could feel my body being physically rocked back and forth along the bed. They were pounding me pretty hard. Joan's legs were powerful as she was thrusting her toes into me. I was amazed at the strength I felt coming from her long legs and the seemingly tireless effort they exuded. Through prior experience I knew the same was true about Lind's legs. She studied dance and could go on for hours if need be. I knew I would not last long. Eventually it would all come out in the end...right between Linds magnificently tanned toes. \n\nJust as I was beginning to feel the desire to finally cum I felt Joan lift my nuts up between her groping fingers. She then pressed the tips of her toes harder than she had done before against my Squirt button and gently pinched it between them, gripping it firmly with her toes she began to lightly tug and push back and forth on it. \nI jerked completely upright into a seated position, releasing a loud half scream, half groan. I closed my eyes seeing colors red and white flashed across my mind. I opened my eyes to see Joan stretched out backwards on the bed and resting on her elbows. She smiled up at me saying, \"I never did this with my toes before. Normally I pinch it between my fingers and tug on the tiny squirt button. I got it between the tips of my toes now.\" \n\nI bent forward over Lind's pumping toes staring down at Joan's petite feet half buried between my ass cheeks. The looked back up at her incredibly beautiful long legs slightly bent at the knees. I watched her ankles flex slightly, the same time feeling the tug on my throbbing prostrate. I reached between my legs and grabbed each slender flexing ankle almost tempted to pull them away from between my legs. Instead I caressed them feeling the strength and smooth elegance they possessed. \n\nJoan turned to Linds and laughed saying, \"Look Linds, he is in sexual bliss.\"\n\nI closed my eyes hearing Linds say, \"I would have to say yes, because whatever you started doing to him with your toes has resulted in a real gusher between my toes. Look at my feet. He is leaking all over my them. They are completely soaked now.\"\n\nI opened my eyes and saw Linds was not exaggerating. Both her feet looked completely wet.\n\nHearing and seeing my response as I rose up and flopped back down caused them to both giggle and look at each other. My cum continued to leak steadily from my cock even more so than before as I could hear the smacking sound created by Lind's toe strokes. \n\nSuddenly the familiar sensation I had been waiting for arrived, as I felt the urge to explode begin to build up inside me. I reached over in front of me and clutched Lind's long shapely legs in my arms. A sign that Linds was familiar with, having given me many foot jobs in the past. It was a gentle display of submission on my behalf that I was on the verge of cumming. She knew this and smiled at me wrapping her left arm around my neck hugging me as I shook with excitement. \n\nShe pressed her lips against my ear whispering to me as she has done so many times in the past, \"That's it sweetie grab my legs and hold on. Let it come. I want to feel your hot seed all over my toes and feet. Rub my smooth legs. Let it all out.\" \n\nJoan said, \"Awwww, isn't that sweet. He is shaking like crazy.\"\n\nLinds said, \"He always hugs my legs like this when he is about to blow his load. I love it, feeling his body shake against my legs as he loses it.\"\n\nJoan sat back up with her knees tucked into her chest and finally released my prostrate from between the tips of her soft toes and continued to pump me. I felt her toes touch my sensitive squirt button more frequently. My body was tingling all over as my shakes became more violent. I clutched Lind's legs even harder into my chest feeling her smooth muscles flexing with each stroke as I shouted, \"I'm cumming! I'm cumming!\" \n\nJoan stopped her pumping and withdrew her toes halfway out of my hole and began to wiggle them up and down. With Joan's knees pressed tightly into my neck, I looked over at Joan's smiling face as I felt my cum rising up my shaft. \n\nLinds continued whispering in my ear as her toes stroked me in powerful jerks saying, \"Cum on my toes come on baby, come on.\"\n\nMy body locked up hard and Linds said, \"That's it he is cumming now!\" She pulled away to watch my cock blow between her toes as I clutched her powerful legs into my chest. I watched Joan fondle my balls even faster, rolling them between her fingertips and felt her slide her toes the rest of the way into my hole. Her timing was incredible as I felt the tip of her soft toes press against my squirt button as she wiggled them up and down. The last thing I remember seeing before closing my eyes in complete orgasmic bliss was her wickedly smiling face above her knees as she winked at me saying, \"blow hard for me baby.\"\n\nI did exactly that, as I grunted hard between my clenched teeth and felt the most incredible orgasm ever. I buried my face between the tops of Lind's knees as I felt her toes clench my shaft and head in one final powerful upward jerk. Feeling all this at once was too much as I threw myself back down on the bed feeling the first load leave my body. \n\nI heard Linds gasp, \"Oh my! Oh my! That one was incredible.\" \n\nI then felt Joan's toes flex again, rubbing across my squirt button, causing me to rise back up in tense excitement. I groaned, \"Oh God, I'm cumming!\"\n\nI heard Linds comment nonchalantly followed by a giggle, \"Hmmmm, didn't he say that already.\"\n\nI gripped Lind's shapely calves in my hands feeling them flex as she squeezed the head of my cock yet again between her toes jerking it quickly up and down in rapid fashion. I grunted and threw myself back down onto the bed a second time as I felt another load escape me. \n\nLinds said, \"Wow! That hit hard!\"\n\nI heard Joan giggle and yet again I felt the tips of her hot toes press even harder into my squirt button and wiggle up and down against it. \n\nMy body locked once again causing me to rise back up for the third time. I opened my eyes through a glaze and saw Joan looking down between my legs as she squeezed and pulled gently on my swollen balls. Linds continued to pump me between her toes and reached over with her index finger slowly rubbing the slit of my cock. I watched as she rubbed the cum from her fingertip into her calf smiling at me as she did this. She then jerked up with her toes causing her calves to flex in my clenching arms and against my chest, as I felt another load being pulled from me. I groaned, \"I'm cumming!\" as it left me.\n\nJoan laughed, \"Honey, you been cuming.\"\n\nI was breathing hard trying to catch my breath as yet again I felt Joan's toes rub against my throbbing squirt button, I could not believe I was still hard between Lind's toes. I could not rise up any more as I just lay there twitching uncontrollably watching Lind's strong legs rise up and down pulling out load after load from my tired body. The tips of Joan's toes felt like warm prods against my prostrate. My rectum felt completely numb around her toes. \n\nThroughout this all I watched as every so often Linds continued to rub the head of my cock with her finger and then rub the cum into her swaying shapely calf. Occasionally she let the cum pool up in the connecting skin between her toes and scoop it up on her finger rubbing it into her calf as well. \n\nI knew she could go on forever like this. There is not enough cum in the world to satisfy her. She was enjoying herself. Her golden tanned toes and legs were magnificent. I finally had enough and said, \"Joan stop. Pleeease stop.\" \n\nShe asked, \"Are you sure?\"\n\nI shouted, \"Oh God yes I am sure! You both are killing me!\"\n\nJoan laughed as she withdrew her toes from inside me. Linds responded with, \"My God! I had never seen so much. I was rubbing it all over my legs. Another hour and we could take a bath in it. He's still hard though?\"\n\nJoan laughed, \"That's okay we can gently finish of what is left.\"\n\nIt was amazing. As soon as Joan removed her toes from my rectum my body relaxed like a wet dish rag. I pulled myself up resting my back against the headboard breathing like I had just finished running a marathon. Linds released my cock from her toe grip as Joan scooted in further between my legs. She then placed her legs in my lap in such a way as to sandwich my hard cock between her right shin and left calf in a cross legged fashion. She looked at Linds and smiled asking, \"May I? I love finishing a guy off by sucking him dry.\" \n\nLinds giggled, \"By all means, you deserve it. Besides I don't think he will mind.\" Then she looked at me and smiled. Joan pulled her black hair away from her beautiful face smiled at me and swallowed my cock. Linds got on her knees and moved over behind me sliding in between my back and the headboard so that I rested in between her legs. She then wrapped her long legs around me resting them across my abdomen. Joan's mouth felt amazing, so warm and soft around the head of my cock. She used her hands to lift her legs up and down along my shaft while her tongue and mouth sucked on the head. \n\nI lay my head back onto Lind's chest and moaned, \"Oh Joan your mouth and legs are incredible.\" I gripped Lind's smooth calves that were crossed on top of my body and rubbed them as I watched Joan's head bob up and down and around the head of my cock. Occasionally Joan lifted her head, smacked her lips, and smiled at me. Linds spoke to me the whole time telling me about the orgasms I had just minutes ago between her toes. \n\nShe said, \"Your loads shot so hard and thick. One landed all the way up the inside of my knee. That one surprised me. Another one hit inside my left calf. My feet are completely soaked with your milk. I never have seen so much cum.\"\n\nI said, \"Oh God, oh God, I am about to cum again Joan.\" \n\nLinds laughed knowing how much I love to hear her talk dirty to me, and Joan moaned with my cock in her mouth and clenched my cock firmer between her shin and calf, jerking it up and down into her mouth. Feeling this I began to throw my hips up into Joan's beautiful sucking mouth. She firmly clenched her lips around the head as I felt the tip of her soft tongue sliding up and down over the sensitive gland of my head. \n\nLinds wrapped her beautiful shapely legs tighter around me and began running her slender fingers through my hair saying, \"Let it come sweetie. Shoot it out into Joan's warm mouth. Give it all to her.\" \n\nI arched my back up against Lind's clamping legs and threw my hips up against the weight of Joan's stroking legs in my lap, as best as I was able. I had little strength left in me after what they had done to me. \n\nJoan sensed my imminent orgasm and really started to work the head of my cock with her sweet mouth and twirling tongue. My body tightened as I jerked and groaned feeling my cum rise inside me. Joan raised her head up slightly opening her mouth above my cock resting the head of my cock against her tongue. She stared up at me as she did this and began to stroke my shaft in full measure between her legs. Up and down, up and down I watched her beautiful legs pump. Linds lowered her face to my ear saying, \"Look at that beautiful mouth. Cum into her mouth. Feel her legs stroking your cock.\" \n\nLinds continued to look at me as I saw an opened mouth smile cross her face. I continued to concentrate on my throbbing cock being stroked by her beautiful legs. \n\nMy body was quivering like crazy between Lind's legs. I could not believe I had not cum yet! Why? Was I completely spent from earlier?\n\nLinds said, \"Let me help before he has a heart attack.\"\n\nLinds lifted her incredibly long legs, resting the soles of her feet flat upon my lower abdomen and began rubbing them up and down, running her soft toes through my pubic hairs. She slipped her toes under Joan's pumping legs and then back up again. Back and forth she did this, curling her toes down into my skin, running my pubic hairs between her toes. She said to Joan, \"He likes the feel of my toes pressing into him down there. I like it too. Feeling his silky pubes running between my toes.\"\n\nLind's has the shapeliest calves I have ever seen on a woman. Watching her calves sway loosely back and forth in front of me as she did this was too much. I cupped them in my hands. \n\nLinds continued to run her fingers through my hair and in a soft gentle voice said, \"How's that sweetie, you gonna blow now? Concentrate on feeling my toes push your cum out of you.\"\n\nJoan felt it in my cock as well. She smiled again as I watched her legs pump up a final stroke forcing a load from my cock. It landed squarely on her tongue. Linds saw this as well and giggled. She curled her toes downward and slid them harder back down to the base of my cock. Joan's legs pumped another load out into her smiling open mouth. It landed on her upper lip and back onto her waiting tongue. Joan continued to stare at me as another load eeked out onto her warm tongue. Then she lowered her beautiful small face back down and closed her mouth around the very tip of my cock as she finished stroking me with her legs. \n\nMy body went limp, as did my cock. As my cock shriveled Joan took more and more of it into her mouth until I was completely flaccid. She twirled my flaccid member around with her soft tongue. \n\nI was completely spent. My body exhausted. I lay there between Lind's legs rubbing them as I caught my breath. Linds lifted her head but kept my flaccid cock between her lovely legs.\n\nI said, \"Ladies, that was incredible we need to do this again.\"\n\nThey laughed and Joan said to Linds, \"See I told you he would like being milked.\"\n\nI lay there amongst their fine bodies and beautiful Legs and feet with my eyes close as they spoke among themselves. Linds asked a lot of questions about how often should she milk a guy and what is too much. What does the prostrate feel like, etc?\n\nI thought it was kind of funny how they talked about it like I was a cow or something. \n\nAs they spoke Linds continued to apprehensively and gently fondle my cock and balls, occasionally looking down at it. All the while she addressed Linds questions. The dexterity of her slender fingers was amazing as she played with my genitals; it seemed to be second nature to her. As they talked, I passed out into a deep sleep between Lind's legs. I don't know for how long I was out but I awoke as Linds was slipping out from behind me. She saw me wake up and smiled saying, \"Sorry, I tried not to wake you.\"\n\nI said, \"That's okay, I don't want to miss the game tonight. I need to get up.\" I watched Joan leave the bed, pull her long hair back and slip on her mules. \n\nI said, \"You are so fine.\" \n\nShe smiled back at me saying, \"Thanks, anytime you want to be milked again let me know. I never used my toes before. I liked it. I like having my hands free for other things.\"\n\nI noticed Linds slipping on her pumps, my dried cum still covering her golden feet. \n\nI said, \"Your are so fine also Linds.\" They both laughed and Linds said to Joan, \"I think this is what you call after sex obsession.\" \n\nI laughed saying, \"I don't know about all that, but this time don't be away so long, I really do miss you.\" \n\nLinds turned to me and smiled holding up the jar of KY jelly and sticking it in her bag. She said, \"Don't worry about that. I am going to need someone to practice milking on and you are it.\" \n\nI flopped back on to the bed smiling as I watched them leave my room. As they walked out Joan hollered back, \"Call me anytime. Linds has my number. Bye.\"", "tags": ["linds continued", "linds laughed", "watched joan", "toes joan", "cock linds", "shapely calf", "linds giggled", "shaft linds", "linds commented", "locked toes"], "address": "https://www.literotica.com/s/first-time-milking"}, "2": {"title": "Ben Wa's Won't Pass Security", "category": "Incest/Taboo", "author": "Wyden Long", "short_description": "Daughter tries to wear her balls in airport.", "story": "As chief of security at the local airport, I don't have to worry about going through the metal detectors. My Walther would set all the alarms off, anyway, and it might raise a few eyebrows if I put it in the little basket before walking through.\n\nHowever, my immunity doesn't extend to members of my family and their friends, so when my daughter and her roommate were boarding their flight to return to college after Spring break, they were required to go through the detector with everyone else.\n\n\"Hi Daddy\", Karen waved at me as they approached the security checkpoint and saw me standing at the back of the room.\n\nI gave a small smile and half nod, not wishing to appear less than cop-like while on duty. If it had not been for my years of practice at keeping my emotions from being displayed on my face, I would have been drooling over the sight of Karen's roommate, Vanessa. Neither girl was wearing much and both completely filled out the minimal bits that were somewhat covering them. Karen being my daughter, I tried not to think of her in a sexual way, but hot little Vanessa was not even close to being my daughter. Any time she was around, my blood pressure rose several points, I'm sure.\n\nSome girls are born knowing how to raise the hackles on every male in the vicinity. Vanessa was certainly raising mine. I tried to keep my face composed while scanning every inch of skin she was exposing. If she had not been there, it would have been very hard to ignore the voluptuousness of my own daughter, so I was grateful for the diversion.\n\nWith just a patch of clothing at top and bottom, there was no way either of them could have concealed anything, yet the alarm went off for both of them, much to their embarrassment. It even appeared that they were more than embarassed--more like horrified.\n\nI watched with interest as the security personnel waved their detector wands around the girls' bodies. Each time the wand was near their crotch, the beep would be triggered very loudly. Karen and Vanessa were becoming more and more frantic. Finally, I saw Karen wave a hand at me and pleaded with her eyes for me to come to their assistance. Since I was more than a little interested in what was going on, I sauntered over.\n\n\"What's the problem here, Officer Rodriguez?\", I asked the young security girl.\n\n\"These two girls appear to have some type of metallic device hidden under their clothing, Sir. We must take them to the inspection room for a more thorough search.\"\n\n\"No!\", shouted Karen and Vanessa, simultaneously. \"You can't!\".\n\n\"Oh, yes we can and we will\", the girl assured her. \"Let's go.\"\n\n\"No, please. Wait just a minute, please.\" Karen was in tears. \"Daddy, please don't let her take us in there.\"\n\n\"Well, dear. We are required to perform a more detailed search under these conditions. I could lose my job if we do not follow the regulations.\"\n\n\"Well, at least, can't you do the inspection? Please, please, please, Daddy!\"\n\nI thought about it a minute. This would be bending the rules way over, but I could probably get away with it this time. Karen was so frantic, it was hard to imagine what her reason might be to have been caught in this predicament in the first place.\n\n\"Do you both assure me that you have not done anything illegal?\"\n\n\"Yes, Daddy! Oh yes, yes, yes.\"\n\n\"Officer, I know this is highly irregular, but I will vouch for my daughter and her friend in this case.\"\n\n\"Yes, sir, but they must be examined or we face the possibility of losing our certification.\"\n\n\"Well, girls. It looks like we have no choice. You simply must be examined. You may not even change your mind about taking the flight. Once you have entered the security checkpoint, you will not be allowed to leave without proving that you have no weapons.\"\n\nAt this point, it looked like Karen might faint.\n\nVanessa piped up with a suggestion. \"Sir, is it possible that you could be the one who performs the examination?\"\n\nI hadn't thought of that possibility, probably because it would normally be considered unethical for a man to perform the detailed security examination of a female passenger.\n\n\"Oh, Daddy! Could you please? Please?\"\n\n\"We're not supposed to allow male personnel to examine female passengers. The examination is very personal. Are you sure you want me to do this?\"\n\nThey both nodded assent so vigorously, their tits were almost jiggling out of their halter tops. The aspect of doing a strip search on Vanessa already had my dick in an uproar, then I realized that I would have to perform a body cavity search on both of them. Oh shit!\n\n\"Sir, if I may suggest an alternative solution.\"\n\n\"That would be greatly appreciated, Officer.\"\n\n\"Under the circumstances, I am willing to be the Officer of Record for this examination. I will escort the subjects into the examination room, but will open the side door and allow you to replace me if you wish.\"\n\n\"Oh, thank you, thank you, thank you, Officer!\" The girls chorused their relief.\n\n\"I'm not sure you girls know what you are agreeing to, but if you are willing to sign a release to cover me, then I will work with you.\"\n\nI thanked Officer Rodriguez for her willingness to help find a solution to the dilemma.\n\nShe whispered to me, \"You do realize that you must perform a full body cavity search, don't you, sir?\"\n\n\"Uh, yes, Officer\", I swallowed hard, thinking about it.\n\nShe whispered again. \"If you find that you are unable to complete the examination, I will be just outside the door.\"\n\n\"You are being very helpful here, Officer Rodriguez. No doubt it will do you no harm at review time.\"\n\n\"No doubt, sir. My memory is very good.\"\n\nI smiled at her clumsy attempt at blackmail. She would have to be my next subject for a full body cavity search. The thought was enticing, but at the moment, it was hard to concentrate on anything else other than the thought that I would have a finger in two very tight pussies in just a couple of minutes.\n\n\"Carry on, Officer Rodriguez.\"\n\nKaren and Vanessa followed her obediently into the examination room, in full view of the rest of the security crew. Their testimony would come in handy if there was ever any flak over the incident. As far as they could tell, two frantic young girls had finally been calmed down enough to proceed with the proper flow of things.\n\nI waited a few beats, then told my second in command that I needed to make a phone call and casually slipped out the back door before racing around to the examination room.\n\nOfficer Rodriguez responded to my light tap on the door by coming through and closing it behind her. \"Sir, you and I both know that I cannot abandon my responsibility here. I am in violation of the rules for allowing you to make the examination, but both subjects did sign a full release. However, I must observe the examination for my own career protection. I will watch from the viewing room to spare your daughter and her friend any additional embarrassment and to be able to testify later on your behalf if the occasion should arise.\"\n\nThe knowledge that she would be watching me stick my finger in my daughter's pussy was both irritating and exciting. \"Thank you again, Officer Rodriguez.\"\n\n\"Oh, there will be plenty time to thank me later, Sir.\" She swished away to her viewing post with a certain sway of her hips which could have been a promise of more to come or she could have simply been luxuriating in the knowledge that she would be in a position to demand favors in the future.\n\nWhen I entered the room, Karen and Vanessa were huddled together as if awaiting a lashing.\n\n\"Ok, girls. Let's get to the bottom of this.\" I had to bite my tongue to keep from laughing out loud at my unintended pun. I would be getting to the \"bottom\" of things, all right. \"Do you want to tell me what's going on?\"\n\n\"Oh, Daddy. It's so embarrassing.\"\n\n\"You just think it's embarrassing now. I am now required by law to ask that you take off all your clothes and place them on that table.\"\n\n\"Daddy! You can't mean that!\"\n\n\"I'm afraid I have no choice, Dear. It's not like I never changed your diapers.\"\n\n\"You never changed mine, Mr. Long\", the sultry Vanessa was stepping out of her hot pants and reaching down to grab the edge of her halter. She looked like she might be enjoying this.\n\nI watched in awe as she slowly revealed the most delectable set of jugs I had seen in a very long time, then bent away from me to roll her thong down her tempting ass.\n\n\"Don't look, Daddy. I'll take mine off now.\"\n\n\"Honey. I am required to look. I am also required to perform a full body cavity search of both of you. Didn't you know that?\"\n\n\"Daddy! How could you?\"\n\n\"It's my job, Honey. Except for you, I never perform the examination on females. Officer Rodriguez and I are putting our careers on the line by my doing so now, but you were so insistent that we are trying to help you.\"\n\n\"You're going to put your finger in me?\"\n\n\"Front and back, Dear.\"\n\n\"Front and back? Oh! Oh no!\"\n\n\"Oh, yes. Whatever you have done has put you in this position. Now that you are here, your only choice is to proceed in the normal manner by allowing Officer Rodriguez to perform the examination or I will do so at your request. You don't seem to realize that breaches of security are an extremely serious act and must be dealt with severely.\"\n\n\"You can examine me now, Mr. Long.\" Vanessa climbed up onto the examining table and spread her legs wide for me.\n\nI almost choked. All my fantasies were coming true at once. My hands were shaking so hard it was very difficult to get them into the rubber gloves.\n\nWhen Karen saw the gloves, she realized at last that it was actually going to happen--to her, and all of her wiles she had practiced for so long were of no use in this case. Her shoulders slumped as she began to mechanically remove the few items that enclosed her gorgeous body. I spread the lubricating lotion on my gloved finger while trying to look at everything in the room at the same time. If only it were my dick I was spreading it on!\n\nVanessa raised her ass and actually spread her pussy lips for me to begin my examination. The taunting look in her eyes was a powerful deterrent to my almost overpowering desire to watch my finger part the velvet lips of her obscenely displayed pussy.\n\n\"Wait! What's this?\" My finger had touched something hard, metallic and round, deep inside her hot cunt. \"What have you girls been up to? You're not trying to smuggle drugs, are you?\"\n\n\"No, Daddy\", Karen answered with a defeated sigh. \"I guess we can't hold back any longer. Might as well tell you everything. It's just so damned embarrassing.\"\n\nMeanwhile, my probing finger had crooked around the submerged object and was pulling it to the front of Vanessa's slippery lips. As Karen began to explain, two shiny metal balls fell into my hand, leaving a small hole as they emerged, that quickly closed over as those delicious lips recovered their usual shape. I wanted bury my face in her cunt and lick until there was nothing left to lick.\n\n\"Well, we each dared the other to try these Ben Wa balls last night, but we didn't know you have to be very careful to keep the string hanging out or they can get lodged so far back that you can't get them out. I guess your fingers are longer than ours. We tried and tried to get them out before we left the house, but we were about to miss our flight, so we came on down. I forgot that the metal detector would pick them up. I'm so sorry, Daddy.\"\n\n\"You may be sorry now, Karen, but you sure got off a lot while we were trying to get them out before.\"\n\n\"Vanessa! This is my Daddy!\"\n\n\"Right now, he's just a man with a finger in my pussy. It feels pretty good, too, Mr. Long. I've wanted you to do that for a long time.\"\n\n\"Vanessa!\"\n\n\"Oh, hush, Karen. He's still got to get yours out so we can get on the plane. If you don't climb up here and let him dig it out, we're going to miss it.\"\n\nMy daughter looked like she was about to get a beating. Her shoulders were slumped forward and her face was hidden by her hair falling forward over her downcast eyes. Nevertheless, she did climb up on the table and spread her legs wide for me, as she had seen Vanessa do.\n\n\"Close your eyes, Baby. Maybe it won't be so bad if you don't have to see what I'm doing.\"\n\nAs my finger sunk to the hilt in her tight box, she giggled. \"If I close my eyes, Daddy, I won't get to see you standing there in your uniform with your finger in my pussy. That would be missing the best part of the whole deal.\" She wriggled her hips and two shiny balls plopped out into my hand with no effort on my part.\n\n\"Why you little bitch!\", I thundered. \"Do you mean to tell me that you planned this whole thing? You could get me fired.\"\n\n\"Relax, Daddy. Don't you like feeling my pussy? I've seen you looking at my body ever since I grew tits, maybe even before. You know you were cumming in your pants all this time, just thinking about doing a full body cavity search on your own daughter and Vanessa. Doesn't she have a tight pussy, Daddy? I just love to lick it. Want to watch us?\"\n\nI stood dumbstruck. The nerve of my own daughter pulling such a stupid prank! \"Both of you! Get your clothes on this instant! You are both under arrest for creating a false security alarm. Come in here at once, Officer Rodriguez and take these persons to the holding cell. I must write up my report.\"\n\nThe girls were still standing naked with a dazed look on their faces when Angela came back in.\n\n\"Get your clothes on, girls. We have to walk past a lot of people on the way to the cells. Makes no difference to me, but you might prefer to have something on.\"\n\n\"Daddy! You can't do this!\"\n\n\"You should have thought this thing through better, Honey. It's out of my hands now. You will have to go to the holding cells until the U.S. Attorney can get here to proffer charges. I will put up your bond afterwards, of course, but you must remain in custody until the charges are filed.\"\n\n\"But can't you do something?\"\n\n\"Sorry. Hurry up, now. Officer Rodriguez has to get back to the security area. I'll come down to see you later. Carry on, Officer.\" I left through the side door, hoping that nobody saw me slipping the rubber gloves covered with pussy juice into my pants pocket. ======================================================= \"Well, girls, are you beginning to appreciate the seriousness of the situation?\"\n\n\"Oh, yes, Daddy, and I'm so sorry.\"\n\n\"Me too, Mr. Long. What happens now?\"\n\n\"Has the U.S. Attorney been here yet?\"\n\n\"No,o.\"\n\n\"We will have to wait to see what he has to say, or she, as the case may be.\"\n\n\"Isn't there anything you can do to make it go away?\" Karen was really in tears now.\n\n\"About the only thing I can hope for is to ask if they will not file it as a criminal record. You would both lose your scholarships if they do.\"\n\n\"Lose our scholarships!\", they chorused.\n\n\"Now are you beginning to see what your little game has done?\" I gave my most ferocious glare at them and we settled back to wait for the person from the U.S. Attorney's office.\n\nWhen he came, I breathed a sigh of relief. Scott Adams was one of the younger and least hard-nosed of the people who might have responded.\n\n\"Could I have a word with you, Scott, before you begin?\"\n\nHe agreed and we went out into the hall.\n\n\"Scott, I'm not going to ask you to relax any rules, but I am going to give you the complete, embarrassing truth and hope that you can find an appropriate punishment level that might be less severe than someone with less sensitivity might do.\"\n\nScott merely grinned at my pathetic attempt to ask for a favor and cocked his head to listen.\n\n\"These two idiots are my daughter and her college roommate. They were experimenting with some sex toys and failed to realize that the metal detector would pick them up. There was never any security breach or an attempt at one, but I think they need to be taught a very memorable lesson. Don't you?\"\n\n\"Well, Wyden. As head of security, I'm certain that you are able to tell the difference between real security breaches and silly school girl pranks, but since one of the subjects is related to you we cannot rely entirely on your unsubstantiated judgment, now can we.\"\n\n\"You're absolutely right, Scott. I can only hope that your opinion supports mine. If not, I will of course support your decision in every way.\"\n\n\"Thanks, Wyden. Now let's go scare the shit out of two cute girls.\"\n\nHis choice of words encouraged me as I followed him back into the room where they were.\n\n\"All right, Miss Long and Miss Williams. I am recording this interview. Please state your names for the record after I announce the date and time.\"\n\nAfter the preliminaries were over, he began by asking them to describe their version of what had happened. At first they were too embarrassed to do so, but he convinced them that there was no alternative.\n\n\"Well, Vanessa and I were shopping and we went into this sex shop and she dared me to buy these Ben Wa balls.\"\n\n\"Please describe these items for the record, Miss Long.\"\n\n\"They are small metal balls that are supposed to clink together as you walk and excite you sexually.\"\n\n\"How do you use them?\"\n\n\"Uh, you insert them.\"\n\n\"Where?\"\n\n\"Uh, inside.\"\n\n\"Inside where?\"\n\n\"Uh, in your vagina. I mean in my vagina.\" Karen was visibly agitated at having to admit this to Scott.\n\n\"You may relax a moment, Miss Long. Now, Miss Williams. Did both of you insert these items in your vaginas before entering the security checkpoint?\"\n\n\"Yes Sir.\"\n\n\"Did it not occur to you that the metal detector would pick them up?\"\n\n\"No Sir. We were too excited by the clinking to think very much about security.\"\n\n\"Did they, in fact, cause you to be sexually excited?\"\n\n\"Oh, yes. Very much so!\"\n\n\"May I see them?\" Scott held out his hand and I took them from the evidence case for him.\n\nHe jiggled them casually in his hands, feeling them clink together. I imagined them in my daughter's pussy, clinking away when she walked. I imagined that Scott did, also. I stole a glance at the girls' faces and thought that they were having pleasant memories of them, too, until their discovery.\n\n\"You both put these balls into your vaginas?\"\n\n\"Yes, sir\", they agreed.\n\n\"Don't they fall out when you walk?\"\n\n\"No, they fall down in the back part.\"\n\n\"Show me.\"\n\n\"Sir?\"\n\n\"Show me how you insert them.\"\n\n\"Uh, do we really have to do that?\"\n\n\"Do you want to walk out of here today?\"\n\n\"Oh, yes sir!\"\n\n\"Well, then?\"\n\nBy this time Vanessa had seen the light at the end of the tunnel, and it was a flashlight on the end of Scott's dick. She realized that his request couldn't possibly be legal and it must mean that he was toying with them before giving them a slap on the wrist. She quickly took the balls from his hand and leaned back in her chair to show him exactly how she inserted them.\n\nScott was doing a good job of keeping his professional face on, but he didn't miss a detail as the beautiful coed spread her pussy lips and wet the balls in her mouth before slowly slipping them between the wet lips of her widespread cunt.\n\nI was very glad that nobody was paying any attention to me. The fatherly prick was at full stand in my pants and would have been impossible to hide if they had looked in my direction. Luckily, all four of us were locked onto the incredibly sensual actions of Vanessa as she pushed the balls deeper and deeper within the recesses of her inflamed pussy. Their lack of awareness of me allowed me to openly rub my prick through my pants, but I soon had to stop to keep from flooding my pants.\n\n\"Now, Miss Long. Please do the same.\"\n\n\"But you already saw how they work.\"\n\n\"I am entering into the record the fact that Miss Williams was very cooperative in this investigation.\"\n\n\"Oh! Ok, ok. Here! Look all you want!\" From her earlier comments and actions, I doubted that Karen really embarrassed, but was probably continuing to play the game she had planned in the first place. Making a great show of trying to hide her pussy, she nevertheless managed to get them inserted to her satisfaction after a great deal of poking and twisting. I suspected that she could have popped them in as easily as she popped them out, but was working Scott's attention for all it was worth. She certainly had mine.\nMy prick was so hard, it felt in danger of bursting, and I suspected that Scott's was, also.\n\nBoth girls still had their skirts around their waists, with their partially shaved pussies on display.\n\nScott left them sitting in this position for a few minutes before announcing his decision. \"Have either of you been in legal trouble before this?\"\n\n\"Oh, no sir!\" It seemed that they always answered in unison.\n\n\"Since this is your first offense, I am inclined to dismiss the more serious charges, but feel obligated to uphold a minor charge that can be discharged through community service.\"\n\nAgain, Vanessa picked up before Karen. Perhaps she sensed his meaning, perhaps she saw the size of the log in his pants. At any rate, she realized that the scare was over. \"What sort of community service, sir?\" She was languidly caressing her pussy as she asked.\n\n\"I have a certain amount of latitude in the actual form of the community service I can apply for such offenses. You will be advised at a later date. You are free to go now. I hope that you have both learned a lesson from this experience. Security is a very serious business. Those who fail to grasp this fact are asking for trouble. Have I made myself clear?\"\n\n\"Yes, sir. Thank you sir.\", they chorused again.\n\nScott took one more quick glance at the two beautiful pussies displayed before him and gathered his things to leave. \"Mr. Long, I assume that you will take care of the remaining details.\" When his back was to the girls, he gave me a wink and showed me that there was no tape in the recorder. The entire interview had been a scam, but he had gotten a good look at two luscious twats and had probably gotten their attention, as well. \"I will be in touch regarding the nature of the community service requirement\", he said as he left.\n\nWhile everyone had been absorbed in the Ben Wa insertion process, I had taken advantage of the opportunity to slip their panties in my pocket. The two thongs could have been hidden in a tooth cavity, but I got a kick out of having them and knowing that they would be wearing nothing under their short skirts as we left the building.\n\nNothing was said about the Ben Wa balls that I was extremely aware of.\n\n\"What happens now, Daddy?\" Karen appeared to be somewhat chastened, although I was beginning to understand just how much of the time she was playing a role.\n\nTwo could play that game. \"Your mother must be told that you have missed your flight. I will call her and let her know that you are ok and make up some story to explain the reason for missing it. You can stay in town tonight so you can catch the first plane out in the morning, so you don't miss any more classes than necessary.\"\n\nAgain, the chorus. \"But we don't have any money for a hotel or for food.\"\n\n\"Relax\", I assured them. I'll stay with you and take care of things for you, like always.\"\n\n\"Oh, thank you, Daddy! Thank you, thank you, thank you.\"\n\n\"Have we learned a lesson here today, girls?\"\n\n\"I don't know if you have, Mr. Long, but I certainly have. Can we go now? Where are our panties?\"\n\n\"The two of you can look for your clothes while I make arrangements to get you out of here.\" As soon as I was out of the room, I hurried to the surveillance room next door. When I entered, Officer Rodriguez was there as I had suspected, with a hand just clearing her crotch area when I burst into the room.\n\n\"Oh! Sir! You startled me. I was just witnessing the proceedings in case there was a need for backup later on.\"\n\nI was quite aware of her reasons for witnessing the proceedings and none of them were for my benefit. From the quickness of her breath and the flushed look on her face, it appeared that Scott and I were not the only ones who enjoyed the sight of a couple of neatly-trimmed pussies. I wondered if Officer Rodriguez was gay, or merely reveling in the sensuality of the moment.\n\n\"I'm sure you realize that it was quite unnecessary for you to witness this interview, Officer, uh, Angela?\" I resisted the urge to ask her what the other one was named. The 'Angela' nameplate was proudly attached to her left breast and held at a good distance from her chest. It seemed like a good time to put things on a more personal basis.\n\n\"Sir! Yes, sir. Perhaps I was a little overzealous, but it seemed better to err on the side of caution, if you know what I mean.\"\n\n\"Caution, Officer Rodriguez, or voyeurism?\"\n\n\"Sir! You can't think that I enjoy watching beautiful young girls exposing themselves to two lustful men who are using their positions to blackmail them.\"\n\n\"Blackmail? We were merely trying to teach them a lesson\", I huffed.\n\n\"Yeah, and I'm the Queen of bloody Sheba. Sir, begging your pardon, but you don't have to do all that to get what you want. Watching those girls has me as hot as a stove. I really hope you don't mind, but I need something fast.\"\n\nBefore I fully grasped the import of her words, she had knelt before me and managed to pull my still rigid prick from my pants. She must have been very, very hot and very certain of my probable response to make such a move. I watched as her mouth devoured my pretty good sized prick in one lunge. It felt so damned good to have it embedded in a warm place after the hour or so it had been pinched in my pants, begging for release of any kind. A blow job from the staff was completely unexpected, but just what the doctor advised.\n\nAs a mature man, I am not accustomed to blowing my nuts within seconds, but time served must have counted in this case. Almost as soon as her nose hit my pubic hair, I began unloading what seemed like gallons of hot, viscous cum down her throat.\n\nAngela did her best to swallow it all, but as soon as the spurts decayed to dribbles, she pinched my prick between two fingers to keep from dripping onto the floor and bent over the counter, offering her ass to me. She must have had her pants unzipped when I came into the room, because they dropped to the floor as she turned around.\n\nMy prick was still oozing cum when she backed onto it and began to fuck herself, using me only as a warm dildo. I knew neither of us would last long when we looked into the interview room through the one-way mirror and saw my daughter and her hot-blooded friend fingering each other's pussy as they kissed, deeply and hungrily. The sound of their voices came through the surveillance intercom quite nicely.\n\n\"Are you going to fuck your Dad tonight, Karen?\"\n\n\"Yeah, I think so. What about you? You want to fuck him, too?\"\n\n\"Yeah. Let's put on a show for him, first. He won't be able to resist. He didn't think anyone was watching him when I was putting the Ben Wa balls in my pussy, but I've seen it before, so I was watching him. He had this tremendous hardon and was rubbing it like crazy.\"\n\n\"He was?\"\n\n\"Yeah. He thought nobody was watching him, but you should have seen him when you spread your legs. I thought he was going to blow a gasket.\"\n\nTheir conversation and plans were too much for me and my fuckmate. We reached orgasm simultaneously. I'm not sure I had ever finished the first one and the second caught me off guard. It had been a very long time since I managed twice in one day. Twice in five minutes? No way! It must have been the extra stimulation that did it. The problem was, I had just been told that two beautiful young horny chicks expected me to fuck them both tonight. Was I able?\n\n\"Oh, sir. That was fantastic! I love your big cock. It stretches me more than anybody has ever done before. Do you think we can continue this relationship in the future? I get so horny sometimes and my husband's cock is so small.\"\n\n\"I think we can manage something, Angela. You're a pretty hot fuck yourself. Your husband must not stretch you very much.\"\n\n\"I'm not sure his fist is as big as your cock, sir, and I've never had a baby, so my pussy stays pretty tight. I hope you don't mind my asking, but are you really going to fuck your daughter tonight?\"\n\n\"Under other circumstances, I would stoutly deny any such accusation, but you've seen too much for my denial to have much value. While I admit that the idea is very exciting to me, I must remember that she is my daughter and such an act is impossible to take back. She may think she wants me to fuck her now, but might look back on it years from now and remember it quite differently.\"\n\n\"What about the other one? She looks pretty hot to me.\"\n\n\"She looks hot to me, too. Does that mean you are bisexual, Angela?\"\n\n\"Bi, tri, quad, whatever. All I know is that I enjoy sex and don't get enough. I've never done anything with another woman, but those two in there could turn me in a minute.\"\n\n\"Hmmm. Perhaps you should accompany us tonight, Officer Rodriguez. In a strictly professional capacity of course.\" I punctuated the last few words with quick thrusts of my hips, so she would know exactly what I meant by them.\n\n\"I always follow orders, sir.\"\n\n\"Good. Then you will accompany us to dinner and the hotel. I'll book a suite with a separate room for myself so they won't suspect anything. As much as I would love to fuck that hot Vanessa, I think the best plan is to put it off until another time.\"\n\n\"I agree, sir. Will you be coming to my room, then?\"\n\n\"You can count on that. Perhaps you can listen to them at the keyhole while I fuck your sweet ass.\"\n\n\"Ooooh! I've always wanted somebody to fuck me in the ass, but my husband thinks it's dirty. With his little dick, it would be the best place.\"\n\nWhen the girls learned that Angela would be going with us, it dampened their spirits considerably.\n\nI responded to their glum looks by telling them they were still under security surveillance and would be accompanied by two security personnel until they boarded their plane. It appeared to have taken the wind out of their sails and they were very quiet all the way into the city. The knowledge that they were naked under their short skirts, with Ben Wa balls clinking in their pussies was never very far from my mind.\n\nKaren sat up front with me and seemed to never miss an opportunity to flash her pussy at me. Whenever I glanced in the back seat, Vanessa always had her knees spread wide for me. It was very hard to concentrate on keeping the car on the road, especially when Karen turned sideways in her seat, facing me and kept up an animated conversation with Vanessa while swinging her right knee back and forth to make her pussy wink at me. I suspected that it caused a bit of clinking, also.\n\nThey brightened a little when I rented a three-bedroom suite at the hotel and they realized the potential for mischief. The wheels started spinning in their heads again.\n\n\"Officer Rodriguez will occupy the bedroom on the right, you girls can use the one in the center and I will be in the other. If you need anything, let either of us know. Just in case you have some silly idea of going out on the town and getting into more trouble after we turn in, I will keep your bags in my room and Officer Rodriguez will keep the clothes you are wearing, until morning. Clear?\n\n\"But what will we sleep in, Daddy?\"\n\n\"The bed, dear. Now hurry and get into something a little more formal. We're going out to eat. What would you like?\"\n\nNo more was said about the Ben Wa balls, so I could only surmise that they were still doing their duty as we left for the restaurant. Karen and Vanessa sat on either side of me in their evening frocks, with Angela across the table, looking a bit uncomfortable in her uniform. I would have enjoyed seeing her big tits in a low cut gown, too, but our charade was aided by her remaining in uniform.\n\nMy twin seductresses sat very close on either side of me and never passed up an opportunity to lean into me so I could get a glimpse down their cleavages and rub against the swelling of their tits. Occasionally, a hand on one side or the other would lightly touch my thigh. Sometimes, the hand would linger a bit, causing my breath to stop until it was withdrawn.\n\nBack at the suite, I took their suitcases into my room and left Angela to strip the girls of the clothes they were wearing. I figured she would get a kick out of it.\n\n\"It's getting late and you have an early flight, so I suggest that you get some sleep. That's what I intend to do.\" I excused myself and went to my room.\n\nAs arranged, Angela called me when she was finished with the girls.\n\n\"Did you lock their door?\", I asked.\n\n\"Well, sir. I made a great show of pretending to do so, but you and I both know that they could get out if they wanted to.\"\n\n\"You and I know it, but maybe they won't suspect that they have an avenue of escape besides through our rooms. After what I have learned about those two vixens today, even nudity might not stop them from going out on the town.\"\n\n\"Are you going to come to my room, sir?\", wistfully.\n\n\"Later, Angela. First, I want to see what they get up to. They aren't likely to stay up all night. When they seem resigned to their fate, I'll come around and we can have a quick fuck or two. Ok?\"\n\n\"I suppose so, sir, although it would be nice to fuck you all night long, if it were possible.\"\n\n\"Trust me, this won't be our last time. They will be gone tomorrow and we will have all the time we can get away.\"\n\nShe grudgingly agreed that this was our best course of action and hung up. I tried to nap a bit, but was still too excited from the day's events to drop off.\n\nI must have dropped off eventually because I was aware of being awakened by a weight on the edge of the bed. The room was very dark, so I couldn't see anything, but I heard a tiny, muffled giggle or two. Somebody raised the covers on one side and somebody else raised them on the other.\n\nOne hot mouth swallowed my rapidly lengthening prick and a very wet, juicy gash was rubbed across my chin. There was no way I could tell who was who, but it was fairly certain that I was either eating my daughter or she was eating me. Likewise, the other choice was occupied by an extremely beautiful, sexy girl of the same age. Either one would have been enough to raise the dick of a dead man. Both of them together could have raised the Titanic, although I was thinking of applying that name to what they were raising at the moment.\n\nThe one that was sitting on my face was rubbing her clit furiously, to continue an orgasm that she probably started having when we were in the car, and dribbled a steady stream of juice down my throat. When I rammed my tongue as far as it would go up her snatch, I felt the balls with the tip and managed to rattle them a bit, which only intensified her ecstasy.\n\nThe other one must have decided that her preparation of my prick was complete and climbed up to sit on it. Her cunt was on fire! It was the hottest, wettest, slickest pussy I ever imagined myself in. Added to all this was the realization that it might be my own daughter. Most people would be inhibited by the notion of incest, but the forbidden nature of the act only added to my excitement. This was one taboo that went out with birth control as far as I was concerned..\n\nIt took much longer this time for my balls to gather themselves and flood the tight box that enclosed my prick so hotly, but flood, it did. Apparently, my ability to cum was greater than I was accustomed, given my normal incentive. In fact, my dick remained hard after the third orgasm of the day for me, which was something I had never experienced. Perhaps it was the thought that I was still unsure whether I had fucked my daughter and wanted to stay in readiness in case they changed positions. Then I would know for sure.\n\nMy dreams came true in a couple of minutes. The pussy I had just fucked was planted over my mouth and the one that had been cumming so continuously was rammed down on my still stiff prick. Now I knew for certain--I just had no idea which was which, not that it mattered. My own cum leaked out of her cunt and into my greedy mouth. As a test, I tried to reach the balls in her cunt with my tongue and was rewarded with some very energetic bouncing.\n\nMy final orgasm of the day took much, much longer, but I'm not complaining. Neither were the girls. They switched off several times and one of them even had it up her ass when I went off for the last time. I knew it was the last time because I was utterly drained and there was no way I would be able to get it up again for at least several hours.\n\nWhen I awoke the next time, it was daylight. Karen was sucking my dick. Vanessa was nowhere to be seen. Waking up to a blow job had always been one of my favorite fantasies, but my wife would never agree to it. In fact, getting her to give me a blow job under any circumstances was difficult enough.\n\nAs it turned out, Karen was very good at her work. She kept a hard suction all the time, while tightly closing her mouth around me and rubbing the full length of her tongue along the sensitive underside of my prick. Her hand tickled and massaged my balls and occasionally she explored my asshole with the tip of her finger. Any worries I had about not being able to perform were answered before I was awake for ten seconds.\n\nI raised up on my elbows to watch my darling daughter perform such an act of love on her old man. My dick disappeared obscenely between her greedy lips with occasional smacking noises as she sucked too hard.\n\nI smiled at her. \"Good morning, baby. Do you like sucking dick? You're very good at it.\"\n\nShe took her mouth off my prick long enough to answer before continuing. \"Thanks, Daddy. I used to hear you begging Mom to give you a blow job before I even knew what they were and made a vow that I would give you the best one there ever was when I learned how.\"\n\n\"Well, this is certainly the best I've ever had and I'm willing to bet that it couldn't be much better. How did you hear your mom and me?\"\n\n\"I used to sneak into your room at night and listen to you fuck. I would lie on the floor beside your side of the bed and pretend you were fucking me. It wasn't easy being quiet when I came, but I usually timed it so I would come when you did. You make lots of noise, Daddy.\"\n\nShe went back to her blow job and was soon rewarded with a flow of hot juice from my overworked balls.\n\nAs we relaxed and snuggled together, I asked, \"Where is Vanessa?\"\n\n\"Come with me\", she crooked her finger at me and disappeared into the next room.\n\nWhen I caught up with her, it was in Angela's room. She and Vanessa were in a hot 69, greedily slurping pussy juices.\n\nAngela looked up to see me standing naked by the bed, with my daughter holding my dick. It was hard for her to talk, considering what Vanessa was doing to her pussy, but she managed to stammer out that Karen had loaned her Ben Wa balls out for a trial run and Vanessa was kind enough to try to get them out with her tongue.\n\nKaren bent over the bed and alternated kissing Vanessa and helping her lick Angela's cunt. For my part, I had a beautiful, well rounded ass sticking in my face so I fucked it.\n\n\"Well, sir. I suppose we now know the answer to the question of whether you would fuck your daughter.\"\n\n\"We probably knew all along, didn't we Officer Rodriguez?\", I smiled as I slammed the meat to my baby.\n\n\"I think we did, sir. All along. Any regrets?\"\n\n\"None that I can think of offhand. In one day, my sex life has gone from barely there to woweeee! If you are as horny as you say, my wife won't be bothered with my attentions much longer and I plan on visiting my daughter quite often if she will have time for her old decrepit Dad when she gets back to school.\"\n\n\"Daddy, you can cum see us any time you like. You fuck lots better than any of the boys at school. The only problem will be to keep the other girls in our house from draining your balls before we get a chance.\"\n\n\"If I'm dreaming, please let it go on forever.\"\n\nAngela and I saw the girls off on the next flight and began planning our sex life for the future. Stay tuned for the further adventures of Angela and Wyden.", "tags": ["miss long", "daddy karen", "body cavity", "security checkpoint", "metal balls", "cavity search", "room sir", "daughter time", "tight box", "metal detector"], "address": "https://www.literotica.com/s/ben-was-wont-pass-security"}, "3": {"title": "Our Embarrassing Honeymoon Story", "category": "Exhibitionist & Voyeur", "author": "sleek1", "short_description": "Ben-wa balls cause a clanging in public.", "story": "", "tags": ["bus started", "ben-wa balls", "decided leave", "ride back", "face chest", "buried face", "started moving", "back hotel", "wife"], "address": "https://www.literotica.com/s/our-embarrassing-honeymoon-story"}, "4": {"title": "Making You Suffer", "category": "Toys & Masturbation", "author": "Thecoffeeprincess", "short_description": "Teasing you with ben-wa balls and the aftermath.", "story": "", "tags": [], "address": "https://www.literotica.com/s/making-you-suffer"}, "5": {"title": "Hers Forever, Lacy and Amanda Ch. 01", "category": "Lesbian Sex", "author": "ruuddog", "short_description": "The Box was in the Closet.", "story": "The box was in the closet. I knew it was there. I was home when it was delivered. It was bigger than I thought it would be and now it was sitting in the bottom of the closet. I couldn't get my mind off of it. Amanda never actually said what was in the box but I knew. I was there when she ordered it. Hell I even had to be measured for it.\n\nYesterday I had walked in when Amanda and her friend Andrea were looking at the website for the bridal shop where Andrea worked. \n\n\"Lacy go stand in the middle of the room,\" Amanda had sharply said. I guessed she was going to have Andrea take my measurements. \n\n\"I'm never going to wear that thing - there's no point in any of this.\" I told her when I saw what she was looking at. I really didn't want to do it.\n\n\"You may change your mind,\" was all she said.  I sighed and went to the middle of the room. Andrea moved a small stool over in front of me.  \n\n\"Strip, Lacy.\" I didn't bother to argue. No point - I would do it eventually, and it was no big deal anyway since Andrea had seen me in the locker room plenty of times. I slowly removed all my clothes and stood up on the stool.\n\nAmanda had printed the measurement instructions from the web site and she handed the paper to Andrea. Andrea giggled when she saw the diagram and then she looked at Amanda. Amanda nodded and Andrea took her tape out of her bag and walked over toward me.\n\n\"I need you over here to write down these measurements as I call them out to you,\" Andrea said. Amanda grabbed a pen and an old magazine to write on and walked over. \n\nEven standing on the stool Amanda was taller than me. She laughed a little as her finger traced my slit. I was wet and turned on and she knew it. \n\n\"Don't get too turned on or you'll ruin Andrea's tape,\" she smirked. I knew I would be going crazy in a few minutes. I hadn't cum in almost two weeks. \n\n\"I don't see why you're doing this. I haven't been bad or anything.\" I was whining and Andrea giggled a little at me. The humiliation was turning me on even more. \n\n\"I know you haven't sweetie, but you could if you wanted to and that bothers me.\" Amanda was rubbing the small of my back, lightly in circles. She knows I love that. \n\nAndrea started measuring me and Amanda stopped rubbing my back to write them down. The really embarrassing part she had saved for last: the measurement up through my crotch and butt crack. She had to pull that tape up between the lips of my pussy and tight through the crack of my butt. I think she was pulling harder then she needed to.\n\n\"Well you definitely owe me a new tape Amanda.\" She tossed the really wet tape to Amanda who sidestepped it and it landed on the ground. I was blushing heavily. I had almost cum with that last measurement. I looked down and my whole crotch area was wet, I could see it glistening on my thighs. \n\nAndrea stepped over close to me and looked me in the eye. \"I could probably make you come right there on that stool. Would you get in trouble if I did?\" I nodded my head. I wasn't sure if she was allowed to touch me like that but I knew if she did, she was right, I would come pretty quick. \n\n\"When was the last time you got off Lacy?\" Andrea was smiling really big while she questioned me. \n\n\"Two weeks ago.\" I was whining again and pressing my thighs together like I had to pee. I looked over at Amanda hoping she would stop Andrea from teasing me but she was just smiling and watching.\n\n\"You know, Amanda said you would compensate me for taking your measurements. I am not a lesbian but you do have the prettiest little tongue.\" She reached up and ran her finger along my lips. I opened my mouth and licked her finger a little. \n\n\"Wow you are a horny little thing aren't you!\" Andrea was laughing and so was Amanda. I was standing up on display in front of two fully clothed girls being teased to distraction. I actually wanted to lick her. I knew she would tell people I did it. I think at that time I wanted her too. This was too good a story for her to keep quiet. \n\n\"Or for my payment I could just make you cum.\" She rubbed her finger from her other hand lightly across my pussy. I felt my knees weaken and I moaned while still licking her other finger. Then she pulled her hands away and started undoing her Jeans. When she dropped them to the floor and stepped out of them. She reached for her panties Amanda stopped her. \n\n\"Let her do it. It is so sexy. She just uses her teeth.\" Amanda pushed me off the stool and I dropped straight down in front of Andrea. Her panties were already wet. I went for the waist band with my teeth, but Amanda slapped my butt hard.\n\n\"Just the crotch Lacy nothing else.\" \n\nNow this is really hard; I have to crane my neck around to get a hold of them. Andrea's panties were really wet. I was having my doubts about her not being a lesbian. I could hear her moan and gasp. I was having to really dig in to get to them. Her taste was strong and she had a lot of hair. The smell was intoxicating. \n\nThen she came, screaming and holding on to my shoulders. I hadn't even removed her panties yet! Amanda reached over and kept her from collapsing completely. She gently moved her over on the couch. She was in a post orgasmic zone watching Amanda straddle her head on the couch. \n\nI could her Andrea whine a little then I saw Amanda start playing with her hair and I knew she was licking Amanda's pussy. I wanted to giggle at her but I just sat and watched as she pleasured Amanda. When I saw Amanda flinch a little I knew she was cumming. \n\n\"Oh Andrea that was great. Don't stop! Keep licking me while I come down.\" Amanda was still playing with her hair. Then I heard the best part. \"Now this will be our little secret. So resist the urge to gossip.\" \n\nWith that Amanda got up off the couch and walked over to me. \"Lacy, if Andrea wants to be real nice to you she can lick you to orgasm. That is the only chance you are going to get to cum until the belt arrives.\"\n\nI had already forgotten about the chastity belt that Andrea was here measuring me for. \n\nAmanda left the room and I just looked pleadingly at Andrea. She smiled kind of sweetly and nodded her head but she didn't move. So I walked over to her and took the same position as Amanda, even twirling her hair the way Amanda did. \n\nI felt her tongue start licking me and I knew I was going to cum quickly and cum hard. And in this position I was going to make a mess of her. I didn't warn her though, I just let it happen. I felt my orgasm tear through me. Sure enough, it was a hard climax and I felt the wetness gush out of me. Two weeks of being on the edge most of the time will do that to a girl! When I finally finished getting off I started to move but she grabbed my thighs and held me in place. She just kept licking me.\n\n\"I am not allowed to cum again,\" I protested, \"I'll get into a lot of trouble if you don't stop!\" She didn't stop. I knew this was her way of making sure she was not alone. She was trying to get me into trouble. I let her keep going. I looked over my shoulder and Amanda was standing there watching. Andrea was nibbling now. I think she could tell I was resisting her attempt to make me cum. Man for a straight girl she knew all the tricks.\n\n\"Please stop Andrea I don't want to get in trouble.\" She still didn't stop and now she was being really aggressive. Almost biting me and then licking really deeply. I looked back at Amanda. She was still smiling and I knew she was waiting for me to cum again. I could have pulled away but that's not how I am. This is her thing and I guess since Andrea had just licked her first two girls to orgasm in the space of five minutes then I could let her get me into trouble.\n\nBesides, if Amanda wasn't going to stop me, maybe I wouldn't get punished. At least that was what I was telling myself at the time, although I knew better. She had let other things go and then punished me later; this would be no different. Then I felt the last trick. \n\nI looked back at Andrea just as I felt her tongue make contact with my asshole. I came like crazy. I was looking at Amanda the whole time she was just shaking her head and smiling. I rode out the orgasm and pulled away slowly.\n\nAmanda grabbed me by the arm and pushed me toward the shower. \"Get in there and get cleaned up! Nobody told you two orgasms,\" she growled. I walked slowly into the bathroom. I could hear her talking to Andrea. I could tell by the sound of her voice she was smiling. \n\n\"You knew you were getting her in trouble I heard her tell you so what do you think I should do with you?\" I never heard the answer I just turned on the shower and stood under it. All the tension from the prior two weeks was released from my body and the hot water felt so good. I just stood there with it running over my head.\n\nSo now here I was two weeks later, just as frustrated as I was that day. At Amanda's insistence, I've been spending every night with my arms cuffed to the belt around my waist to prevent any \"incidents\". Amanda says I proved that I could not control myself. I tried to explain that I could and reminded her that I tried to stop Andrea. I did not want to wear that belt. I tried crying and begging, vowing that I would never let it happen again, but nothing worked. \n\nAmanda wasn't buying it. I think she just wanted me in that belt. I still had not agreed to put it on. She said she would never make me do it, that I had to do it of my own free will. I would have to do it to please her. That thing scared the hell out of me. I had seen the pictures on the internet. All the models looked so happy. They were just models and I already knew how frustrating it was not to be allowed to cum. \n\nIf I put that belt on I knew it would be a long time before she would take it off. She liked me on edge too much. Even when I cried myself to sleep now she wouldn't allow me release. She would lay beside me and comfort me but still she made me wait. \n\nI kept thinking that this could be the thing that drove us apart. I was willing not to cum for as long as I possibly could for her. It excited her and made her happy. Right now, it came down to the fact that it was my choice: I could make myself cum anytime I wanted and I knew it.  Amanda knew it too and it made her angry. \n\nI had given up trying to talk to her about it and settled into a deep sulk.\n\n\"I wish you would just play with yourself and get it over with!\" she yelled, \"that's what you want to do, isn't it!\" \n\n\"No, that is not what I want,\" I sighed. I wanted her to do it like she always did: I wanted her to let me, to make me. That was degrading but at least it was her masturbating me. I just went to bed and cried myself to sleep with my hands cuffed to my side. \n\nThe next morning, Amanda started in again, \"I really don't see the difference Lacy. You'll let me lock you up so you can't touch yourself. This is practically the same thing!\" I just looked at her. Our whole relationship seemed to revolve around that damn box in the bottom of the closet. \n\n\"I know, but you always let me out in the morning.\" I was trying to be honest with her but it just seemed to make her angrier.\n\n\"So you're afraid I won't let you out?\" she asked. \"You don't really trust me at all, do you?\"\n\nI did trust her but this was huge I needed more time without all this pressure.\n\n\"I trust you of course I do that is a horrible thing to say.\" She wanted too much. \n\n\"I wouldn't lock you away forever Lacy. I just need you to do this for me.\" she pleaded. \"I need to know you would do anything to please me.\" She sounded so sincere. I really did want to do anything to please her. \n\n\"I am so scared of that thing in there. It's so horrid. I will not be going without because I love you anymore, I will be doing it because you are forcing me too.\" I was trying to get her to relent.\n\n\"I want it Lacy, that should be enough. I need you to make a decision yes or no. I need it soon.\" She was not giving in. it was high stakes poker we were playing with our relationship. I knew in my heart if I never got to cum again I wanted to be with her. \n\n\"Can we try it for a week? Then if I don't like it you can let me out.\" I was trying to reason with her. \n\n\"My god Lacy, quit trying to put stipulations on it. I want it. Are you going to do it or not? I am leaving. I have a lunch thing with my mother. When I get back I want you in it. Kneeling right here on the floor with the key envelope in your mouth or throw the damn thing out and I will never ask you about it again.\" She turned and left. I was crying because I knew this was it.\n\nI went into the bedroom and pulled the box out. I would not be able to even cum before I put it on and it has already been two weeks. I loved Amanda I knew that. I started wondering how mean she would actually be. I opened the box. There were a lot of smaller boxes and one big plastic bag. I opened the small boxes and put the stuff out on the bed: there were dildos and butt plugs of various sizes that appeared to mount inside the belt. \n\nI pulled the bag out. On the outside someone had written in marker 'Custom fit for Lacy'. I almost threw the thing down when I saw that. But I kept going and opened the bag. And there it was. It looked horrible. All metal and grotesque like something out of a nightmare. There was also an envelope with my name written on it. It was Amanda's hand writing. I read the note.....\n\n\"I knew you would change your mind. I know all that you have been through lately but I really love you so much. I know I've made you miserable but I really need this. I can't even explain why. I need to know I can be as cruel as I want and you will always be there and if I have these keys I know you will be.\" \n\nI looked in the envelope and saw the keys.\n\n\"I already checked everything it all works perfectly. There is another shield that goes over the crotch that will make it impossible for you or anyone else to touch you. I have that with me. I will put it in place when I get home but for now just put the belt on and lock it. \n\n\"Lacy I love you! I won't say I won't be cruel because we would both know I'd be lying and this is about trust. Once the belt is locked around your waist you can masturbate all you want but not until. All my love Amanda\"\n\nI lifted the belt again. It was pretty heavy but I knew that was not going to be the most uncomfortable part. I thought I should at least try it. The note made it sound like I had made my decision but I didn't think I had. I pulled it on like a pair panties. It pushed together around my waist. It was very tight. I heard the click and just the waist was locked in place. I started to panic but then I remembered I still had the key. I slipped it into the built in lock, turned it and the waist instantly snapped loose.\n\nI locked it back again and reached down through my legs where the crotch part was dangling. I pulled it up to the front and pushed it into place and heard the click as it locked. I felt a rush. I had actually done it. It was uncomfortable but I knew I could wear it. Cheerleading would definitely be a problem in it, but that was mostly over for the year anyway. Besides, I was sure she would let me out for that anyway it since it was as important to her as it was to me.\n\nI reached down between my legs. I felt my own pussy which was something I had not done I a while. I had already shaved that morning. The belt was metal but it was lined with a plastic, not soft, but not cold like the metal. There were two bars around my pussy lips pushing them together. Then they continued around the back. In the front at the top was a locking device and I assumed that was where the plate Amanda had talked about mounted. \n\nI really wanted to masturbate now but I knew if I did, I had made my decision. I would make myself leave it on until Amanda got home. I went to the kitchen and made myself a bowl of cereal. I stayed in the belt as kind of a test run. It was not so bad. I was extremely wet. \n\nAs I ate I just kept imagining the things Amanda would make me do once I had given myself to her completely. She would have total control over my sex. I wouldn't have any choice. Could I do this, even for her? My clit was swollen and begging for attention. I was going to go crazy if I didn't stop thinking about this. \n\nWould she make me lick her and anyone else she wanted me to for weeks without release. I was getting so hot I was going to cum just thinking about it. I found I was trying to rub myself against the chair and that was difficult, even without the shield in place. \n\nWhat about months? Could I go months without getting off? I couldn't even imagine it. I saw myself begging and crying and Amanda merely smiling at me. I would make her promises and do anything she asked for release. I knew I would. \n\nIf she would have agreed to a week I would already be masturbating now but she would not compromise. I let my hand drift down to my pussy. I was soaking the chair. My juices were in a puddle right below my pussy. I touched them with my finger. I was very excited about this whole thing, that much I knew for sure. \n\nI wanted this to be humiliating; I don't know why, I just did, so I went into my room and got the video camera. I walked out into the kitchen. I placed the camera on the counter top and pointed it at the chair and turned it on. I spoke to it like I was talking to Amanda. \n\n\"I made my decision I haven't masturbated yet I wanted you to watch me do it.\" Then I walked over and I pointed at the chair. \"That big wet spot is just from me thinking about it. I can't believe how excited it makes me. Now I am going to seal the deal so to speak.\" \n\nI knelt down in front of the chair and started licking up my own juices. It was humiliating but exciting at the same time. My fingers were at my pussy now and my butt was pointed at the camera. I just started fingering myself, hard and fast while I licked the puddle in the chair. I came really quickly but I didn't stop until the chair was clean. \n\nMy face was slick with my juices and my finger buried in my pussy when I heard Amanda come in. I was cumming again and I knew I was in the wrong place. I jumped and ran to kneel in the middle of the floor but my knees were too weak and I fell to the cold tile. \n\n\"I was going to do it Amanda, I promise I was going to.\" I was crying now. I felt her hand on my back. \n\n\"That's ok sweetie, this is even better.\" I was just staring at her and she was staring at the video camera. \"I guess this is for me?\" I nodded my head and she kissed me.\n\n\"Come with me\" I got up now and followed her to the bedroom. \n\n\"Lay down on the bed - I want to finish this so I can cum too.\" She reached into her purse and pulled out the shield then she leaned down and licked me. She was acting crazy, licking me. \"Tell me when you get ready to cum.\" I knew now what she intended to do: she wanted me ready to cum when she locked me away. I could feel the tears running down my face. \n\n\"Now Amanda, now\" I was on the verge. She stopped I had my eyes closed but I heard her lock the last piece in place. Then she stood up and grabbed the envelope with the keys in it. \n\n\"I believe these belong to me?\" She looked at me and I nodded. She had a huge smile on her face. \"Now I want to see this little film you made me! Come here and lick me while I watch.\" Her demeanor was different now that she owned me and I knew it. I was safely locked away and she could use me however she wanted too. I got up and followed her to the living room.\n\n\"Kneel here while I hook this up to the TV.\" She pointed at the floor in front of the couch. I knelt down and waited. She hooked the camera up to the big screen and returned to the couch. She stood in front of me and lifted her skirt. I reached up and pulled her panties down her legs and off. I laid them on the floor next to me. \n\n\"Lick the crotch Lacy.\" This was new she was going to degrade me all the time now, I could tell. I pulled the panties up to my mouth and licked the crotch. I kept licking them while she sat down on the couch. \n\"Oh I can't believe how good this feels I know I can make you do anything I want and you can't say no.\" I just looked at her. She spread her legs open and I moved my head down and started to lick her she pressed play on the remote and I heard myself talking.\n\n\"Slow down Lacy! There's no hurry. After all, you're going to be there for a while.\"", "tags": ["lesbian", "femdom", "chastity", "humiliation"], "address": "https://literotica.com/s/hers-forever-lacy-and-amanda-ch-01"}, "6": {"title": "The Fuckerware Party Ch. 08", "category": "Lesbian Sex", "author": "Tappy_McWidestance", "short_description": "Tina tries to Seduce Lisette and bring her into the group.", "story": "As I walked into our house, I had a feeling of dread that we were about to have a knock down drag out fight that would destroy our marriage. I found Jim in the shower washing away the evidence of his evening. I decided that was a good idea so I headed to the guest bathroom and did the same. Jim was affectionate that night in bed, although it took a lot of foreplay before he could get hard again. I was surprised he even tried given the workout Judy gave him. I guess he was trying to keep his affair secret. In return for his affection, I tried to be more vocal, although since he wasn't being the wildman I saw earlier, I had to be a bit more restrained than Judy. I was getting tired so I faked an orgasm and felt him squirt a tiny load into my womb. We both fell asleep quickly. Any conversation would have to wait.\n\nI was on edge the rest of the weekend waiting for Jim to tell me about Judy, but he didn't. I started to think that maybe he really didn't know about the group yet. I knew I was going to have to discuss this with Mistresses Sharon and Linda at work on Monday, after doing my slave duties of course.\n\nAfter bringing my mistress to orgasm starting at 7:30 sharp Monday morning, I told her of my dilemma. She told me not to worry that everything would be taken care of. She was trying to teach me to trust the group. I wanted to, but my own insecurities were making it difficult. It was almost 8 and I had to get upstairs. Sharon had Toni come in to reassure me. She told me it was very tough to talk to her boyfriend about it too, but that Sharon could be very convincing when she wanted to be and soon he came around. I understood how convincing Sharon could be so I laughed a little.\n\nMistress Linda didn't want to talk about Jim. She wanted to talk about what slave I was going to recruit for Suzy. I told her Lisette was my first choice, but I didn't have a clue how to do it. She told me to talk to Suzy and see if her calendar was free for a Friday toy party. She said she would talk to Faith about having Judy host again. This time the party would be a setup. She's getting all the mistresses and slaves to come. Everybody would be in on the goal of seducing Lisette except for her. It would be fun.\n\nI'd have never come up with that kind of party as fun, especially if I was the object of the party. But then again maybe some of Suzy's parties were more like that than I realized. I sent Suzy an email and confirmed that Friday would work for her and asked if she could check with Jill. She said that was good for her and since Jill would do whatever she told her to do, it would be fine with her too. I received an email a little while later from Judy she confirmed that she could host and that Faith could also be there. She also said Helen, Faith's other slave had confirmed. Becky, Molly and Cathy rounded out the group from our office. So we had three mistresses and seven slaves confirmed. Lisette didn't stand a chance. Now we just had to make sure she attended.\n\nThankfully Judy took care of that. She said Lisette was happy to be invited. Given her lack of enthusiasm at the last party that surprised me a little, but as I was learning, the women of the group can be very persuasive. The rest of the week went by in typical fashion. By typical I mean that I served my mistress every morning at 7:30 and my boss sometime during the day. We only went downstairs once during the week and LaShawn was the beneficiary of my paying the room tax. I know Linda took one of her slaves downstairs each day so the security guards were certainly well taken care of this week. Mistress Faith called me over one night. Jim wasn't home and I don't know if he was with Judy since we didn't repeat the video link. We did repeat her treating her like a doggie and then doing me from behind. This time she took my ass and I loved it. Mike wasn't home though so I didn't get my creamy desert. Fortunately Jim was more than capable when he got home and we made very passionate love. It seemed like things were finally starting to stabilize.\n\nFriday all the slaves in my office (myself, Cathy, Molly and Becky) were kept on edge by Sharon and Linda. They told us they wanted us \"primed\" for the party. I wasn't sure what to expect that night, but I was sure I would enjoy myself. We were instructed to be there at 7:30. Mistress Suzy laid out the plan. Since Lisette didn't know I had joined Suzy as a demonstrator, tonight I would be a regular customer. Suzy would do her regular sales pitch, but we were all to be more sexually expressive and try on the clothes and test the toys. We should start leaving the living room like Lisette would expect, but as the night wore on, we should show her more and more. We should also talk about how great the toys felt and how they have helped in our respective marriages. I almost felt sorry for Lisette. I didn't know if Judy and Jill had been denied their orgasms today, but I knew the rest of us were randy for action. Unfortunately Mistress Sharon and Toni already had a special night planned with Sharon's husband so they were not there.\n\nAt 8pm the doorbell range and Lisette entered the lion's den. She was dressed casually again. She was still cute as a button with her blonde hair up in a pony tail. I could see why Suzy wanted to take her. If all went well, tonight she would. The party started as each one did with casual conversation and a few bottles of wine, cheese and crackers. It seemed Lisette was in a good mood. It was hard to gauge the group's mood because I couldn't tell who was acting a part and who was being genuine. Around 8:40 Suzy began the demonstrations. The tone was decidedly more sexual than at the first party Lisette and I attended. Cathy was the first to test drive a toy and Jill soon followed. They disappeared upstairs, probably to the same bedroom. Both came back flushed and a little sweaty. All the slaves took their turns upstairs. I noticed as Suzy talked, Mistress Linda and Mistress Faith kept trying to steer the conversation with Lisette to her husband, whether she was happy, whether she was fulfilled and tried to assess their next move. They were not as direct as I make it sound. They were experts at driving the conversation subtly. We all joined in at various times to make sure it didn't sound like we were interrogating Lisette. She was cautious and obviously didn't share intimate information about herself easily. But the mistresses got the information they needed eventually as we purposely kept the conversation light and disarming. I must say Linda and Faith were masterful.\n\nI could tell everyone except possibly Lisette was getting hot and bothered by her seduction. I still couldn't quite tell about her. Jill and I modeled a few provocative outfits for the group, although our purpose was more to gauge Lisette reaction to having us stand in front of her. She was a tough nut to crack. While we were back in the bedroom changing into our clothes, Jill took me in her arms and gave me a passionate kiss.\n\n\"God, I've been dying to do that all night,\" she breathlessly exclaimed. \"Suzy's teased me all week and not let me cum once. If Lisette doesn't crack soon I'm going to rape her.\"\n\n\"Rape her?\"\n\n\"Well not really. But I'm ready to tear off her clothes and have a big orgy. Aren't you?\"\n\n\"The orgy part sounds good. I just don't think she's right for the group.\"\n\n\"She's right. I can see it in her eyes. She's just got a block in her mind. We'll wear her down.\"\n\nWe headed back to the party. Suzy had convinced Lisette to at least hold one of the more powerful vibrators. She looked a little scared as Suzy turned it on, but she didn't put it down. Her eyes were downcast as she stared at the toy buzzing in her hand. The party almost stopped as everyone but Suzy was staring at her. Suzy kept her sales banter up, the professional that she is, so that Lisette since she wasn't watching would think everything was normal. The tone had definitely changed.\n\nI expected that we were finally breaking through her barriers. I hoped she would excuse herself to try the toy. Suzy even suggested it. But Lisette held fast. She turned off the vibrator and handed it back to Suzy. I could tell Suzy was trying to decide what to do.\n\n\"That's about it ladies. That's all I brought,\" she announced. \n\n\"Don't you have anything else?\" Faith asked. \"Did you bring your special toys in the car?\"\n\nSuzy looked at her for a moment.\n\n\"I've got my bondage demonstration case in the car. Is that what you mean? I didn't think you girls were into that,\" she lied.\n\n\"How about it girls? Do you want to see the bondage toys?\" she asked the group.\n\nUnanimously, except for Lisette, everyone answered yes. Lisette looked a little scared. Suzy went out to the car while Judy opened another two bottles of wine. I wondered if Faith was pushing Lisette too far too fast. Suzy returned with two more cases. I recognized one contained the bondage bed. The other held various restraints, collars, crops, whips and the like. Suzy opened the cases on the floor.\n\n\"Volunteers?\" she asked.\n\nI was ready, but I wasn't sure how the mistresses intended to play this so I remained quiet as all the slaves did. Mistress Faith was the first to talk. \n\n\"Let's spin the bottle to pick a volunteer.\"\n\n\"A fine idea Faith,\" Suzy declared.\n\nJudy grabbed one of the empty wine bottles. I felt like I was at a kinky high school party. Suzy laid out a couple of quick rules.\n\n\"I need two volunteers. We will spin the bottle twice. Whoever is chosen will come with me into the bedroom and I'll dress you. You'll then model for the rest of the group.\"\n\nJill and I had sat down on either side of Lisette. I'm sure she was petrified about being picked. Suzy kneeled in the middle and spun the bottle. I could tell she was trying to predict how much resistance would be needed to pick Lisette. Unfortunately she was a little light and got Jill. Not to say Jill wasn't happy. She gave a little clap and stood up. Suzy reset the bottle. I noticed she was starting the bottle in a slightly different position trying to make a better spin. I doubt Lisette noticed. Looking over at her as the bottle spun I could see a bead of sweat on her cheek. She was also staring daggers at the bottle. I think everybody else but Suzy was looking at her. \n\nSuzy did her best. You could almost make the argument that she hit her target as the bottle stopped between Lisette and me. I expected Suzy, Faith or Linda to claim Lisette was the winner, but I knew the bottle was just past the half way point between us. Suzy declared me the selected one and I acted happy. I really wasn't acting. I was happy. I just wished Lisette had been selected so the peer pressure, fueled by her wine consumption, might drive her to letting herself go. I joined Jill and Suzy in the bedroom.\n\n\"Well girls,\" Suzy began. \"How many times have we found ourselves in this situation? I think Lisette is going to need a different tactic. Just do one of our regular party shows and see where it goes.\"\n\nWe dressed in our bondage themed outfits. I was wearing leather. Jill was in latex. We both looked hot. Suzy collared us and led us back to the group with leashes attached to our collars. We received a rousing round of applause from everyone by Lisette. She looked very uncomfortable. Suzy led us from woman to woman. I could tell Lisette was squirming as we stood before her. She was the only one not to cop a discrete feel while checking out the outfits. We were running out of time as our husbands would soon be expecting us home so Suzy turned up the heat. As Jill and I were showing the various cuffs, blindfolds and tails to the women, Suzy was busy setting up the bondage bed. Looking to us she asked for a volunteer. Neither of us did. In my case I wanted to keep up the appearance that we were not the most willing participants. I assumed Jill just wanted me tied up again.\n\nSuzy solved the problem by having us play rock, paper, scissors to determine who would \"volunteer.\" Jill won. Her paper covered my rock and I was quickly restrained on the dining room table. I could see the group converge around me. Lisette stayed in her chair. Suzy did her best to sell the benefits of the bondage bed. Everyone looking already knew about this wonderful piece of equipment, but they kept asking questions for Lisette's benefit. In reality they were more interested in touching my body. I doubt Lisette could see through the wall of female flesh to see them teasing me, but I hoped she could. Suzy stopped talking and walked back into the living room. I'm sure she was putting the final push on Lisette. Mistress Faith had slid a finger into my pussy. She was done playing games and her wonderful digit brought the expected moan from my mouth. Linda pulled my left breast out of my leather bra and began sucking on it. More moans from me. I imagined Suzy putting the moves on Lisette, breaking through her defenses and not sharing her as the group was concentrating on me. But I was right where I wanted to be. I had hands all over my body. They were squeezing, rubbing, poking, prodding and gloriously pushing themselves inside by pussy. The \"sales\" party was over. The real party was beginning. I guess I was on the bed for about 15 minutes before the group splintered off back to the living room. Linda pulled the Velcro straps off and helped me to my feet. They had not let me come yet, but I was sure I would be soon.\n\nI walked into the living room and Lisette and Suzy were gone. I didn't know what happened. Did Suzy convert her and take her upstairs? Did Lisette run home in terror? The front door opened and Suzy returned carrying another case. Lisette was not with her. \n\n\"I did my best girls, but she went home.\"\n\nA wave of disappointment swept over the group.\n\n\"But I did bring something special for our slaves.\"\n\nSuzy brought the case to the center of the room. She unhooked the snaps and folded it flat. Inside were a strap-on dildo, a chin dildo and four dildos with shorter straps. I recognized the first two but the other four were a mystery. I wasn't sure what they were for. Mistress Suzy, now in her dominate voice instead of her sales voice ordered me to the center of the room. I stood still as she stripped me of my leather sales costume and attached the strap-on around my hips. She then attached the chin dildo in place and told me to lie down.\n\n\"Good girl. Now spread your arms and legs. Wait; turn so your pussy faces the couch. OK. Good.\"\n\nMistress Faith and Mistress Linda were sitting on the couch looking directly at my glistening pussy. Mistress Suzy then went to work strapping the other four dildos to my thighs and forearms. I had six fake dicks standing at attention from various parts of my body. I knew what was coming next. I think everybody did. Mistress Suzy didn't have to say a word. Quickly the six other slaves were shedding their clothes and mounting one of my cocks. I could do nothing but lay on the ground as Cathy's pussy slid up and down on my chin dildo. Her pungent ass was bouncing on my face. I could feel the other girls fucking themselves, but the only pleasure I was getting was an indirect pressure on my clit from the strap-on. The other slaves apparently did not have that problem as the sounds of girl love echoed in the room and the smell of happy women filled the air.\n\nI could only imagine the looks of satisfaction coming from the couch. The mistresses had six beautiful women facing them as they fucked themselves silly. Everyone was getting what they wanted except me. But until we took Lisette, I'd be low woman on the hierarchy so what could I do? Nothing except wait as the six other slaves fucked themselves until they all came. I think Cathy came twice. The front row, Jill, Becky and Molly, got the privilege of crawling to the couch and satisfying our mistresses. Cathy helped me out of the strap-on harness and then dropped to her knees and made sure I received my pleasure. I thanked her with a deep wet kiss. I could taste myself on her lips. The party broke up after that. I didn't know what the next play was with Lisette. I figured Suzy, Faith and Linda would figure that out. \n\nIt turns out, Lisette made the next move. She arrived at my house the next morning and looked as cute as ever. We went out in the backyard and sat on our patio chatting and enjoying our morning coffee. I didn't bring up the party. I was waiting for her to make the first move.\n\n\"Can I ask you something personal, Tina?\" she began\n\n\"Of course. Ask anything.\"\n\n\"Did you enjoy being tied to the table last night?\"\n\n\"Actually I did. Bondage can be very fun.\"\n\n\"I'm not sure. I kind of freaked out last night.\"\n\n\"Freaked out? What do you mean,\" I asked.\n\nI could tell Lisette was uncomfortable, but at the same time wanted to talk about this. I just had to give her enough space to come to me in her own time. I saw that she was thinking about how to phrase her next sentence. Unfortunately Jim decided that was the perfect time to walk out onto the patio. Immediately the look on Lisette's face told me our conversation was over.\n\n\"Good morning girls,\" Jim said joyfully.\n\n\"Lisette, let me introduce my husband Jim,\" I said.\n\nLisette extended her hand and greeting Jim. The three of us made small talk while Lisette finished her coffee and then she excused herself to go home. I was silently cursing Jim as I walked Lisette to the front door. As she was leaving, Lisette asked if I could come over to her house later to talk. I was elated, although I tried not to show it. I agreed, of course, and told her I'd be over in about an hour. She said that was fine. She'd have the coffee ready.\n\nSitting in Lisette's kitchen an hour later she seemed much more at home, both literally and figuratively. She made a point of telling me her husband was off at the golf course as he always was on the weekend. Humm, alone for hours every Saturday and Sunday. My devious mind began to plot. We got back onto the conversation we started on my patio. Lisette was a totally different person. It was like she had been holding her feelings in for so long that now that she had a sympathetic ear, she was going let it all hang out.\n\nShe told me about the neglect of her husband. About how at their young age he should be passionate every night but it seemed like sex was a chore for him. I told her I could sympathize. She told me about her growing up having very few boyfriends and even in college not dating too often. How she had only had four sexual partners in her life which seemed unreal to me as cute as she was. Certainly the boys in college would have been beating a path to her door. How she really wanted to buy a vibrator at the party but was too embarrassed and a host of other juicy details I filled away in my memory to share with the mistresses.\n\nI just kept nodding and letting her talk as she poured out her heart to me. I'd speak when I needed to, but mostly I let her ramble until a direct question snapped me back.\n\n\"Did you and Judy have sex at the party?\"\n\nSo far Lisette's entire monologue had been about her husband and guys in general. This was the first time she mentioned another woman. I figured I didn't have anything to lose at this point by telling the truth.\n\n\"Yes.\"\n\n\"Did you like it?\"\n\n\"Yes I did.\"\n\n\"But you're both married?\"\n\n\"True. But my story isn't that different from yours. My sex life at home wasn't that great. I did buy a toy at the first party we went to and things sort of happened from there.\"\n\nI didn't feel the need to detail what those things were at this point.\n\n\"Lately I've been wondering what it would be like to be with another woman,\" she confessed.\n\nWas she hitting on me? We had the house to ourselves for a while. She was acting very coy. Was this an open invitation or not? I decided not to push my luck.\n\n\"It's wonderful being with another woman. They are so different from men. I still love Jim, but I get a certain satisfaction from being with a woman that in some ways is much better.\"\nI hoped that made sense to her. I wanted to just jump her and I struggled to restrain myself. She looked at me like she was thinking about my response and formulating her own.\n\n\"I'm not sure, Tina. It seems so naughty.\"\n\nI chuckled to myself at her choice of naughty as an adjective.\n\n\"It is if you do it right,\" I responded with a little laugh to show her I might be joking.\n\nI decided now was the time to make my move so I moved over to her a planted a soft kiss on her lips. She didn't really respond, but she didn't pull away either. I moved back and looked at her waiting for either approval to do it again or a signal to back off. She really didn't give me either.\n\n\"Was that OK?\" I asked.\n\nLisette paused. \"I guess so,\" she responded.\n\n\"Can I do it again?\" I asked.\n\nShe paused again. \"Yes.\"\n\nI moved over to her again and gave her another gentle kiss. She was more responsive this time. I didn't want to push my luck so I didn't give her the deep passionate kiss I wanted to. If everything went right, that would happen soon enough.\n\nI pulled back again waiting for a reaction. I watched as she licked her lips slightly and then looked at me.\n\n\"I'm sorry Tina. I'm not sure about this.\"\n\n\"There's nothing to be sorry about Lisette,\" I answered. \"If it's not for you, then it's not for you. No harm done.\"\n\n\"No, that's not it. I think it might be for me, but not with you. I'm sorry.\"\n\nLisette was visible shaken. I was a little shaken too. What was wrong with me?\n\n\"I don't understand.\"\n\n\"It's not you, Tina. It's me.\"\n\n\"I still don't understand.\"\n\n\"As I told you, I've been curious about being with a woman for a while. But it would be weird to be with somebody I know when it's my first time. If it went terribly wrong it would be too awkward to see you in the neighborhood. I'm sorry if I led you on.\" \n\n\"Don't worry, Lisette. I understand. You think, correct me if I'm wrong, that you would rather have a one-night stand to break your girl on girl cherry, so to speak. Then if you don't like it, you don't have to see that person again.\"\n\n\"Exactly. Is that weird?\"\n\n\"Sort of, but it makes sense on some level too. Why don't you just go to a gay bar and let yourself be picked up. You are a beautiful young woman. I have no doubt you could find somebody who turns you on.\"\n\n\"I'd be way too scared of doing that,\" she countered. \"I'm too shy.\"\n\nI thought for a minute. A plan was hatching to turn this to the group's advantage.\n\n\"What if I went to the bar with you as your wing woman? I could run interference for you until you found what you are looking for. If you're with me, you'll be safer. If whoever hits on you doesn't interest you, you can pretend to be with me.\"\n\nI couldn't believe I came up with that plan on the spot. I'd take her to the bar and have Mistress Sharon and Toni conveniently show up and pick her up. Toni was close to her age and beautiful. If Lisette didn't fall for her, then Mistress Sharon could use her exquisite powers of persuasion to capture her. The only risk would be having somebody else get to her first.\n\n\"What do you think?\" I asked.\n\n\"What about my husband? Isn't he going to notice?\"\n\n\"You said he's a golf nut right? Well my husband Jim is going to his annual golf buddies weekend in two weeks. He's got some friends from college who all meet at a different course each year and play as much as they can for two days. He's leaving Friday afternoon and getting back late Sunday night. I'm sure I could get an invitation for your hubby. I remember Jim saying they only had 7 this year and were still looking for an 8th.\"\n\nI could see the wheels turning in her head.\n\n\"I bet your husband would appreciate that you're thinking of him by giving him time away to do what he loves. Plus, if you find somebody, you don't have to worry about him getting in the way. It's a win/win situation.\"\n\nI'd laid it out the best I could. If this didn't work, I was ready to give up on her and find somebody else. To my joy, Lisette agreed. I gave her a hug, but no kiss. She seemed almost disappointed but I wanted to respect her stated desire. I went home and talked to Jim. He seemed pleased that I found him a new playing partner. Now I just had to get Mistress Sharon and Toni on board. \n\nI called my mistress and told her of my plan. She congratulated me on working it out. She said she had talked to Suzy after the party and they were struggling a bit formulating their own plan. She told me she would make sure Toni was at Club Uno by 8:45 on Friday. She said it didn't get crowded until after 11 so there wouldn't be too much competition to worry about. She said we should arrive by 9 and that she would be there by 9:15. She wanted Toni to try and pick up Lisette, but if she was hesitant, I should let Toni pick me up. No problem there I thought.\n\nI was to let Toni join us at our table. That would help shut out more perspective suitors who troll for single girls or couples more than groups. Mistress Sharon said that after she arrived she would take charge. I would be going home with whoever Lisette didn't pick. I guess I was the consolation prize.\n\nBy the time I hung up the phone I was wet with excitement. Lisette would be my first seduction and I was looking forward to it. During the week I visited Suzy to tell her my plan. She was so happy she gave me a good fucking without asking for any oral favors in return. Of course I gave her pleasure anyway. That's just the kind of girl I am.\n\nI could hardly wait for our date night to arrive. Lisette called me 3 or 4 times that next week to go over the details. It was always the same questions. What should I wear? How should I act? What goes on at a gay bar? And on and on. I kept trying to reassure her just to go with the flow. Dress like you would at a dance club. Wear something sexy. You're trying to meet someone to take you home so it paid to advertise. As for how to act, just be yourself. Expect to be asked to dance and don't freak out if a girl touches you more intimately than a guy would at a regular bar. The girls will know you're a virgin. Some like that, some don't. And wear your wedding ring. If asked, just admit you're curious. Tell them you're looking for some instruction. They'll like that. I was pretty much talking out of my butt at this point. I'd never been to this bar and I had no clue what Sharon was planning or what she was telling Toni to do. The big day finally came. The boys left at 4 to begin the 3 hour drive to the resort. I told Lisette to shower, shave, dress and come over about 8. \n\nI got myself ready early. I was on pins and needles. Mistress Sharon called to confirm we were still a go. I dressed for success. I wore a dress with a plunging neck line that hugged my hips and then flared out to a hem about 4 inches above my knees. I pulled on some stay up stockings and put on a sexy pair of open toe shoes with a 3 inch heel. For some reason I didn't choose my sexiest lingerie. I picked a regular thong and bra. I guess since my destiny for the night had already been decided, it never occurred to me to wear nicer lingerie. \n\nLisette however took my advice to dress sexy. She was a vision when she appeared at my door. I wanted to forget the bar and take her right to the bedroom, which I told her. She hesitated as if she was contemplating my offer. I knew Mistress Sharon would punish me severely for screwing up the plan so I quickly rescinded the offer, gracefully of course. I served Lisette a glass of wine and then a second to relax her. The bar wasn't too far across town so we left my house at 8:40. I could tell she was anxious. So was I.\n\nTraffic wasn't bad for a Friday night so I wasn't worried about being on time. I wasn't worried until I noticed the temperature gauge on the dashboard was rapidly climbing. Something was wrong with the engine. We were not too far from the bar, but I wasn't sure if we could make it. It was now 8:55 and the gauge just went into the red zone on the dial. I spied a small auto garage I'd never noticed before. The lights in the service bay were still on so I pulled in. Lisette and I both got out of the car. She waited next to it while I went inside. Fortunately the door was still open. The sign said they were open until 9, but nobody was at the counter. There was a bell on the counter so I rang it. There was no immediate response so I did the next best thing. I sent a text to my mistress and Toni that we were having car trouble and would be there as soon as we could. I figured Sharon would get the message although I didn't know if Toni would hear her phone. I rang the bell a second time. From the shop area a heard a woman's voice call out \"hold on.\"\n\nI waited as patiently as I could, but time was wasting away. A minute or two later a short woman walked out of the service area. She was wearing coveralls and a baseball cap with the garage's logo on it. Her hair was pulled back in a ponytail through the cap's adjustment strap. Her face was dirty from a mix of sweat and grease. She was obviously the mechanic. Her nametag said Ronda.\n\n\"My car's overheating,\" I told her.\n\nShe gave me a deliberate look up and down before answering.\n\n\"OK. I'm kind of busy and we're about to close up. Can I look at it tomorrow?\"\n\nI told her we were on the way out for the evening. She peered out the window and saw Toni leaning against the car. She looked like she should be in a music video.\n\n\"And just where are you heading?\" she asked.\n\nI didn't think it would hurt to tell her, so I said \"Club Uno.\"\n\n\"Oh, two of those kind of girls,\" she said.\n\n\"What kind of girls? I've never been there before\" I asked.\n\n\"Club Uno is for posers. It's a decent enough place. It's clean and the drinks are reasonably priced. But if you're looking for hard core action it isn't there. The crowd is mainly suburban weekend bi housewives looking to scratch some itch their husbands can't handle.\"\n\nI couldn't believe she described Lisette and to a lesser extent me perfectly. I felt required to defend our honor.\n\n\"Not all of us are prissy housewives. We can handle ourselves.\"\n\n\"You couldn't handle me sweetie. I chew up little girls like you and spit them out.\"\n\nI didn't like being called a little girl. Especially by someone I was a few inches taller than and of about the same age.\n\n\"Oh, I can handle whatever you can dish out,\" I countered.\n\n\"I doubt it. Fem girls like you exist to be punished and to please strong women like me. But I'll make you a deal. Leave your car. I live upstairs in the apartment so I'll start some diagnostics and then come back down and see if I can fix it. Take a cab over to the club. Do your little pedestrian dancing. Let some girly girl buy you drink. Heck let yourself be picked up for an unsatisfying night eating pussy. I'll have your car ready by morning. Or...\"\n\nI waited as her option hung in the air.\n\n\"Be back here by midnight. That's when I usually go out. But if you come back, know that I don't take no for an answer and I indent on teaching you what you definitely will not find at the club.\"\n\nShe gave me a card with the garage's phone number on it.\n\n\"Don't worry it rings upstairs too.\"\n\nShe then called a cab for us and walked outside to look at the engine. It was steaming when she opened the hood. Lisette and I peered over her shoulder as she tried to get a look.\n\n\"I'm going to have to let this thing cool down. Leave everything to me.\"\n\nShe shut the hood and took the keys. The cab arrived and Lisette got in the back seat. Ronda was shutting the garage door and walked back over to me.\n\n\"Bring her back tonight and I'll go easy on you,\" she said with a smirk.\n\nI watched as she turned without another word and walked back into the garage office. She never even asked for my name. The cab driver honked his horn so I quickly joined Lisette in the back seat. We told him where to go and we were off. \n\nWe arrived at the club at 9:15. I was glad to be only 15 minutes late. I hoped Mistress Sharon wasn't too upset, but it couldn't be helped. We walked into the bar. It was dimly lit as I expected and a strong dance beat was blaring out of the speakers. I spotted Toni sitting at the bar. She looked at Lisette and smiled at me. I lead Lisette in and ordered two glasses of white wine. I looked around and noticed a few unoccupied booths near a hallway where a sign said bathrooms. I was surprised to see a number of men present. Apparently I assumed it would be all women. Of course the men were all paired with each other. I steered Lisette over to one of the booths. It was around the corner from the dance floor so it wasn't quite as loud. \n\nLooking around while Lisette got settled I saw several predatory looking women watching us. I looked at Toni who was watching them too. I hoped Sharon would arrive soon. I saw Toni pull out her phone and send a message. Just as we were finishing our first drink, I saw her stand up. She appeared at our table with a tray of three wine glasses and asked if she could join us. I looked to Lisette who nodded. I thought she would like Toni. \n\nWe talked and sipped our wine. Toni was not overly aggressive, which was probably a good choice this time. I nervously sat waiting for my Mistress to arrive. I was there to bring Lisette, but I also wanted to play myself. We were almost done with our drinks when I saw Sharon walk through the door. Almost on cue, Toni asked if we wanted another glass of wine. Lisette quickly agreed. I guess she thought some liquid courage would help her too. \n\nToni walked back to the bar. I was trying to watch Sharon without being too obvious. I knew her plan was to take Lisette home and educate her and I was wondering how she planned to do that. Toni arrived with three more glasses of wine just as the song from the DJ ended and the next one began. I had no idea who the artist was, but Toni exclaimed, \"I love this song. Who wants to dance?\"\n\nI looked at Lisette who had the appearance of needing at least one more glass of courage. I told Toni I was game. Maybe if I started having a good time Lisette could loosen up. Toni took my hand and led me to the floor. I loved to dance and Toni was an expert. I loved watching her shake her sexy body as I did my best to put on a good show for her. I hoped Lisette could see us from the table, but I was more concerned with Toni at the moment. Some other women began to dance near us and for a few moments I was concerned they would be hitting on us. I had to remember to be focused on our task.\n\nI saw Sharon walking around the corner. I yelled into Toni ear asking whether we should go back to the table. She yelled back no, not yet. We stayed on the dance floor for two more song. I was sweating and more than a little turned on by shaking my body in such close proximity to Toni and to the other women at the bar. Finally when the song ended, Toni took my hand and started walking off the floor. A new song started as we were walking around the corner to our booth. I wasn't surprised to see Sharon leading a giddy Lisette out onto the floor. Her proper seduction had begun.\n\nI wanted to stay at the corner where we could see the dance floor but Toni pulled me back to the booth.\n\n\"Give them some privacy. Lisette will get weirded out by you watching her.\"\n\n\"I told her I would watch out for her.\"\n\n\"You already left her alone once. She thinks you're trying to hook up with me. She'll be fine. Anyway, Mistress Sharon has everything under control. The plan is working perfectly.\"\n\nI sat down with a bit of a huff, but Toni put an end to that. She slid in next to me and grabbed my head pulling me into a torrid French kiss. We made out with a passion which had me leaking juices into my thong as she began to run her hands all over my body. She held me close for the length of the entire song doing her best to turn me on. And it worked. When she finally broke the kiss for air, I was breathless. I'm sure my makeup was smeared. Toni looked a little worse for wear too, but there was definitely a fire in her eyes. I looked back toward the dance floor, but Sharon and Lisette had not returned. Toni took a sip of wine and then rested her head on my shoulder. I took a sip of my wine and put my arm around her. I wanted more, but I'd have to wait until the next part of Sharon's plan was implemented.\n\nAs it turned out, to my surprise and joy, that was only about 3 minutes in the making. After the second song ended, Toni once again began ferociously kissing me. She was holding my neck with her right hand while her left ran itself all over my body and finally up under my dress, along my thighs and onto my pussy. I was making little whimpering sounds as I begged her with my eyes to finger fuck me every time she pulled my head back to breath. I was guessing Mistress Sharon's plan was to get me aroused enough to join whatever perverted thing she had planned for Lisette. Either that or Toni was enjoying her temporary position of power she held as Sharon's assistant for the night.\n\nI was thoroughly enjoying Toni's hand sliding up and down my slit and having her tongue explore every inch of my mouth when Lisette and Sharon returned to the booth. I didn't notice them walking up. Rather I felt the change of weight as Lisette slid into the other side of the booth. Toni broke our furious kiss and released my neck. Her body posture however, remained very possessive as she was bent slightly over my left shoulder to give her left hand better access under my dress. I noticed Lisette looked down my body as Toni's fingers finally pushed their way into my holy spot. I knew she couldn't see anything through my dress, but there was a lump where Toni's hand was cupping my mound. I closed my eyes and threw my head back. I released a soft moan when Toni flicked my clit. It was obvious what we were doing.\n\nI opened my eyes expecting Lisette to have freaked out, but she didn't. She was sitting watching our show intently with a mixed expression of fear and curiousness. She took a big swig of her wine and then excused herself to go to the bathroom. All three of us watched her closely as she disappeared down the hallway.\n\n\"How did your dance go Mistress?\" Toni asked.\n\n\"Fine. She's an open book. We're going to my place soon. By morning Suzy will have her slave girl.\" Sharon replied matter-of-factly.\n\nI was in awe. How could she do that in a 10 minutes of conversation and 10 minutes on the dance floor? I watched as Sharon pulled a small bag out of her handbag. She gave it to Toni. Toni looked at me and then gestured toward the bathroom.\n\n\"Make sure she sees you going into the stall,\" Mistress Sharon commanded.\n\nWe both nodded, although I didn't know what I was agreeing to do. Toni led me back to the lady's room. I hoped only Lisette was there. I hadn't seen anybody else going down the hall, but I'd been distracted. Toni pushed me through the bathroom door. She was acting drunk and staggering a bit. This must have been part of the game. Lisette was standing at the sink trying to touch up her make-up. She must have been serious about Sharon and wanted to look good for her. I looked at her and I knew she had seen us in the mirror. I raised my hand to wave to her, but \"drunken\" Toni continued to shove me along the walls toward the stalls. I lost sight of Lisette as Toni directed me to the handicapped stall. Once the door was secure, she became sober Toni again and whispered in my ear, \"That was fun.\"\n\nToni proceeded to lift my dress and pull down my thong. She then got down on her knees and dropped my dress over her head. The touch of her tongue on my lustful pussy was electric. I moaned again. This time it wasn't a soft moan either. I knew Lisette could hear me. Opening my eyes I looked down and noticed Toni's feet would clearly be visible under the stall door. I heard the bathroom door open and close. Lisette before she left or whoever came in would instantly know what was happening.\nToni wasn't working with subtleties. She slid two fingers into my pussy while she munched my clit trying to get me off as quick as possible. I was guessing Sharon wanted us to make an appearance at the table before she left with her conquest so Toni was hurrying. I felt strange grabbing Toni's head since I couldn't see it, but I was starting to become unsteady the closer I got to climaxing. She was taking me closer and closer and my sounds were getting louder and louder. I heard a toilet flush in the stall next to us and a yell of \"get a room.\" It wasn't either Sharon or Lisette's voice. That was enough to set me off. I showered Toni with love and she lapped up every drop. I was breathing hard and unable to speak when she pulled her head back from under my dress. Her face was a mess, but she was smiling. \n\nI expected her to pick up my underwear, but instead she reached into the bag Sharon had given her, apparently for a replacement. She pulled out a strange looking thong. It had what looked like a plastic cup on the front and a luggage lock on the back. I was confused. Fortunately Toni explained.\n\n\"Sharon wants me to stop at her house to help speed Toni's training. She knew that without an orgasm you would be likely to find a new partner here tonight so she wanted me to help you out. She also gave me this to make sure. If you need to pee, you better do it now.\"\n\nI hiked up my dress and sat down on the toilet. Toni's eyes were locked on mine. Lust burned in my soul as I tried to relax enough to pee in front of her. Finally I did, but it was humiliating and arousing at the same time. I looked at the contraption as she began to slide it up my leg. The purpose of the garment quickly made sense as she had me stand up. Toni positioned the cup over my pussy. It was a tight smooth fit. There were a series of small holes drilled into the plastic near the bottom. The back of the panty was a thick strap which covered my backside, although there was a generously sized reinforced hole directly over my asshole. Built into the top of the panty was a thick belt which Toni cinched tight and locked in the back. Whatever this was, it wasn't coming off without a key. Then it hit me. It was a chastity panty.\n\nToni pulled my dress back down and stood up to lead me out of the bathroom. She didn't stop to fix her make-up and she didn't let me stop to let me fix mine. By the time we were in the hallway walking back to the booth, she was once again Drunk Toni. I joined her faking a drunk stagger. We collapsed back into the booth. As I slid around I noticed Sharon's hand was under Lisette's skirt. I was happy for her. Our trip to the bathroom was not included in the short amount of chit chat while Sharon and Lisette finished their glasses of wine. Sharon then announced it had been nice to meet us and stood up extending her hand to Lisette. She smiled at me and took Sharon's hand allowing herself to be led out of the club and into her own adventure. As they passed the bar Sharon repositioned Lisette in front of her. She then looked back at us and pulled Lisette's thong out of her handbag. She waved it like a trophy for our benefit and the viewing jealous of the other woman at the bar and then flung it to the bartender and continued to follow Lisette out. Toni perked up immediately.\n\n\"I had fun in the bathroom. I'm looking forward to playing with you again soon. Mistress told me to expect her tomorrow morning at your house. She wants you to be naked and waiting for her.\"\n\nWith that she was up and walking toward the door. I was left in the booth alone. My pussy was wet but protected from me doing anything about it. I sat by myself sipping my wine. Several other women stopped by and began chatting me up, but restricted as I was, I didn't bother even giving them the time of day. I slowly finished my wine trying to gather my thoughts and then got up and left. It was now 11:30 and I was going home to an empty house.\n\nI walked into the parking lot and suddenly remembered I didn't have a car. It was still at the shop. I fished around in my purse and found the card I had received from the garage. I opened up my cell and dialed the number. Ronda answered the phone on the fifth ring. She was as surly as she had been when I dropped off the car. She told me she was getting ready to go out for the night and that I should get the car tomorrow. I told her we were done at the club and I could grab a cab and get it right now. She told me if I could get there before she left, that was fine, but I'd better make it within 15 minutes. I looked around hoping a cab would be driving by. As luck would have it, one was just pulling in dropping off two guys. I told Ronda there was a cab right here and that I was on my way. She told me to come up the stairs in the back to the apartment.\n\nI arrived 8 minutes later. The lights were still on in the apartment, although the garage area was dark. The cab driver asked if I wanted him to stay for a few minutes but I was sure she was home so I told him he could go. I looked at the window of the apartment one more time as I was getting out of the cab. I saw a silhouette of a thin, busty, long haired woman walk past. Who was that I wondered?\n\nI began to walk to the back of the garage. The chastity panty reminded me with every step that I was going to be without relief until Mistress Faith removed it. The area behind the garage where I was looking for the stairs was unlit. It was kind of scary, but I needed my car. I found the stairs and slowly made my way up to the landing. There was a door in bad need of a paint job. I wasn't expecting the inside to be any nicer. I knocked on the door and waited. Then I knocked again. I'd seen somebody inside and the apartment couldn't be that big. I knocked a third time. From inside I heard an angry voice.\n\n\"I heard you the first time bitch. Keep your panties on.\"\n\nI couldn't take my panties off if I wanted to. I heard the deadbolt click and the door swung open. Ronda backed away and I walked in. Only this wasn't the Ronda I saw in the garage. The girl in the coveralls was a greasy and plain looking mess. This Ronda was obvious ready for a kinky night on the town. Her coveralls had been replaced with tight, hip hugging leather pants than ended just at the top of her ass crack. I could see that clearly as she walked away from me. Her leather halter top ended just below her breasts and obviously had a built in push up bra. I hadn't noticed her breasts in the coveralls, but obviously she was stacked and not afraid to display her charms. Her abs was tight and she had a pierced belly button. I wondered what other piercings she might have. Her hair, instead of being pulled back was now down and framed her head with a gentle wave. It was jet black and matched her leather. Looking down, I noticed she also was wearing leather boots with stiletto heels and a silver metal tip. She looked like the biker chick from hell. The inside of my chastity panty immediately got a little wetter. She definitely oozed confidence and the ability to back up the threats she made earlier.\n\n\"So I guess you didn't find what you were looking for at Club Uno,\" she began.\n\n\"Oh, I wouldn't say that. I'd say the night went fine,\" I replied.\n\n\"No, if you found what you needed, you wouldn't be here now.\"\n\nI didn't want to get in an argument, so I didn't reply again. I watched as Ronda began to advance on me.\n\n\"No, you've been thinking about what I do to weak fem girls. I'm sure some other fem girls tried to pick you up at the bar, but you know you need someone stronger.\"\n\nShe was close enough that I could smell her leather and her words were cutting me to the bone. She invaded my personal space. Although she was shorter than me, with her boots on the extra inch of her heel over my heel helped equalize our height. When she told me to kick my shoes off I did. She now had an inch height advantage. But height wasn't the only advantage she possessed. She had the aggressive nature than turned my knees to jelly. If she wanted me she could have me. She knew it and I knew it. She told me to pull up my dress. She wanted to check if it was wet for her. I wondered what her reaction would be to my panties.\n\n\"What the hell?\"", "tags": ["submission", "lesbian", "chastity", "seduction", "bdsm", "toys", "group"], "address": "https://literotica.com/s/the-fuckerware-party-ch-08"}, "7": {"title": "The Replacement", "category": "Lesbian Sex", "author": "skinnysailor", "short_description": "A new one is trained.", "story": "My Mothers impressed upon me the importance of keeping up standards when I took up my birthright as Lady Parkwood. One was to always have a pleasure slave for overnight guests. Since I gave Tina to the Admiral as a cabin boy, the search was on for a replacement.\n\nI went to the government 'Age of Submission' auction, and several private auctions but had no luck. I believe a pleasure slave should first and foremost be pleasing to the eye. Most of the offerings were plain looking at best. I did bid on a chubby little thing with a beautiful face, but was outbid.\n\nA dealer I'd done business with before drew me aside. \"I don't have a picture with me, and it's not on my web site yet, but keep an open mind and come see her. I think you'll be interested.\"\n\nWell, if she were an angler and I was a trout, the hook was set.\n\nThat night I took the willowy maid Vivian to bed. Rather than punish bad behavior I prefer to reward good. Vivian has been very good so I'll reward her.\n\nI wait on the couch in my suite for her. I wear the sheer long sleeve ankle length gown that was to be worn over a black teddy. It's see through material so soft and light. It flows when I move. Forget the teddy.\n\nA gentle tap on my door and there's my sweet bed warmer. Vivian is slim and pale. I have her light brown hair cut to just touch her shoulders. She's wearing the nightie we gave her for Christmas. Pale pink, short sleeves, mid thigh length. It has medium pink ribbons that tie in bows all down the front. The satin like material is so liquid, her little nipples are poking at it. I knew the nightie would be perfect for her. She's just like a special present to open.\n\nShe stands in front of me looking down. Her arms at her side, her hands clasped in front. Her feet bare. I just love how she always starts off so shy.\n\nI pat the couch beside me. \"Come sit with me Sweetheart.\" I stroke her long silken hair, then gently hold her shoulder. I lift her chin with a finger and turn her face to me. I give her a warm smile. She looks inquiringly back. Those pretty big brown eyes. Then she gives me that heart melting shy smile. I kiss her lips. Vivian is a yummy kisser. We kiss some more. Soon her lips part and her tongue is poking my lips apart. I love how her kisses go from shy, to exploring, to desperately needy.\n\nSoon her hands were no longer folded on her lap. I feel little fingers walking under the material of my robe and tracing around my nipples. I spread the gossamer material away.\n\n\"Please Sweetheart.\"\n\nVivian kissed down my neck and began kissing fondling and suckling. Her other hand was stroking my pussy lips.\n\nI stroked her hair aside and kissed her neck. I stroked down her satin covered back. Her lips were on my nipples. Her fingers were in my cunt. \n\n\"Good girl, good baby, yes, that's my sweetie, yes. Mm yes.\"\n\nVivian slips to the carpet between my legs. She looks up at me. her smile is no longer shy, it's lustful.\n\nWow, what a kisser. I'm leaning back, eyes closed, luxuriating in Vivian's talent. A finger on my G spot, a kiss on my clit and she begins a low growling hum.\n\nThat's it! All I can do is hang on and gasp.\n\nThe east wall of my bedroom is all glass. The full moon is just rising across the valley. When I'm calm enough to speak I say, \"Turn out the lights Baby, lets go to bed.\"\n\nWhoever did the housework in my suite today made the bed with the royal blue satin sheets. In the moonlight they look black, contrasting with my cutie's pale skin and light pink nightie. She seems to almost glow.\n\nI dropped my robe on the couch while she was turning out the lights. I gently laid her back on the bed and kissed her. I straddled her and began undoing the pink bows. Starting at her collar. She looked up at me, biting her lower lip. Her mouth opened and the tip of her tongue traced along her upper lip as I untied each pretty pink bow.. Down down, slowly, gently, bow to bow.\n\nLast one. I fold the right side of her nightie open. Then the left side. What a trim little body. Small boobs, little pink nipples. I don't have her shave because her pubes are such a silky little patch.\n\nOne nipple between the thumb and fore finger of each hand, I roll them until they are hard little nubs. Vivian moans. I increase pressure then pull them. She squeals. I kiss each one.\n\nI kiss down. I stick my tongue into her belly button. She squeals and giggles. I tickle my nose in her silky patch. I kiss her cunt lips, then scoop her legs onto my shoulders.\n\nI push my tongue into her. I spread her open with my fingers. She's very wet. Her juices are flowing. I kiss and lap her sweet treat. I lightly touch the tip of a finger to her clit. Vivian gasps, but her conditioning is powerful. I push three fingers deep inside her. Vivian is mewing, but she doesn't cum.\n\nI look up at her pretty eyes. She looks back, so desperate.\n\n\"Baby, you may cum for me.\" I kiss her clit.\n\nVivian gasps then giggles. Her heels beat my back as she thrashes. Her hands hold my face down.\n\nSo satisfying. 'Yes Baby, you deserve this,' I think.\n\nWhen she lands I kiss my way up and pull the satin sheet over us as I cuddle her. She snuggles closer and whispers in my ear. \"I love you.\"\n\n\"I know sweetheart. I love you too.\"\n\nAfter I've fallen asleep she will quietly go to her room, of course.\n\n*********\n\nRebeca my hostess, picks the maid's uniforms each day. When Kate, with the curly red hair brings my tea to my room I see it's a 'naughty school girl' day. They'll all be wearing shiny black flats, white ankle socks, blue micro mini skirts white cotton panties, white cotton shirts and blue neckties. The ones with long enough hair will have it in pony tails held with blue ribbons.\n\nI worked in my office until Sharon came to say lunch was ready. I phoned the dealer to make sure she's be there then asked Rebeca to have a car and driver ready after lunch.\n\nThe dealer, Marian, has her showroom on the third floor of a downtown office/retail building. We sat on a red velvet couch. Her assistant brought coffee.\n\n\"Darling, bring in number seven please.\"\n\nNumber seven was quite the item.\n\nA little taller than me. Big brown eyes, long lashes, high cheek bones, straight thin nose and beautiful teeth. Her long straight brown hair was cut in a 'V\" that ended half way down her slender back. Her breasts were high and plump with big aureola and inch long nipples the diameter of my thumb. She had a thin waist and generous hips, and long long legs. Her perfect skin was a beautiful tan. Her pubes were trimmed to a little arrowhead pointing at her cunt. \n\nShe stood tall and proud, glancing contemptuously down at us.\n\n\"Turn around Girl.\" I tried to sound like a mistress. Wow what a piece. Absolutely flawless.\n\n\"Take it away.\"\n\n\"What? Didn't you like it? Have you ever seen a more beautiful one?\"\n\n\"No, very beautiful. The problem is it knows it too. It's never been broken. That's why it's here. Right?\"\n\n\"Well, er, the previous owner had some issues with it.\"\n\n\"So, what are you asking?\"\n\nShe quoted a price. \n\nI wrote a figure on the back of one of my calling cards\n\n\"Oh no, Lady Parkwood, I have to make a living here.\"\n\n\"Well, I'll keep looking. Keep my card, if you change your mind call me.\"\n\nAfter days later Marian called with a counter offer. We dickered, and settled on a price. I went to my toy box and got restraints to take along.\n\n\"By the way, does it have a name?\"\n\n\"Marlene.\"\n\n\"Ah.\"\n\nEven packaged to travel with a ball gag and drool running down it's chin, Marlene's elbows cuffed behind it's back, and ankles hobbled, it still managed to look imperial.\n\nI'd left instructions that only Rebeca should meet me when I returned. We took it into the French parlour to the left of the entrance, and I instructed for Rebeca to bring the maids and two bottles of wine at four. I stood my new purchase by the window and read my book.\n\nAt exactly four the rest arrived. Murmurs but no surprised gasps. Word travels fast in my little home.\n\n\"Tammy, Jill, will you serve the wine, please. Robin, there should be a deck of playing cards in the drawer over there. Will you bring it please.\"\n\nI waited until everyone (Except the new one) had a glass.\n\n\"True Love Darlings.\" We toasted. \n\n\"Now, sweethearts as you know Tina is now the Admiral's cabin boy. Anyone of you is beautiful and talented enough to replace her, but the Captain and I just love you all too much to share you with guests, so, that is Wanda, our new pleasure slave.\" Changing her name is the first step in breaking her. \"Now, we're all going to have fun working together training her. Now, lets unwrap her and see what she looks like.\n\n\"Kate. be a dear and lead Wanda to the center of the room.\n\n\"Good, Vivian, take off her blindfold.\n\n\"Robin, her ball gag.\n\n\"Jill, her ankle cuffs.\n\n\"Good, Tammy, the cuffs at her elbows.\n\n\"Sharon, unbutton and remove her frock.\n\n\"Oh dear, nothing for Kate. I'll think of something later honey.\"\n\nI shuffled the cards. \"Now, everyone draw a card. Aces high, high card wins.\"\n\nSharon drew the high card. \"Sharon is the winner. Dear, Wanda is yours for the night. \n\nTammy, open another bottle of wine and give a glass to Wanda. Robin, go tell Chef we'll all eat in the blue dining room. That's a good girl.\"\n\nWhat a lovely evening surrounded by my beautiful girls, laughing and talking. About eight Sharon asked to be excused, and led Wanda by the hand. Wanda tried to remain aloof but the others were having none of that, asking her questions and talking about life here on the estate. As they began to file out I put my hand on Kate's shoulder. \"Why don't you come with me sweetie. You look very beautiful tonight.\" She smiled. Her green eyes twinkled.\n\n\"Draw a bubble bath while I select some nighties.\"\n\nCurly red hair, white freckled skin, green eyes. She has round handful size breasts and a plump tush. I keep her pussy shaved.\n\nSo smooth soapy and slippery. We have a long fun bath. We thoroughly scrub each other.\n\n\" Mm, my little water nymph likes having her ass hole cleaned doesn't she?\"\n\n\"Yes. Yes please, Mam.\"\n\nWe dry each other off. I give her a pale green satin nightie. Calf length, sleeveless ,backless. I wore my red baby doll. The music was low and soft. We danced close.\n\nI slid a finger down her smooth freckled back. I slid it under her satin nightie and rubbed her sphincter. She moaned and kissed my neck.\n\n\"You know where I keep it. Bring the lube too, Love.\"\n\nShe's down on her knees practically licking her lips as I adjust the strap on. She kisses the big purple knob. She licks then swallows before putting a glop of lube on the palm of her hand and spreading it along the nine inch shaft.\n\n\"On the bed Baby, you know the position.\"\n\nHer cheek on a pillow, her elbows on the mattress, her behind up in the air. I lift the hem of her nightie. What a beautiful tush.\n\nAs I finger her wet cunt I slide the purple treat into her ass. She rocks back towards it as I stroke and finger fuck her. She's very vocal.\n\n\"Yes, yes , fuck me hard. I'm a bad bitch.\"\n\n\"What are you?\"\n\n\"I'm a bad worthless cunt.\"\n\n\"Who's cunt?\"\n\n\"Yours Mistress. Yours.\"\n\n\"Whose ass hole?\"\n\n\"Yours. I'm your no good slut Mistress.\"\n\nI know she's ready. \"You may come for me now.\"\n\n\"Aaah! Yes, yes, oh oh.\"\n\nKate begins crying. Big full body shaking sobs. I pull out and throw the strap on aside and pull her to me. I cuddle and sooth her. \"You're alright baby. I love you I'll protect you. Calm down. It's OK sweetheart. I've got you. Hush. Hush.\"\n\n\"I'm sorry. I'm sorry. Please forgive me. Sorry. Sorry. I'm no good. Sorry.\"\n\nKate's sobs become smaller, then sniffles, then slow steady breathing. As I cuddle her, sleeping in my arms I wonder what happened before I got her.\n\n*******\n\nWhen Jill brought my morning tea it was a 'little grey dress with extreme spike heels' day. Sexy! Her legs displayed so nicely. The dress that hugs her from four inches above her knees to her bare shoulders. The half sleeves to her elbows. With her short straight black hair and perfect make up, well, what away to start the day.\n\nAfter breakfast I ask Rebeca to bring Wanda to my office.\n\nEven naked and barefoot she stood proud and straight, smirking at me.\n\n\"Wanda, down.\"\n\nShe started to sit on a chair.\n\n\"No. Bad girl. On your knees.\" I pointed at the floor in front of my desk. She obeyed but looked defiantly at me. \n\n\"Lets get this straight. I, OWN, YOU! I make the rules. Your pretty face, your mouth, your cunt, your asshole and your mind belong to me. Your feelings are of no importance. My pleasure, and that of whoever I give you to, is all that matters.\"\n\nShe continued to smirk. Probably heard this lecture before. I stood and walked around my desk. I stroked her cheek, then ran by fingers through her long straight hair. She smiled.\n\nSMACK! She didn't see the full swing flat palm slap on her cheek coming.\n\n\"Now Wanda, my little fuck toy, lets talk about the rules.\"\n\n\"One, you will never look anyone in the eyes without permission.\n\n\"Two, anyone gives you an order, you will say \"Yes Mam.\" and do it.\n\n\"Three, you will not speak unless asked to.\n\n\"Four, you will pleasure everyone who asks you, In any way they want, from guest to stable girl, during your training.\"\n\nHere's Rebeca, good timing.\n\n\"Stand up.\"\n\nShe got to her feet and kept looking at the floor. She thought this training wouldn't last and she'd be in charge as with her previous owners, no doubt.\n\n\"Spread your legs so Rebeca can dress you.\"\n\nShe looked at Rebeca. Rebeca slapped Wanda's face. \"Lady Jennifer did not give you permission to look.\" She moved behind Wanda and reached between Wanda's long smooth legs. She stroked and fingered Wanda's cunt until she started to moan, then pulled back. \"Remember this Cunt, because it'll be a long time before you feel it again.\" Rebeca then strapped the chastity device around and between Wanda's hips and legs. She snapped the lock in place and gave me the key on it's fine golden chain.\n\n\"Bring in the others Rebeca.\"\n\nShe opened the office door. \"Ladies, come in please.\"\n\nThe maids all filed in.\n\nMy turn to speak. \"Ladies, Wanda is now in training. She's yours to use for your pleasure any time. She will help you with your chores. If her actions are not completely satisfactory, if she refuses an order, or is slow to comply, please let Rebeca know. Rebeca.\"\n\n\"Tammy, take her to the dressing room and give her a sack dress, she will be yours today, enjoy her and make her work. Bring her back here at four. Right, everyone, no questions... Good, off to work then, Darlings.\"\n\nRebeca lingered, then gently closed the door.\n\n\"What is it Sweetheart?\"\n\n\"Well, Jen, well, I miss you. It's been over two weeks since, you know?\" She looked down and blushed. A tear ran down her cheek. My mothers gave me Rebeca as a graduation present. She's about five years older than me. We're much more than owner and slave. She's like my big sister and best friend and lover. Of course I never had her 'conditioned'. She taught me so much.\n\nI fold her into my arms. \"Oh Darling, I never meant to hurt you. I'm sorry. Oh. Love. May I come to your room tonight?\"\n\nShe nods. I dry her tears with a tissue, and kiss her cheek.\n\nWhen Jill and Wanda come to my office at four they are surprised to see a security guard as well as Rebeca and I waiting.\n\n\"Wanda, down.\"\n\nShe kept her eyes down and knelt on the carpet where I pointed. Good start.\n\n\"Jill, did Wanda behave?\"\n\n\"Yes, My Lady.\"\n\n\"Did she ,Dear? Don't try to protect her.\"\n\n'Well, she didn't want to clean the toilets in the bathroom, but she did clean the shower stalls. Did a very good job of it too.\"\n\n\"Thank you Jill. You may go and join the others. That's a good girl.\"\n\nI nodded to Rebeca who scooped Wanda's long hair up. \"Hold your hair out of the way, Bitch.\" She then locked a wide leather collar around Wanda's throat.\n\n\"Stand. Pick up that bag.\"\n\nThe four of us went in the elevator then to the dormitory floor. Each maid has her own bedroom. There is a common lounge. We went to the bathroom area with toilets, showers, a long counter with sinks and a mirrored wall.\n\n\"Set the bag on the counter and take the chain out of it.\"\n\nRebeca took the chain. It had padlocks at each end. She said, \"wrap the chain snug around that middle toilet and lock it.\"\n\nWanda looked at the guard, then got down and did as told.\n\n\"Stay down.\" There was about a meter of tail to the chain. Rebeca locked it to Wanda's collar. She couldn't get standing, or even sit on the seat. She was on her hands and knees on the hard tile floor in the small stall. I thanked the guard and sent her back to her regular duties.\n\n\"Now, Wanda, I expect this will be the last time you refuse an order. Sweet dreams, someone will come for you in the morning.\"\n\nRebeca has her own suite, next to mine. She took my hand and led me to it. There was a bucket with a bottle of Champagne, (Dom) and two glasses waiting. We sat on the love seat and toasted. We sipped and kissed.\n\nDon't get me wrong. I love my Susan to the end of time, but Becky and I will always be together. Actually Captain Sue loves Becky too and is glad she's here with me when she's at sea. The threesomes have been amazing too, I might add.\n\nRobin and Tammy came in with a trolley. They set a table for two, lit candles, curtsied, dimmed the lights and left.\n\nRebeca held my chair.\n\n\"Why, Miss Rebeca, are you trying to seduce me?\" I giggled.\n\n\"Now, just relax. Don't you worry about a thing Little Princess.\" Becky swept my hair aside and kissed my neck. I just melt whenever she calls me her 'Little Princess'.\n\nSuch a slow romantic dinner. Hands touching hands. Fingers stroking. Smooth feet sliding up legs. Finger feeding each other, soft words.\n\nArm in arm, she led me to the bedroom. We undressed each other. Becky sat upright, her back to the padded headboard, her legs spread. \"Come, sit with me.\"\n\nI sat between her legs and leaned back to her embrace. One hand traced up and down from my chin to my pussy. The other hand gently cupped my left boob. She nuzzled my neck.\n\n\"That's right Sweetheart. Just relax. Let me guide you.\" Her gentle touch combined with her soothing voice. \"Yes my beautiful Princess, you're safe with me. Remember what I taught you. Let everything go. Center your being. Becky will guide you. Be a gentle beautiful flower. You are swaying in a warm breeze. That's it.\"\n\nConscious thought drifted away. Fingers were inside me. I floated to their calling. It was beautiful, satisfying, warm and cuddly all mixed together. There were colors I couldn't describe, and music I couldn't identify. There was love and happiness beyond naming.\n\nI was tucked under her arm, she was stroking my hair and gently kissing my face.\n\n\"Feel better now, Little Princess?\"\n\n\"How did you know I needed this?\"\n\n\"Hush, hush, Baby. Sleep now. You're safe with me.\"\n\n******\n\nIt was a 'sexy maid' day when Vivian brought our tea, wearing extreme red spike heels, and a red velvet little number with white lace trim at the hem, cuffs and plunging collar. Her makeup was very slutty. Rebeca licked her lips. I know who she'll have tonight. She gave Vivian the key to the padlocks.\n\n\"Go get Wanda. Breakfast and bathroom, but no shower. You may have her today. Don't be shy about using her mouth to pleasure yourself. Touch her all you want. Make her work too. Bring her to the office at three thirty, Dear.\"\n\nLittle or no sleep, no shower, her hair tangled, no makeup, no orgasm. Wanda looked like crap. Vivian looked absolutely fuckable in her little red dress and 'whore' makeup.\n\nWanda stood looking down. Nice.\n\n\"Three thirty already? Well, has Wanda been a good girl?\"\n\n\"Yes Lady Jennifer. She did exactly as told, and right away.\"\n\n\"Did she pleasure you? Was her mouth good?\"\n\"Yes Mam. She's a good kisser too. Mam.\" \n\n\"Let's go to the playroom Ladies.\"\n\nThe playroom's furniture is all upholstered in soft grey leather. There is a couch, a love seat, several chairs, some without arms, and a big hard mattress bed. There is a wall of mirrors, and in one corner a toilette and basin. Just inside the door is a cabinet on short legs. It's doors open to reveal a display of restraining devices, sex toys and discipline instruments.\n\n\"Vivian, four of the red fur cuffs, and the two foot spreader bar.\n\n\"Wanda, take off your dress and stand there.\n\n\"The ankles and spreader bar first Dear, then her wrists. Join them behind her back.\"\n\nI removed Wanda's chastity belt and pulled her head down to me and kissed her. A long slow kiss. She was a good kisser.\n\nI rubbed her pubic mound. I slipped a finger inside her. I manipulated her until she began to moan. I pulled my finger out and stepped back.\n\n\"Mgah!\"\n\n\"What?\"\n\n\"Nothing Mam.\"\n\n\"Good. Sit on the edge of the bed.\"\n\nStanding behind Vivian as she knelt and ate Wanda, I massaged her shoulders and watched Wanda closely. When she was close to cuming I pulled Vivian back.\n\nWanda moaned.\n\nWe repeated.\n\nWanda whimpered.\n\n\"You will learn self discipline. You will only cum if given permission. Now, let's continue.\"\n\nAfter a few more edges I had them change places. When sweet Vivian looked so close, and desperate I gave her permission. She is so beautiful to watch when she has an orgasm, bucking and squealing and giggling.\n\nMy turn. I positioned Wanda on the bed and dove between those long long legs. \"Vivian, sit on her face, facing me.\" Wanda was dripping. I lapped, being careful to avoid her clit. I got her very close several times. I looked op at Vivian. \"Vivian Dear, cum for me.\"\n\nWe got cleaned up and straightened our dresses, re-strapped Wanda, who was almost weeping with need, and went to the others for supper.\n\nRebeca explained the new duty roster which included Wanda in the rotation, and who would have her at night.\n\nI chose Sharon to reward. Soft cuddly Sharon. Curvy fluffy Sharon. She lives to please. She's the one I was thinking of when I said we couldn't bare the thought of sharing with guests. Susan and I are always generous with permission when we have Sharon. Seeing, feeling and tasting her orgasms is so beautiful.\n\n*******\n\nA week later I took Wanda. I couldn't resist that magnificent, statuesque body any longer.\n\nWe went to the shower. I soaped her, she soaped me. She was very good at showering. I came on her hand as she made sure my cunt and sphincter were clean.\n\nIn bed I pushed her down onto her back and kissed squeezed and fondled those big full tits. I sat on hr face. Great tongue work. My orgasm was so intense I almost fell off the bed.\n\n\"Remember Darling, no orgasm without permission.\"\n\nI glanced at the bedside clock, then began. I kissed her trimmed bush. Moving down I kissed then licked her puffy pussy lips. I spread her open and kissed some more. I fingered and lapped up her juice. I fingered her ass and kissed her clit. She was in distress, but held on. One long slow lap with my tongue. Her cunt sauce was flowing. Three fingers inside her cunt and a kiss on her clit. She really needed to cum. I backed off for a bit, kissing and licking her long smooth legs. Starting on her pussy again, I had a finger in her rectum and was kissing her snatch when, at the twenty two minute mark, she came. Thrashing and gasping.\n\n\"Sorry. Sorry Lady Parkwood, Sorry, sorry.\"\n\nQuietly I ordered her over the edge of the bed. From my dresser drawer I took the wide soft white leather strap. It would hurt, but not leave a lasting mark.\n\n\"I.\" Smack. \"Did.\" Smack. \"Not.\" Smack. \"Give.\" Smack. \"You.\" Smack. \"Permission.\" Smack, smack, smack.\n\n\"Soo-o-o-ry, Ma-a-am.\" She sniffed and sobbed out. \"I-I'll do-o-o better. Sorry.\"\n\nGently. \"I know you will Sweetie, now into bed. It's time to sleep.\" I spooned up to my beautiful Amazon and held her as she cried herself to sleep.\n\n*******\n\nAfter another two weeks Wanda was allowed to go without her chastity belt.\n\nRebeca had to beat her once when she caught her fingering herself, luckily before she reached 'takeoff.' She had to wear fur thumb less mittens for a week.\n\nThree weeks after that she had what you could call her final exam.\n\nWanda's 'pleasure slave' wardrobe had arrived, and she wore her little black dress, in velvet, and four inch stilettos. Her long brown hair shone. Her lips and nails were an attractive maroon. She stood straight, shoulders back, chin up, but eyes down. Perfect courtesan makeup.\n\nRebeca wore a red and pink printed wrap around off the shoulder number that defied gravity and cute white sandals.\n\nI wore an ankle length powder blue skirt that swirled so fluidly as I walked, three inch silver open toe heels, no bra and my soft cuddly turquoise puff sleeve angora sweater. I felt so sexy, dressed for my ladies.\n\nMy ladies! They all looked so sexy in their pastel yellow white polka dot sun dresses and tan sandals. Rebeca even let them wear jewelry, letting them choose necklaces, earrings and bracelets. Six of the prettiest maids you could imagine.\n\nWanda sat between Rebeca and I at dinner. We did a lot of touching and feeling, keeping her on edge. Her training held.\n\nWhen we headed towards our rooms I kissed each of my pretty loves and whispered in each of their ears, \"When the clock chimes eleven, you may cum.\"\n\nRebeca and I escorted Wanda to the blue suite. They kissed and petted on the couch as I ran the bubble bath and lit the candles. We all undressed and slipped into the warm scented bath.\n\nAt one point Rebeca had her arms around Wanda from behind, molesting her proud hooters as I fingered Wanda's cunt and sphincter. She gasped, but her training held. Good girl.\n\nWe took turns brushing each other's hair, the third wheel eating the one being brushed. Becky and I both came. Wanda behaved wonderfully.\n\nIn bed I was kissing Wanda as Becky was enjoying her treat.\n\n\"May I cum, Please, Mistress?\"\n\n\"No Dear. You must never beg.\"\n\n\"Whimper.\"\n\nRebeca moved up and sat on Wanda's face as I retrieved my strap on. Wanda was so wet, no need for lube, it slipped right in. Rebeca rolled aside to watch. With cock and fingers I rode Wanda. 'Yes Dear, you definitely have earned this,' I thought.\n\n\"Wanda, cum for me.\"\n\nWow! All three of us nearly fell off the bed. She bucked and screamed. She laughed and shook. She rolled me over and rode me like a rodeo star, whooping and bouncing and jiggling. She rolled off my purple cock and pinned Rebeca down and kissed her like a starving sailor.\n\nWe now have the best pleasure slave in the nation, possibly the world!", "tags": ["lesbian love", "pussy eating", "strap ons", "chastity", "lesbian", "lesbian sex", "denial"], "address": "https://literotica.com/s/the-replacement-4"}, "8": {"title": "Adventures in Chastity Ch. 02", "category": "BDSM", "author": "Gabriela_Morglove", "short_description": "Anne surprises Ned with a friend.", "story": "", "tags": ["chastity", "femdom", "male slave", "cfnm", "ffm", "bdsm"], "address": "https://literotica.com/s/adventures-in-chastity-ch-02"}, "9": {"title": "Adventures in Chastity Ch. 03", "category": "BDSM", "author": "Gabriela_Morglove", "short_description": "Ned's longtime fantasy takes an unexpected turn.", "story": "", "tags": ["bdsm", "cfnm", "chastity", "femdom", "ffm", "threesome", "group", "group sex"], "address": "https://literotica.com/s/adventures-in-chastity-ch-03"}, "10": {"title": "WVC Ch. 23: The Group Massage", "category": "Exhibitionist & Voyeur", "author": "gupiao", "short_description": "He gives the girls another chance to practice.", "story": "Special thanks to blondebella91 for editing and suggestions. \n\n********** \n\nWaking up on Sunday, April 12th, I found this e-mail from the Art Department. \n\n\"You are scheduled to assist in a private group massage tutorial. On Tuesday at 7 PM, Erika will meet you in the lounge of your dorm and take you to a room in Allegretti Hall. Wear loose clothes and make certain to you give yourself a thorough enema. Continue taking the diamond shaped blue pills and your supplements until then. Eat a light dinner, and remember, you are not allowed to ejaculate.\" \n\nI was so tired from the previous night's training (WVC Ch.22 Training #2), that I had to take a long nap in the afternoon. And when I awoke for the second time on Sunday, my cock was like iron. It stayed that way most of the next three days, which passed excruciatingly slowly. In an effort to conceal my near constant arousal, I tried wearing a tight jock strap under a pair of oversized shorts. That seemed to work. I didn't attract as much attention, at least until I had to reach between my legs to adjust the swollen lump. \n\nWhile I was waiting for Erika downstairs on Tuesday, it happened again. I'd never spent much time in the entrance area, and was a bit overwhelmed with all the bare skin on display as the coeds came and went in the warm evening. All the bare legs and bouncing breasts had the expected reaction, and as I sat on a couch facing the front door, I squirmed as the growing bulge in my crotch became unbearable. \n\nWaiting until there seemed to be a lull in the traffic flow, I quickly reached between my thighs to adjust my expanding cock. Just as I eased my thickened pole to the side, someone appeared right behind me, standing at my shoulder. Looking up, I saw the cute blonde that Erika had persuaded to taste my dripping hard-on in the bushes just a few days earlier. A smirk played across her lips as she watched me yank my hand out from between my legs. \n\n\"Hi, Bill. Looks like you need some help.\" \n\n\"Uh, no. Thank you.\" \n\nStill smiling at me from behind her glasses, her bright brown eyes darted from my face down to my distended pouch of my shorts and back again. As I gazed up at her, I realized that she was wearing a thinner blouse than the other day, and her pert nipples were pulsing eagerly against the thin white cotton. \n\n\"It's Jennifer, right?\" \n\nShe nodded as she caught me staring at her chest, arching her back ever so slightly to emphasize the thrust of her smallish mounds. \n\n\"Uh huh. Are you sure you don't want to go upstairs with me? Your cock looks like it could use some attention.\" \n\nThe short blonde wet her pink lips to make certain I knew exactly what kind of attention she would give me. I swallowed before I replied. \n\n\"Although I'm really tempted, I can't. I'm waiting for someone.\" \n\nA cloud passed over her eyes as she nodded. \n\n\"That brunette from Sigma Epsilon, isn't it? The one that's not your girlfriend?\" \n\nAs I started to answer, Erika walked through the front door, wearing tight white shorts that were snug in her crotch, outlining the plump lips of her pussy and left the long expanse of her tanned legs bare. On top, she wore a loose striped blouse, which only hinted at the full curves beneath. She looked good enough to eat, again. Smiling weakly, I stood up and nodded toward her. \n\n\"Yes, you're right, and here she is.\" \n\nThe little blonde looked like she wanted to reach out and grab my crotch, but instead, she just gazed down below my waist as my trainer approached. \n\n\"My offer still stands, whenever you're ready.\" \n\n\"Ready for what?\" \n\nErika overheard the last phrase, and she had an edge in her voice. Clearing my throat, I spoke up. \n\n\"You remember Jennifer, don't you? She offered to, ah -\" \n\nI quickly looked around to see that no one was close enough to eavesdrop. I lowered my voice anyway. \n\n\"She was the girl you had taste me, and uh, -. She offered to help me relieve my sexual tension, whenever I needed it.\" \n\nSomething flickered in Erika's deep blue eyes that I didn't recognize as she sized up the shorter girl. Suddenly, it dawned on me that she might be just a bit protective of me. \n\n\"I remember. How good to see you gain.\" \n\nBut she didn't have a smile on her pretty face as she took my arm, pressing her firm globes against me. Leading me toward the door, she nodded cordially at the cute blonde. \n\n\"Have a good night.\" \n\nAs we walked out the front door, my trainer clung to my arm, silently descending the steps and heading across the campus, the last rays of the setting sun bathing the lush greenery in a warm glow. As we continued, I cleared my throat. \n\n\"What happened after I left on Saturday?\" \n\n\"Bill, you know I can't tell you that. Why?\" \n\nI shrugged, enjoying the feeling of full mounds jostle my arm as walked. \n\n\"I just had hoped that we could spend some time together, you know, afterwards.\" \n\nErika smiled as we turned toward Allegretti Hall. \n\n\"How sweet. But here we are now, spending time together.\" \n\nPausing at the bottom of the stairs, she turned to me. \n\n\"Don't ask me for something I can't give.\" \n\nStill grasping my arm, we climbed the outdoor stairs together. When I disentangled from her to hold the door open, she giggled. \n\n\"How cavalier of you.\" \n\nInside, she led the way and I followed behind her, admiring the way her muscular buttocks filled out the tight shorts, revolving atop her tanned thighs. Climbing the interior stairs was a particular treat. The lump in my pants stayed thick and full. \n\nStopping in the second floor, Erika knocked on the door and a familiar face opened it. Stephanie, the muscular dancer with the well-articulated feet stood in the doorway. I hadn't seen her since last Tuesday (WVC Ch.20: The Dance Rehearsal), and we weren't slated to meet again until next week sometime. Or was it tomorrow? I kept was getting lost in my shifting schedule. \n\nBarefoot and wearing a white robe, she grinned and threw the door open wide. With her dark brown hair pulled loosely back into a pony tail, she was clearly ready for whatever the Club had planned. \n\n\"Hi Steph, is everyone here?\" \n\n\"Yep. Come on in, Erika.\" \n\nThey knew each other? That was a surprise I didn't have time to consider as we entered. Again, my trainer led the way, letting me trail after her. As the brunette hostess stepped aside to let us in, I couldn't help but notice the sharp buttons of her erect nipples poking against the white cotton, the dark brown flesh faintly visible through the thin material. Dropping her gaze down below my waist, she asked my trainer. \n\n\"Is he ready?' \n\n\"Oh yeah. He's always ready.\" \n\nStepping all the way inside, I blushed furiously as Stephanie closed the door behind me. It took me a moment for my eyes to get accustomed to the dim interior since the electric lights were off, replaced by dozens of candles lining the room, giving a magical, flickering glow to the small space, but also raising the temperature. \n\nUnlike my dorm room, this one was a double, with two small bedrooms linked together with slightly larger common area. In the wavering shadows, I saw that the other three girls were also barefoot and wearing robes. Nervously, they stood off to one side as two massage tables had been set up side-by-side so that they dominated the room. Erika appeared puzzled by that arrangement as Stephanie led me over to the shy trio, the solidly built blonde in front held out her hand. \n\n\"Bill, you remember Amber? From the massage class?\" \n\nOf course. That's why they looked familiar. They were all from the massage class. As I shook hands with Amber, her long gorgeous hair pulled back into a ponytail, she smiled and dropped her pale blue eyes ever so briefly to the bulge in my pants. I mumbled a greeting as she stepped back, her full breasts swaying loosely beneath the lightweight cotton, the brownish imprint of her rigid nipples was clearly visible through the cloth. Next up was a willowy redhead. \n\n\"This is Sheila.\" \n\nThe nervous coed never met my gaze, keeping her eyes lowered as she kept peeking below my waist. Her handshake was short and tentative. I got the impression that she didn't really want to be here. \n\n\"And finally, Danielle.\" \n\nThe tall black girl with the big eyes and high rounded breasts I most certainly did recall. Glancing down at her full globes, I could see that the large oval nipples were darkly erect through the thin material. Uncomfortably full, my cock throbbed at the sight of her impressive chest. I resisted a strong impulse to cover what must be my obvious arousal when my trainer rested her hand on my shoulders. \n\n\"Stephanie has gathered the students that need more practice working with the male body. The single class that they had with you wasn't enough sufficient experience, and they've all volunteered for this extra credit session.\" \n\nTurning to the muscular dancer, she paused. \n\n\"But I don't understand why there are two tables set up?\" \n\nStephanie's smile grew broader. \n\n\"I figured that you would be bored watching us give Bill a rubdown, so I thought you might like a massage at the same time.\" \n\n\"Oh. Okay.\" \n\n\"Let's get him started and then I'll work on you.\" \n\nAs the short brunette turned to me, her luminous eyes twinkling, Erika made herself comfortable on the single couch. \n\n\"Bill, if you'll strip off all your clothes and climb up onto the nearest table, we'll get started.\" \n\nVery aware that all eyes were on me, I kicked off my shoes, pulled my t-shirt overhead, and unbuckled my belt. I let my baggy shorts fall to the floor, then hooked my thumbs inside the elastic waistband and bent over, drawing the jock strap down my legs. When I straightened up and stepped out of them, my thickened rod swung heavily before me. One of the girls gasped as they stared down at my exposed crotch, examining the way it extended out. Since I wasn't wearing any ring or genital strap, my cock stayed low, pointing down toward the floor. \n\nStephanie adjusted the table, spreading the lower portion into a Y shape. \n\n\"Up on the table.\" \n\nI nodded and edged between the open legs of the table, climbing up onto the top and easing my torso down until my heavy pole was nestled in the junction, hanging down toward the floor below. As I rested my head on the raised cushion, I heard the rustle of clothes and out of the corner of my eye, I caught a glimpse of robes being discarded and tossed aside. That was followed by the squishing sound of lotion being rubbed between pairs of hands. \n\nClosing my eyes, I sighed as the first set of slick fingers began to massage my left leg, starting at my ankle and moving up. Quickly, more joined them until all four girls were working on both arms as well as my other leg. In silence, they deepened their massage, slowly lulling my senses. Although I tried, I couldn't tell the girls apart. Everyone had seemed to overcome whatever reluctance they might have had with me, at least on my limbs. \n\nTime drifted as they began to move closer to the center of my body, massaging higher up my calves and farther up my arms until two of them were working on my shoulders. I melted into the table as they continued, moving down my back as the other pair slid up my thighs, keeping my legs well apart so they had access to the inner portion. Totally at ease, I felt the fingers rubbing my back slide lower until one pair began to work on my ass cheeks, starting gently and then with increasing intensity until she was really mauling me, pulling them far apart and mashing them back together. \n\nDown lower, the other four hands stroked high on my inner thighs, brushing my balls as they continued their massage. I sensed no hesitation from anyone. The previous aversion I thought I had noticed seemed to be entirely gone. Lightly slapping my butt, Stephanie gave me instructions. \n\n\"Time to do your front.\" \n\nTaking a deep breath, I rolled onto my back, my semi-hard cock slapping against my left thigh with a loud smack. Although I was tempted to peek at the girls surrounding me, I kept my eyes tightly shut. They resumed the massage, maintaining the same pattern, starting at my hands and feet, and then working toward the center of my body, converging toward my rapidly swelling pole. As they continued to draw closer, I could feel the blood flowing into my cock, causing it to bob up and down, bouncing off my lower abdomen. \n\nWorking on my left side, Stephanie spoke again. \n\n\"Girls, the first part of this massage was designed to relax the male subject. But judging by the size and intensity of his stiff dick, I'd say we weren't very successful.\" \n\nThe girls giggled, since my now fully erect cock was anything but relaxed. They fell silent again, and I could feel their eyes on my pulsing hard-on as they worked, watching as each beat of my pounding heart sent my erection jerking higher up into the air, quivering with eager excitement. \n\n\"That is so hot!\" \n\n\"What is, Danielle?\" \n\n\"Seeing his penis, his cock get so excited that it can't even lie still.\" \n\n\"Yes, he is very aroused. This big dick of his always seems to be eager to play.\" \n\nThe girls' energetic massage had softened until their touch was more like a caress. And by now, all four pairs of hands were very close to my twitching hard-on, the ones on my lower abdomen working around the base, forearms grazing the swollen bulb as they stroked my skin. The ones between my thighs reached up under me, easing my thighs farther apart, sliding between my buttocks, tickling my skin as they brushed by my balls. \n\n\"Since we've not succeeded in calming him down, we'll proceed to the next phase, where we give him an energizing, stimulating massage, -- although I'm not sure how much more stimulated he can become. Who's ready to try the hand over hand technique Professor Grigsby demonstrated?\" \n\nSuddenly, everyone turned shy. No one spoke. \n\n\"Okay, I'll go first and show you again.\" \n\nThe tiny brunette hopped up on the table and straddled my torso, pressing her hot crotch against my stomach as she faced my feet. Not being able to resist I peeked. No bra strap circled her chiseled back, and only the thinnest string around her slim waist showed she wore anything at all. Her muscular ass cheeks looked great, split by the white lace that disappeared in the valley between them. \n\n\"As you recall, women are aroused differently than men. Actually, a man is much easier. Being outside of his body, his penis, his dick functions like a convenient handle.\" \n\nThe other girls were partly obscured by her lean body, so I only got a quick glimpse of them as Stephanie wrapped both hands around the base of my shaft. But that was enough to determine that not a single one was wearing a top. The stocky blonde to my right was the closest. As she leaned nearer to watch the small brunette fondle my hard-on, her full breasts swayed heavily, topped with large pale brown nipples, puckered and erect. \n\n\"The most common way to stimulate a man is simply to use your hands like this.\" \n\nI caught my breath as she began to pump my slick shaft up and down, pressing down on the skin equally as hard as she pulled my cock upwards. \n\n\"A more advanced technique is the hand over hand motion, pulling the man's dick away from his body with each stroke.\" \n\nStephanie demonstrated for a few moments, sliding her slippery hands up my rigid pole over and over in a flowing, wavelike action. Obviously she had some experience. \n\n\"The reverse is also effective, pushing down on his dick, stretching the skin so that the swollen crown is isolated.\" \n\nAs she used my engorged rod to show the others, my breathing grew ragged, a sign of an impending orgasm. Still, she went on. \n\n\"Another excellent technique is a twirling motion like this.\" \n\nI gasped as she expertly twisted her fists around my shaft, sending me perilously close to the end of a tremendous climax. Suddenly, I noticed Erika was at my side, lightly resting her hand on the brunette's arm, cautioning the smaller girl. \n\n\"Stephanie, I think it's time for someone else to play with his penis.\" \n\nAfter a momentary hesitation, the tiny brunette nodded, abandoning my twitching hard-on and hopping off the table. \n\n\"Who's next?\" \n\nNo one moved. The three girls just stared at my raging erection. The bright pink nipples of pretty redhead were pulsing and erect, excited buttons that topped her shallow breasts. Her big blue eyes were focused directly between my thighs. But the slim black girl had a spectacular body, high rounded breasts crowned with jet-black nipples, large crinkled ovals that covered the top third of her full mounds. My cock jerked upward as I admired her incredible body. \n\n\"I'll go.\" \n\nTossing her long pony tail back over her shoulder, the busty blonde moved into the V created by the spread of my legs. Her heavy breasts swayed as she moved, light brown nipples jutting out from her globes, pale blue eyes focused on my trembling hard-on. \n\n\"He's really big. I've seen lots of pictures of dicks, and I've played with several, but this is the biggest one I've ever seen.\" \n\nAfter smoothing a generous amount of lotion on her hands, she deliberately wrapped both of them around the base of my thickened shaft, beginning to post up and down the full length, wetting her lips as she worked. The other two girls crowded closer, studying the way Amber stroked me. \n\n\"Yes he is big, more than eight inches long. Almost nine.\" \n\nStanding protectively near my head, my trainer answered Amber, making certain that I wasn't going to be pushed over the edge. Satisfied that the blonde's steady but hesitant rhythm wasn't going to threaten my composure, Erika started to unbutton her blouse. Shrugging it off her broad shoulders, she turned to the diminutive brunette and asked. \n\n\"Weren't you going to massage me?\" \n\nA sly smile crossed Stephanie's face as she watched the older girl arch her back to reach around and unhook her bra. Clearly excited, the dancer's brown nipples were rigid at the tip of her pert breasts. She nodded as Erika hunched her shoulders, letting the slender bra straps slide down her arms. \n\n\"Oh yes, I've been looking forward to it.\" \n\nA similar smile flickered across my trainer's face as she stepped out of her shorts, leaving her clad in a tiny pair of the string bikini panties. Pulled tight up into her crotch, the pink lace clung to the rounded curves of her pussy lips. Resting her hands on her hips, her smile broadened into a wide grin. \n\n\"I thought you might.\" \n\nArching her back again, she thrust her magnificent breasts out toward the short brunette, emphasizing the large reddish nipples crinkled with excitement. Although both Stephanie and I had examined the taller brunette as she stripped, none of the other girls were interested. Crowded around me, they were too busy watching Amber play with my rigid cock, gradually growing in confidence as she kept squeezing and pumping. \n\nDanielle in particular was fascinated, going so far as to bend over the engorged bulb. As she examined me, she started to finger her eager nipples, pulling and pinching each between her thumb and forefinger, squeezing them fiercely as she leaned closer. She was so near that I could feel her warm breath wash over the taut skin of my cockhead. \n\n\"Girls, don't neglect the rest of his body. Remember, this is a full body massage.\" \n\nSheepishly, Danielle released her twisting grip as she and Sheila began to rub their hands over me again. Standing on my left, the pretty redhead worked on my upper leg, keeping her blue eyes focused on the upright pole in Amber's grasp. On the other side, the gorgeous black girl began stroking my lower abdomen with one hand while the other massaged down the front of my thigh, both hands coming perilously close to the base of my throbbing hard-on. \n\nErika climbed up onto the other table, facing the opposite direction from me, her hips near my head. As she lay down on her front, Stephanie began coating her hands with more lotion, a smirk on her face. \n\"We usually require our massage subjects to be totally nude.\" \n\nWithout a word, my trainer rose up off the tabletop and stripped off her panties, tossing them onto the couch across the room. Her rounded ass cheeks looked warm and inviting in the flickering light. Maintaining the silence, Stephanie mounted the table and straddled the prone brunette, facing her shoulders. As she began to work her muscles, I heard Erika exhale, giving her body over to the smaller girl. \n\nOut of the corner of my eye, I admired the pointed brown nipples that topped Stephanie's firm breasts, swaying ever so slightly as she massaged Erika. My eyes darted back to pair of large globes of the blonde, swinging heavily just above my parted thighs and crowned with pale nipples that were crinkled and wildly erect. Up and down, up and down, she steadily pumped my slippery shaft. \n\n\"I think it's time for someone else to have a turn on Bill.\" \n\nAstride my trainer, the petite brunette directed the scenario. Reluctantly, the sturdy blonde released me and stepped aside, vacating the spot between my open legs. The other two looked at each other, neither taking the initiative. After a long hesitation, the pale redhead took Amber's place, staring down at my twitching rod as she moved around the table. Holding her breath, she slowly reached out and curled one hand around the pulsing stalk. Timidly, Sheila began to squeeze, almost like she was afraid she'd hurt me. \n\nIn contrast, the tall black girl with the short curly hair grew bolder as she watched her friend carefully fondle me. With the palm of one hand, Danielle massaged my lower abdomen, creeping closer to the base of my shaft while her other stroked along the inside of my thigh, brushing against my balls. Standing to one side, the long-haired blonde looked slightly lost as she idly rubbed my upper stomach. \n\n\"Amber, why don't you help me? I'm sure that those two can handle Bill by themselves.\" \n\nWith one last glance toward my quivering erection, the stocky girl moved between my trainer's spread legs, immediately running her hands high up the inside of her open thighs. I saw Erika shiver as the blonde's fingertips brushed the fleshy lips of her exposed crotch. \n\nUnlike the black girl, who was vigorously stroking my pubic mound as the same time she jostled my balls as she massaged my inner thigh, Sheila was quite tentative. Now that she had my jerking pole in hand, her strokes were light and feathery, almost as if she had never held an erect penis before. Astride Erika, Stephanie encouraged the timid girl. \n\n\"He won't break, Sheila. You can use more force on his dick.\" \n\nShyly, the redhead began to pump me with more resolve, gradually increasing the pace of her rhythm until her strokes were firm and brisk, pushing me closer to the edge of an orgasm. Pausing for a quick moment to wrap both hands around my throbbing shaft, she enthusiastically resumed her now eager jacking of my throbbing erection. \n\n\"Time to turn over.\" \n\nPlayfully, Stephanie slapped my trainer's ass, causing the firm mounds to jiggle ever so slightly as she dismounted the table. Amber remained between her legs as Erika rolled over, unabashedly spreading her shaved pussy for the young blonde. Stephanie winked at me as she climbed back on top of the prone brunette, knowing I was fascinated by the unfolding scene. Sitting astride the lean tanned stomach, facing Erika's head, she palmed the firm breasts that were begging for attention and began massaging them. \n\nWith a sharp catch of her breath, the brunette on her back began to moan softly as the relentless hands rubbed her chest. The whimpers grew louder as Amber started to stroke her inner thighs, brushing the moist lips that were now gaping wide open. Glancing over at her, I could plainly see the drops of nectar glistening on the shiny surface, illuminated in the wavering candlelight. \n\nSuddenly, it dawned on me that if my head were level with Erika's crotch, then her head would be even with mine as well. Raising my head, I could see that she had turned toward me so she could watch the shy redhead play with my stiff cock. My breathing grew irregular as I approached an enormous explosion. Fortunately, she was paying attention, even if her voice was a bit shaky. \n\n\"I think, that's enough. For now. We don't want him to uh, ejaculate.\" \n\nReluctantly, Sheila let me go, abandoning my quivering erection and leaving it to wave forlornly in the air. Danielle wasted no time. \n\n\"It's my turn, right?\" \n\nWithout waiting for an answer, the black girl climbed up onto the table and straddled my torso, facing my feet and flashing me a tiny pair of white bikini panties in the process. Pulled tightly between her thighs, they revealed the outline of her fleshy pussy lips clearly visible through damp lace. As she slowly lowered herself onto my torso, I admired the rounded ass cheeks outlined by the white straps of her panties. The view was exquisite. \n\nGrinding her hot crotch against the skin of my stomach, she turned to Erika and Stephanie, seeking guidance. \n\n\"Do I need to wait him to calm down? Or can I play with it now?\" \n\nStephanie grinned as she continued to massage the brunette on the table. \n\n\"Play with what, Danielle?\" \n\nGlancing down at my trembling hard-on, she paused for a moment before she looked back up and replied. \n\n\"With this white boy's dick. I've seen some big ones on the Internet, and most really over-sized ones have been carried by black brothers. But this one --\" \n\nHer eyes drifted back down to where my stiff pole was bobbing up and down in front of her as she coated her hands with the lubricating cream. \n\n\"This dick, if it's not the biggest --\" \n\nAs she spoke, I could feel fingertips lightly stroking the inside of my parted thighs. From the feathery touch and the location between my legs, I knew it had to be Sheila. The moans coming from deep in Erika's throat grew louder and more urgent. In response, Stephanie picked up her pace, now openly sliding her fingers into my trainer's pussy as Danielle continued. \n\n\"But what I like the most about it is the head, round and solid. It's like a fat, shiny plum, deep purple and heavily grooved, sitting on top of a thick log.\" \n\nFinally, she closed both hands around the base of my stalk, squeezing gently but firmly, like she was testing how much pressure I could take. I exhaled, not realizing that I'd been holding my breath while I waited for her to touch me, touch my cock. \n\nDeliberately, she started to post up and down, tentatively at first, but then with increasing confidence and assurance. Completely absorbed in her task of jacking me off, she didn't even look up when Erika reached a violent orgasm, thrashing about on the table next to us, nearly throwing Stephanie to the floor. \n\n\"Uhhhh! Uhhhhh!\" \n\nAs the waves of passion crested and my trainer drifted back down from her high, Danielle grew bolder. Her fists pumped me enthusiastically, and I began to respond, my hips rising up off the table to meet her strokes, thrusting my slick rod deeper into her grasp. My breaths came quicker, shorter, sharp gasps of air sucked into my lungs. \n\n\"Look! His cockhole has opened up!\" \n\nSheila exclaimed as I started to pant, shoving my swollen cock farther into the black girl's double fisted grip with abandon, desperately seeking a release for my cum filled balls. \n\n\"And he's started to leak.\" \n\n\"Yeah. Look how much juice is coming out!\" \n\nAs the black girl halted her rhythmic strokes to hold me still, I felt a timid finger scoop a drop of the fluid from the lip of my oozing bulb. It must have been the redhead since I heard her ask, \"Can I taste it?\" \n\nStill straddling my gasping trainer, Stephanie giggled as she replied and began massaging Erika again. \n\n\"Sure, although I suspect that it's much tastier when taken directly from the source.\" \n\nWorking slower this time, Danielle resumed her double fisted posting, squeezing my drooling shaft firmly as she pressed down against my bloated balls. Sounding puzzled, Sheila repeated the petite brunette's words. \n\n\"From the source?\" \n\n\"Girl, you are so dense. Sometimes I think you're putting me on.\" \n\nHolding my engorged knob high in the air, Danielle leaned over my crotch. I gasped as I felt her wet tongue slide across the taut surface of my cockhead and lap at the gaping slit. Everyone was silent as she bathed the rounded bulb, pausing to lick up the liquid as it flowed from the open hole. Sitting back on her heels, her voice had a note of triumph as she spoke. \n\n\"That's taking his juice directly from the source.\" \n\n\"Oh.\" \n\nWith a long single stroke down and then back up, she milked another oozing drop out of my throbbing stalk. I could feel it perched precariously on the lip of my cockslit as she asked. \n\n\"Sheila, would you like a taste?\" \n\nThe redhead didn't answer right away, and only sound in the room was the soft squishes coming from between my trainer's thighs. Glancing over at the other table, I saw that it was Amber who was sliding her fingers in and out of Erika's yielding pussy, but her pale blue eyes were focused on what Danielle was doing to my stiff pole. \n\nSince the black girl's slim back obscured my vision, I couldn't see what Sheila was doing. But when I felt her warm breath wash over the moist skin of my bulb, I knew where she was headed. And when the soft tip of her tongue slid across the end of my trembling knob, licking up the solitary drop, I shivered in Danielle's grasp. Very carefully, she milked another discharge out of me, running her fists back down to the base of my shaft and squeezing the fluid back up to my slit. \n\nWarming to her task, Sheila slipped her lips over the rounded surface and started to suck, drawing the clear liquid out of my open hole. Panting heavily, I felt right on the edge. It wouldn't take much for me to pass the point of no return. Nursing gently on my quivering cockhead, the redhead reached between my spread thighs and cradled my balls, weighing them in the palm of her hand. Pulling her head back slightly, she spoke around the wet knob. \n\n\"His balls feel really full.\" \n\nNo one responded. Erika was enjoying the way the stocky blonde was exploring her slit, soft mewing sounds coming from deep in her throat as Amber started to increase her rhythm. Perched on top, the Stephanie was massaging her breasts, paying particular attention to her reddened nipples, pinching and tugging on them as my trainer approached another orgasm. \n\nAlthough her hips were bouncing off the table, encouraging the blonde to work deeper into her spasming crotch, Erika wasn't nearly as loud this time as the climax crested over her. \n\n\"Uhh. Uhh. Uhhhhhhh.\" \n\nAs my trainer shuddered and heaved a huge sigh, Danielle turned back to me and resumed her slow steady strokes up and down my dripping hard-on. Squirming under her, I matched her deliberate pace and thrust upward as best I could, shoving my cock against her two handed grip. I felt another hand, soft and gentle, curl around the upper section of my shaft, just below the ridge of my engorged bulb. \n\nIt had to be Sheila. As the slim black girl gradually picked up the pace on the lower portion of my stalk, l felt moist lips slip back over the rounded end, gliding farther this time, stretching wide to accommodate me until her warm mouth enveloping my entire bulb, curling around the high ridge that circled it. She seemed a bit more eager this time, sucking the tip, drawing out another mouthful of my oozing lubricating fluid. \n\nI started to pant, squeezing my butt as I lifted my hips up off the table top, trying to find release for the roiling in my balls. Reaching across the space that separated the two tables, Erika gently rested her hand on the black girl's lean thigh. \n\n\"I think that's enough, Danielle. Sheila?\" \n\nFor a moment, I thought the two girls at my crotch were going to ignore my trainer and bring me to a long awaited climax, but it was not to be. The willowy coed straddling my torso released her double fisted grip and slid off the table, leaving my rigid cock jutting up from between my open thighs. However, Sheila kept slurping, nursing on my engorged cockhead as she began to squeeze and pump. I watched her red hair cover her pretty face as she bobbed up and down. \n\nOn the other table, Erika sat up and sighed again, her amazing breasts barely swaying as she moved. Leaning over, she tapped the younger girl on the shoulder. \n\n\"We don't want him to have an accident, do we?\" \n\nWith a slightly dazed look in her blue eyes, Sheila raised her head, one hand still wrapped possessively around the base of my throbbing stalk, holding me upright. Licking her lips, she looked over at my trainer. \n\n\"That's enough for tonight. I'm sure you'll have another chance to suck him dry.\" \n\nFlushing at Erika's words, she suddenly realized how hard she was gripping me. Abruptly, she let go, and my raging erection slapped emphatically against my lower stomach. Bounding back into the air, it finally came to a jerking, quivering stop, desperate for release. \n\nOn wobbly legs, Erika stood up, one hand on the edge of the massage table to steady herself, the inside of her silky thighs glistening with moisture. As the slim redhead reluctantly backed up, I slid off the table and came to my feet in the wide V right in front of her, my stiff pole swinging freely between my thighs. Her eyes wide, she stared down at it as I edged my way around her. There was a hungry look in her gaze, one that I hadn't seen in her before. \n\nAs my trainer picked up her clothes and started to get dressed, Amber joined her pale skinned classmate examining my jutting cock, both girls watching closely as it trembled in the space between us, dripping onto the floor. Her voice was hoarse as she asked. \n\n\"When he cums, does he shoot a lot?\" \n\nNot bothering to replace her bra, Erika answered as she buttoned the striped blouse. \n\n\"Not yet, but we're working on it.\" \n\nThat brought the girls up short. Danielle looked puzzled. \n\n\"What does that mean? 'Working on it'?\" \n\nStepping into her shorts, the brunette with the thick hair continued, a twinkle in her green eyes. \n\n\"He's still in training. He's not a finished product yet.\" \n\nHer words may have confused them more than ever. Retrieving my shorts from the floor, Erika tossed them to me, glancing down at my aching hard-on as it bobbed eagerly. \n\n\"Time to put that away, Bill.\" \n\nPainfully, I was able to squeeze into my tight shorts, carefully zipping the front to avoid nipping my sensitive skin with the metal teeth. As I picked up my t-shirt and pulled it over my head, Erika gave each of the girls a big hug, lingering particularly long in arms of our hostess. \n\n\"Thank you, girls. This has been a most um, -- fulfilling evening.\" \n\nDisentangling herself from Stephanie, my trainer made her way toward the door, and I meekly followed. Without bothering to throw on a robe to cover her trim body, the short brunette accompanied us, her large brown nipples still pulsing and erect. As I started to bid her goodnight, she reached down to cup the bulge in my pants. I gasped at her boldness. \n\n\"Someday, I'll get to finish you.\" \n\nSmiling, she gave me a firm squeeze. \n\n\"But for now, we'll just have to restrain ourselves.\" \n\nMoving closer, she slowly shimmied her shoulders, brushing the stiff points of her nipples back and forth across my chest as she rubbed up and down the length of my hard-on. \n\n\"See you tomorrow.\" \n\nAnd then she stepped back and grinned, pushing me backwards into the hallway and closing the door in my face. Erika looked puzzled as we turned to go back down the stairs. \n\n\"Tomorrow?\" \n\nI nodded. \n\n\"I think we have a dance rehearsal.\" \n\nAs we exited the building, we fell silent. Walking across the darkened campus was awkward with the swollen bulge in my shorts, but at least it didn't attract as much attention as it might have with more light. As we approached my dorm, I began to slow down. I had a question to ask her, and I was thinking about how to phrase it. \n\nNoticing that I had slowed, my trainer stopped completely and turned to face me. We were close enough to the lights on the porch that I could admire the full curves beneath her blouse swaying loosely as she moved. \n\n\"Yes?\" \n\nWhen I hesitated, she dropped her gaze below my waist. \n\n\"Are you still hard?\" \n\nNot waiting for my reply, she reached down and curled her hand around the middle of my bloated stalk, squeezing as I caught my breath. \n\n\"I can't believe that you're still erect.\" \n\nWithout raising her eyes, she started stroking me through the tight denim. \n\n\"Did you want to ask me something?\" \n\nStill in the shadows near the front of my dorm, I glanced around to make certain no one was nearby. She pulled me closer to get a better grip. \n\n\"Umm, yeah. Once I'm a full-fledged member of the Club, will I get to cum like you did tonight? Or will have restrictions on when I ejaculate?\" \n\n\"Sometimes. Even now, there are scenarios where I'm not permitted to cum.\" \n\n\"Was tonight one of them?\" \n\nNot missing a beat, she grinned up at me. \n\n\"Are you trying to get me in trouble?\" \n\nHer steady rubbing up and down the front of my pants had pushed me to the edge of a sorely needed climax. I began to pump my hips against her rhythmic strokes. \n\n\"Tonight was all improvised. I just went with the flow.\" \n\nAbruptly, she yanked her hand away, leaving me to hump the air between us. Erika watched for a moment, and then turned to go. \n\n\"You're cute when you're frustrated.\" \n\nAs I took a step toward the dorm entrance, she stopped me, a twinkle in her green eyes. \n\n\"Oh, and if that Jennifer girl knocks on your door tonight, don't let her in.\" \n\nNodding, I jammed my fists in my pockets and trudged up the steps, half expecting to find Jennifer lounging in the hallway. But she wasn't, at least not that night.", "tags": ["femdom", "male exhibitionist", "ffm", "college", "coed", "massage", "orgasm denial", "handjob", "cfnm", "male submissive"], "address": "https://literotica.com/s/wvc-ch-23-the-group-massage"}, "11": {"title": "WVC Ch. 27: The Private Session", "category": "Exhibitionist & Voyeur", "author": "gupiao", "short_description": "With help, he poses for the Gang of Three.", "story": "Many thanks to 12yknot for his editing and proofreading help. \n\n********* \n\nWhen the sunlight came streaming through my dorm room window, I finally woke up. According to the clock by my bed, it was 12:30 in the afternoon, Saturday April 25. Totally exhausted from my third training session the night before (WVC Ch.26: Training #3), I'd fallen asleep on top of the covers without a stitch of clothes on, curled up on my side. \n\nRolling off the bed, I padded to the bathroom with my heavy cock swinging loosely between my thighs and realized that my muscles felt unusually stiff. As I stood over the toilet bowl, I saw the reddened stripes on my cock. Three distinct welts decorated it, one lay across the thickened middle of my shaft while the other two adorned the head. The one at the very tip I remembered well. It was the result of the last blow Mistress Shannon had given me. \n\nAfter I emptied my bladder, I checked my back and shoulders in the mirror over the sink. The damage was bad. A series of swollen ridges spread across my upper back, mostly perpendicular to my shoulders while my backside was the worst of all. Like fine latticework, the welts covered nearly every inch of my butt. The vertical strokes must have come from Mistress Carolyn when I was between her thighs, and the nasty looking ones that were horizontal could only have come from the other mistress, the leather clad brunette. \n\nThere was nothing to eat in the room and I was getting hungry, so I decided to make a run to the Student Center to stock up on supplies. Then I could hide out for the rest of weekend and heal. I'd just finished washing my hands and face when there was a knock at my door. \n\nNot expecting any visitors, I didn't know where my robe was so I grabbed a towel on my way out of the bathroom. As I wrapped it around my waist, I peered through the tiny peep hole in the door to see who it was. \n\nThe shapely black girl with the dreadlocks from across the hall was whispering excitedly with her two companions. One was Jennifer, the cute blonde with glasses who'd introduced us, and the other was a slim black girl with close cropped hair who I'd never seen before. Beneath the small towel, my cock twitched as I remembered how enthusiastic Jennifer had been about sucking my cock. \n\nThe knock came again, more insistently this time. And then I remembered her name -Chandra. \n\nI hesitated, recalling Erika's warning the last time these two were in my dorm room. And I really didn't want a repeat of last night. Giggling and whispering voices came through the door as they knocked a third time. I held my breath, and it suddenly occurred to me that if I didn't answer, they might just go away. More whispering, and then it went quiet. \n\nGlancing through the peep hole, I saw they had gone. Turning to get dressed, I had a twinge of regret. They probably just wanted a homework assignment, or something else just as innocuous. I opted for a pair of loose shorts so that the fabric wouldn't dig into the sensitive skin on my backside. I didn't need more irritation, and for that same reason, I pulled on a bright blue Hawaiian shirt, one that was loose across my flaming back. By the time I stepped into my sandals and locked the door behind me, I'd forgotten all about the girls that had been knocking there earlier. \n\n\"Hey Bill!\" \n\nI was halfway down the hall when Chandra called out. Apprehensively, I stopped before I reached the stairwell and turned to watch her approach. With her dreadlocks swinging and her full chest swaying beneath the yellow tailored blouse, she trotted down the narrow passage, smiling broadly. \n\n\"I was looking for you earlier.\" \n\n\"Oh.\" \n\n\"Yeah, I knocked on your door.\" \n\n\"I must have been in the shower.\" \n\nGlancing up at my head, she smiled. I realized that my hair was dry, and probably didn't lend any support to my white lie. But she kept smiling anyway. \n\n\"I have a good friend of mine who wants to meet you.\" \n\n\"Me? She wants to meet me?\" \n\nHer dreadlocks bounced as she nodded. \n\n\"I've told her all about you, and she can't wait to meet you.\" \n\n\"But why does she meet me?\" \n\nA door opened down the hall and a willowy blonde emerged, pausing long enough to lock her door before proceeding toward us. With her black eyes sparkling, Chandra took my arm and turned me around. Leading me down the stairs, she leaned against me, pressing one full breast into my skin as she whispered. \n\n\"She can't believe a white boy could have as big a dick as yours.\" \n\nInside my loose pants, my cock twitched. As we walked down the first set of stairs, it dawned on me that wearing a pair of baggy shorts without any underwear might not have been such a good idea. I could feel the air circulating around my head and shaft of my cock as the pant leg billowed around my thighs. If I developed a full erection, it was going to be impossible to conceal. \n\nWhen we reached the next landing, Chandra swung me around and pressed her shapely body into mine, pinning my back against the wall. Still gripping my arm, she straddled my leg and shimmied her full breasts lazily against my chest. Her voice was a whisper as her black eyes sparkled. \n\n\"I went into great detail about your dick, but she doesn't believe me. She insists on seeing it for herself.\" \n\nI could feel the blood starting to flow below my waist. She must have felt it too. Locating my thickening log as it hung down left pant leg, she rubbed her thigh against me, causing my slowly swelling cock to slide back and forth beneath the loose cotton. If it kept growing, I wasn't sure that the pant leg would be long enough to hide it. \n\n\"So what are you doing this afternoon?\" \n\nGently extricating myself, I glanced downstairs to see a pair of coeds coming up, chattering away. I took Chandra's arm and positioned her to block the girl's view of my bloated crotch. She had amused grin on her pretty face as she watched me. After they passed us, she took my arm again and led me down to the main floor below, repeating. \n\n\"What about this afternoon?\" \n\n\"I'm kind of behind on my studies. I was planning to catch up.\" \n\n\"You going to be studying in your dorm room then? You might need a little break.\" \n\nThe wicked gleam in her eyes left no doubt as to what kind of break she meant. As we finally reached the ground floor, I untangled my arm from hers and took a tentative step toward the front door. \n\n\"Maybe. I don't know.\" \n\nShe pouted as I took another step away. Crossing her arms lifted her substantial breasts higher. \n\n\"I'll see you later, Chandra.\" \n\n\"I hope so.\" \n\nAnd I beat a hasty retreat, out the double doors and down the wide steps, trying to minimize the sway of my heavy cock inside my pants. I figured the only way I could control an unwanted erection was to stuff my fists into the front pockets, ready to squeeze any potential swelling before it took hold. Also, I could keep it from moving around too much as well. \n\nOn my way to the Student Center, I ran into the athletic black girl from the Club, the swimmer who'd been with Erika that first afternoon at the pool (WVC Ch:11 - the Pool Workout #1). I recognized her distinctive swagger from a distance. \n\nAs she drew closer, she waved at me. With the bright sunlight glinting off the pair of tight white shorts that hugged her slim hips and the sleeveless pale pink blouse, she looked great. Struck by how strong her thighs appeared, I kept my hands jammed in my pockets as she smiled. \n\n\"Hi, Bill. I'm Lydia. You remember me, right?\" \n\nBlushing slightly, I nodded, pulling my hand out of my pocket to shake hers when she extended it. Her grip was warm and firm. \n\n\"Of course I do.\" \n\n\"It's funny. We were just talking about you.\" \n\n\"We?\" \n\n\"Me and Erika. She was trying to reach you on the phone.\" \n\n\"Oh. I guess I left it in my room. Sorry.\" \n\n\"That's okay. What are you doing now?\" \n\n\"Um, I was on my way to get something to eat.\" \n\n\"Come with me back to the Sig house. You can grab a bite there. I know Erika that needed to talk to you.\" \n\nTaking my left arm, she turned me toward the imposing structure that was only a short walk in the other direction. Keeping that one hand deep in my pocket, I feebly protested. \n\n\"But I thought you had belong to the sorority? Or at least to the eating club?\" \n\nShe shrugged her broad shoulders as we set off together. \n\n\"It'll be okay. I'm the Pledge Director.' \n\nPurposefully striding down the walkway, she continued. \n\n\"The food's is actually pretty good, and you already know quite a few of the sisters.\" \n\n\"I do?\" \n\n\"Uh huh.\" \n\nI could feel the heat from her body as she clung to my arm. Inside my loose shorts, my cock hung down, bouncing off my left thigh as we crossed the sunny campus. \n\n\"Who will I know? I thought all the sisters of Sigma Epsilon were upperclassmen, uh -women.\" \n\n\"They are. You can't move in until you're a sophomore.\" \n\nShe hesitated before adding. \n\n\"All of the Club members live there.\" \n\n\"All of them?\" \n\n\"Yep. And everyone knows who you are.\" \n\nWith my foot on the bottom step, I stopped abruptly and looked at her. \n\n\"They do?\" \n\nShe grinned back at me and gently tugged on my arm, guiding me up the stairs. \n\n\"Oh yeah. You're developing quite the reputation, at least here in the sorority.\" \n\n\"Oh.\" \n\nI wasn't sure how to interpret that. We topped the stairs and started to cross the wide porch that covered the entire front of the red brick building. \n\n\"Come on in and we'll get you something to eat. Erika will be delighted that I've found you.\" \n\nI let her escort me toward the massive front door. As we approached, it swung open and a trio of attractive coeds emerged, laughing over a private joke until they spotted us. As we approached, all three fell silent, two full bodied blondes and a pretty, round faced girl with short black hair and dark skin who looked Hispanic. She and one of the blondes seemed vaguely familiar. All of them looked surprised to see me. \n\n\"Bill, what are you doing here?\" \n\nA chesty blonde with gorgeous waist length hair was the speaker. It really bothered me that I knew her from somewhere, and couldn't remember. Lydia began to steer me toward the open door as she explained. \n\n\"He's just going to grab a quick lunch.\" \n\nAll about the same height, each had an impressive pair of breasts pressing against their t-shirts. The modest endowment of the black girl who had me in tow paled by comparison, and I could feel blood starting to flow below my waist. Lydia wrinkled her brow as she paused in the doorway, staring at the blonde with her gorgeous tresses who wore her hair pulled back off her shoulders in a long, flowing ponytail. \n\n\"Amber, how do you know Bill?\" \n\nA slight flushed crossed her cheeks as the blonde lowered her pale blue eyes. \n\n\"He was a subject in the Physiology class (WVC Ch:18 - The Massage Class), the one I take with Yvette.\" \n\nThe Hispanic girl brightened, her black eyes sparkling as she nudged her friend in the ribs, adding. \n\n\"Yeah, and then you got to go to a private session with him (WVC Ch:23 - The Group Massage). \n\nMy cock continued to thicken inside my shorts, lengthening down the length of the leg and pressing against the loose cotton. Amber's face grew redder as she kept her gaze downcast, and I suddenly realized that she was starting right at my swelling crotch. \n\nStill gripping my left arm, Lydia turned to the third member of the group, who hadn't said a word. \n\n\"How about you, Kristin? Have you met Bill?\" \n\nA shy smile appeared on her round face as she shook her head. \n\n\"No, but I've heard a lot about him.\" \n\nThrusting out her hand, she continued. \n\n\"I'm pleased to meet you, Bill.\" \n\nI had no choice, so I withdrew my right hand from my pocket and shook hers. With the athletic black girl hanging on my arm, I couldn't keep my burgeoning hard-on from rising up and pressing harder against the front of my shorts. \n\n\"I'm glad to meet you too. Kristin, right?\" \n\nEagerly, she nodded as the other blonde's eyes grew wide. She nudged Yvette as Lydia started to draw me inside the sorority house. \n\n\"I look forward to getting to know you better.\" \n\n\"Me too.\" \n\n\"Bye girls.\" \n\nI was grateful that the black girl had taken charge, otherwise I wasn't sure how I would have extricated myself. Once we were inside, it took a couple of minutes for my eyes to adjust to the darkened interior, but Lydia didn't wait, whisking me through what appeared to be an ornately decorated grand entrance, past a massive set of stairs and into a brightly lit dining room. Two sets of double doors were framed with enormous windows that opened out onto a terraced patio, flooding the expansive room with light. \n\nSeveral long serving tables were arranged parallel to the back of the building so that all the diners had a view of the breathtaking panorama. And gathered around one of them were a couple of very familiar faces. Erika was standing as she and Valerie chatted with two coeds I didn't recognize. One was a striking black girl with cornrows pulled back from her pretty face and heavy braids falling down her back. The other was shorter with dark, luminous eyes, tawny skin and thick black hair cascading unbound to her shoulders. Like Yvette at the front door, she looked Hispanic. \n\nBeaming, my trainer turned from the table as we approached. Looking as luscious as always in a pair of pink shorts and a striped sleeveless blouse, she grabbed my free arm. \n\n\"Oh Bill, I'm so glad Lydia found you. We need to talk.\" \n\nLydia interrupted. \n\n\"Before you guys get started, let me get him something to eat. He was on his way to the Student Center when I invited him here instead.\" \n\nReleasing my left arm, the athletic black girl edged toward one end of the large room. \n\n\"So what would you like, Bill? Eggs? Toast? Yogurt and fruit?\" \n\n\"Umm, eggs sounds great. Scrambled, with whatever fruit they have.\" \n\n\"I'll be right back.\" \n\nWith that, Lydia spun on her heels and disappeared into what appeared to be the kitchen area. \n\n\"Before you and Erika have your little chat, let me introduce you to our other sorority sisters.\" \n\nPushing her chair back from the long table, the curly haired Valerie stood and turned to the girl sitting beside her. \n\n\"Regina, this is Bill.\" \n\nRising from the table with grace of a cat, the new black girl extended her hand. Now that she was standing, I could see that she was tall, only an inch or two shorter than I was, with a nicely rounded chest filling out her tight t-shirt. Stiff nipples pressed eagerly against the pale blue cotton. \n\n\"Hi, Bill. I'm glad to meet you.\" \n\nHer handshake was cool and firm while her eyes had a disconcerting directness. She was quite attractive. Keeping my left hand stuck in my pocket, I cupped the swollen head of my nearly erect cock in the palm of my hand. I hoped that I was shielding the distended pole from the girls. But the smirk Erika gave me after she raised her blue eyes from below my waist led me to believe otherwise. \n\n\"Regina, right?\" \n\nNodding, she smiled as she gripped my hand a few seconds longer than necessary. \n\n\"I've heard a lot about you. I'm delighted that we finally get to meet.\" \n\nFinally, she let go and stepped back. Valerie turned to the other coed, the Hispanic looking girl. \n\n\"And this is Anita.\" \n\nThe dark haired brunette stood and grinned, offering me her hand. She was shorter than the others, and sitting down had obscured her chest. While not particularly well endowed, Anita wore a tight white t-shirt without a bra. High and firm, her breasts were topped by perfectly round areoles, the dark brown circles clearly visible through the thin cotton. I couldn't help but glance down at them as I extended my hand and shook hers. \n\n\"I'm so glad to meet you, Bill.\" \n\nHer musical voice had a lilt to it, and she pronounced my name \"Beel.\" She also caught me peeking at her breasts. Smiling, she deliberately arched her back to emphasize them, almost as if she were offering her compact mounds up for me to get a better look. \n\n\"I'm glad to meet you too, Anita.\" \n\nFeeling trapped, I shoved my right hand back into my pocket as soon as the Hispanic girl let go. Erika jumped into the silence that followed. \n\n\"Have you checked your e-mail this morning?\" \n\nThere was an eager glint in her eyes. \n\n\"Uh, no. Not yet.\" \n\nBefore she could follow up her question, Lydia reappeared with a plateful of food. \n\n\"Bill, here you go.\" \n\nAs the black girl approached, Valerie pulled out a chair at the table, encouraging me to sit next to where she stood. As Lydia slid the plate onto the tabletop, l kept both hands jammed in my pockets as I took the few steps across the floor. At the last moment before I sat down, I pulled them out. Immediately, I popped back up to my feet. My butt was too sore to sit on the hard surface. \n\n\"Oh yeah.\" \n\n\"What is it Bill?\" \n\nAs Valerie asked the question, a smirk played across her freckled face. \n\n\"Umm, I guess I'm a little sore. I don't know, maybe I may have a bruise.\" \n\nThe girls were silent, and I suddenly realized that they were all staring directly at my crotch. Following their gaze, I saw that the size and strength of my erection had created a substantial tent in my pants. Quickly, I shoved my hands back into my front pockets and bent awkwardly at the waist, trying to hide, \n\nClearing her throat, Valerie continued. \n\n\"So, how did you get a bruise back there?\" \n\n\"I don't know. Maybe I bumped into something.\" \n\n\"Erika couldn't sit down to eat this morning either. Maybe you both bumped into the same thing.\" \n\nFrom the twinkle in her green eyes, I figured that Valerie knew exactly why neither one of us could sit down. Feeling a flush starting to spread across my face, I just stood there, kind of hunched over as Lydia slid her well rounded butt onto the table. Picking up the plate, she held out to me. \n\n\"You should eat your eggs before they get cold.\" \n\nI hesitated, trying to find way out of my predicament when Erika retrieved a fork from the table. As she handed it to me, she was very clear. \n\n\"Eat.' \n\n\"Yes Ma'am.\" \n\nWith a deep breath, I pulled my hands out of my pocket, accepting the fork and plate of food. A sharp intake of breath came from Anita as my stiff cock pressed enthusiastically against the bulging front of my pants. Holding the plate under my chin, I avoided their eyes and shoveled the eggs into my mouth as the four of them watched. With the flush in my face spreading down my neck, I could feel my hard-on twitch inside the loose shorts, certain that my excitement was obvious. Their glances downward grew longer and more pronounced. The smirk still dancing on her lips, Valerie asked. \n\n\"Are the eggs good?\" \n\nI nodded, trying to finish the food as fast as I could. Keeping her eyes fastened on my distended crotch, Regina leaned over to murmur in Valerie's ear, a stage whisper loud enough for everyone to hear. \n\n\"I see that you weren't exaggerating.\" \n\nAnita didn't even bother to whisper, asking out loud, asking no one in particular. \n\n\"Can we have him take it out?\" \n\nGrinning broadly, Lydia stepped in.' \n\n\"Girls, let's let him eat in peace. Besides, I think Erika needs to talk to him in private.\" \n\nUshering the pair of disappointed coeds out of the dining room, the muscular black girl winked at me over her shoulder as she departed. Valerie trailed after them, crossing the room to refill her tea cup as my trainer edged closer. Gazing down at the throbbing bulge in my pants, she asked. \n\n\"Are you wearing anything underneath?\" \n\nWith a mouth full of eggs, I shook my head. \n\n\"Not a cock ring? Or that leather strap?\" \n\nI managed to swallow before I replied. \n\n\"No, Ma'am.\" \n\n\"That's impressive. No supplements either?\" \n\n\"None.\" \n\nSagely, she nodded, taking me by the upper arm and leading me closer to the oversized windows. \n\"They said that eventually you won't need any of that.\" \n\n\"Really?\" \n\n\"Yeah. Have you checked your e-mail yet today?\" \n\n\"Uh, no. Did I miss something?\" \n\nConsulting her watch, she shook her head. \n\n\"Not yet. But we need to go now.\" \n\nTaking my half-full plate out of my hands, Erika slid it onto the table and escorted me toward the front door. Waving as we passed Valerie, she called out. \n\n\"See you over there.\" \n\nTwo more girls were entering through the massive door as we crossed the grand entrance. One was pale and slim with long black hair, watery blue eyes and barely any curves at all under her dark blouse. The other was a strawberry blonde of the same height with freckles, attractive sharp features and just a slightly larger chest than her companion. What did catch my attention were the prominent points of erect nipples of the freckled blonde pulsing eagerly against the tight cotton t-shirt. When I glanced up, her bright blue eyes were laughing at me. \n\n\"Hello, Bill. It's good to see you again.\" \n\nAgain? Before I could react, the black haired girl elbowed her friend. \n\n\"Is this the guy?\" \n\nWithout waiting for an answer, she looked me up and down, openly lingering below my waist as Erika smoothly reintroduced the strawberry blonde. \n\n\"Bill, you remember Taylor, don't you? Well, maybe not. You were pretty busy that night. She's the President of our sorority.\" \n\nTaylor seemed familiar, but I couldn't place her pretty face with the high arching eyebrows. With her eyes still twinkling, she shook my hand before letting go and stepping aside for the friend. Finally lifting her gaze up from my distended crotch, the black haired girl stuck out her hand. \n\n\"Hi, Bill. I'm Adele.\" \n\nThere wasn't the same warmth in her eyes as I'd seen in Taylor's. In fact, they were downright icy. As we shook hands, Erika added helpfully. \n\n\"Adele's our Secretary.\" \n\nDropping the handshake, the black haired girl with the frosty blue eyes smiled. \n\n\"I'm sure we'll be seeing a lot more of you around the house.\" \n\nLowering her steady gaze down to the bulge in the front of my pants, she made certain I knew exactly what she meant. \n\n\"I hate to interrupt, but Bill and I are going to be late for an appointment if we don't hurry.\" \n\nI was glad Erika took command. I was more than ready to leave. Smiling, Taylor gave us a merry wave of her hand as we turned to exit into the bright sunlight. Hurrying across campus, my trainer spoke without a sideways glance. \n\n\"You really don't remember her? Taylor?\" \n\n\"She looked familiar, but no, I don't.\" \n\n\"Well, she did have on a very different outfit the last time you met her.\" \n\nI took another couple of steps before it dawned on me. \n\n\"She's in the Club?\" \n\n\"Yep.\" \n\nI felt pretty dumb. That meant I'd serviced her before and given her at least one orgasm, and she'd sucked my cock. Probably more than once, and I didn't even recognize her. Erika must have sensed my distress. \n\n\"Don't worry about it. It takes time to know everyone, and I'm sure you'll get a chance to get better acquainted.\" \n\nWe hurried on in silence for a minute and then I brought up something that I'd wanted to ask for some time, but didn't really know how to present. So I just blurted it out. \n\n\"Erika, are you a virgin?\" \n\nThat brought her to an abrupt halt. Stopping in the middle of the walkway, she looked at me, incredulously. \n\n\"Where did that come from?\" \n\nThe gorgeous brunette didn't look angry or upset, just puzzled so I took a deep breath and plunged ahead. \n\n\"Well, everyone in the Club seems so self-assured and experienced, and I'm not. I'm still a virgin and I just wondered if that was going to change anytime while I'm in the Club, I mean, if I get in.\" \n\nI felt really stupid. Her eyes were piercing as she stared at me. Then she smiled, shook her head and took my arm. When her deep blue eyes softened like that, I kind of melted inside. We set off again, at a more deliberate pace this time. \n\n\"Yes, I am a virgin, technically. I don't have nearly as much experience as you think I do.\" \n\nWe walked for another few steps before I ventured another question. \n\n\"How about the other girls in the Club?\" \n\nErika didn't answer right away. After a few moments of walking in silence, she replied without looking at me. \n\n\"I'm not sure I can answer that for everyone. Valerie isn't, but you probably already knew that.\" \n\nI didn't respond, waiting for her to continue. \n\n\"Jordan definitely is. Your penis is the first one she's ever seen.\" \n\nMy trainer chuckled, thinking about the petite redhead, I guess. \n\n\"She keeps reminding me how lucky I am to be your trainer. Diane, Mya and Brooke - they're probably virgins as well. They're too much into girls.\" \n\nShe shrugged her shoulders as we approached my dorm. \n\n\"The others, I don't know about.\" \n\nI cleared my throat before I broke her train of thought. \n\n'You haven't told me where we're going, but I assume that we need something from my room since we seem to be heading toward my dorm.\" \n\n\"I'm sorry. Yes, you need to get your display suit #2, the bright blue number with all the straps. Have you taken any vitamins or supplements today?\" \n\n\"Umm, no. Should I?\" \n\n\"Not now. It's too late.\" \n\nChecking her watch, Erika stopped as we reached the front steps. \n\n\"I'll wait down here while you go get the suit.\" \n\n\"Anything else I'm supposed to get?\" \n\nGrinning, she shook her head, her thick hair brushing her broad shoulders. \n\n\"Not today.\" \n\nI turned to head upstairs, wondering whether Chandra across the hall would be waiting for me. She wasn't, and I grabbed the neon blue suit, stuffing it into my front pocket as I locked the door behind me. Erika was sitting on the steps when I reappeared. She led the way again. I had no idea where we were going, although since she didn't have her car, I figured that it must be on campus, or at least within walking distance. \n\nWalking quickly in silence, my curiosity got the better of me. \n\n\"So where are we going?\" \n\nWith an impish gleam in her eyes, she replied. \n\n\"You'll see. Did you put the suit on?\" \n\n\"No. I just put it in my pocket.\" \n\nWith a quick sideways glance at the bulge still tenting the front of my pants, she smiled. \n\n\"I wasn't sure. You have a pretty sizeable lump in your pants.\" \n\nI flushed slightly as we hurried along. After a few more moments, I continued our earlier conversation. \n\n\"What about Lydia?\" \n\n\"What about her?\" \n\n\"Is she a virgin?\" \n\nErika was silent, and I thought I'd crossed a line that I shouldn't have. Finally, the brunette answered me. \n\n\"I don't know.\" \n\n\"Really? I thought you guys were pretty good friends.\" \n\n\"We're more than that, but there are some things we don't discuss. At least, we haven't.\" \n\nWe walked along the pathway for a few more steps before she stopped completely and turned to me. Suddenly, she looked really serious. \n\n\"Here's what I know. While the Club doesn't have any specific rules, there are some traditions or unspoken customs. When the Club was formed, it was expected that most members would eventually find a man after they graduated, get married and raise a family. Remaining a virgin was the norm then, and was actually encouraged. The Club was just a fun interlude.\" \n\nTaking me by the arm, she led me off the concrete path as a couple of coeds hurried by. Once they were out of earshot, she continued. \n\n\"It still is like that. We're questioned about our prior experience before we join, and we're expected to limit our activities to scenarios within the Club, or at least get prior approval form the Club management. That's why Valerie had to get Club authorization to continue to date her high school boyfriend. And why any scene needs to be approved first.\" \n\n\"So occasional escapades aren't unheard of?\" \n\nHer blue eyes sparkled as she answered my question with one of her own. \n\n\"You mean like that quickie you gave Valerie in the back room of the Student Center the other day?\" \n\nSheepishly, I lowered my gaze. \n\n\"Oh. She told you about that?\" \n\n\"Oh yeah. We're also very good friends.\" \n\n\"Oh. And you're not mad?\" \n\n\"No. Why would I be mad?\" \n\nErika looked genuinely puzzled. I thought that she might be just a bit jealous. Actually, I realized that I was more than a little disappointed she wasn't. Consulting her watch once more, she grabbed my arm and took off again, talking as she dragged me along. \n\n\"Management knows that impromptu couplings happen. They just want to keep them to a minimum and encourage the planned scenarios instead. If we're all exhausted from Club events, then we'll have little energy for any extracurricular activities.\" \n\nThe Art building loomed ahead. \n\n\"Are we going to another posing session?\" \n\nShe grinned at me. \n\n\"Yep. A private one. Invitation only.\" \n\nMy cock twitched inside my shorts. It had been dormant since we'd left the sorority house, but the idea of a private session in the middle of a Sunday afternoon started the blood flowing again. \n\n\"Who's going to be there?\" \n\nGrinning, my brunette trainer didn't answer as she threw the front door open and pulled me inside. Hurrying down the empty hallway, she stopped only when we reached Ms. Reynolds' classroom. The door was unlocked and she pushed her way inside. Valerie looked up as entered, her firm breasts pressing eagerly against the same emerald green polo shirt she'd been wearing at the sorority house. She'd been rearranging the room. \n\n\"I was beginning to wonder what had happened to you two.\" \n\nDropping her eyes to the front of my pants, she asked Erika. \n\n\"Does he have it on?\" \n\n\"No, he still has to change.\" \n\n\"Then let's get on with it.\" \n\nThe green eyed brunette finally addressed me. \n\n\"Where's your display suit?\" \n\nBy way of an answer, I pulled the blue sliver of cloth from my pocket and held it up, the straps dangling down toward the floor. She nodded and resumed moving the easels, and it was only then that I noticed that the bar stool I usually sat on had been taken from the raised platform and now stood on the floor, near the front of the small stage. \n\n\"Well, put it on. The others will be here shortly.\" \n\nErika had climbed up onto the platform and retrieved a cushion which she carefully placed on the edge of the stage near the stool. As I stripped off my t-shirt and unzipped my pants, I was dying to know. \n\n\"Who are the others?\" \n\nHalting her activity, Valeri turned to my trainer. \n\n\"You haven't told him?\" \n\nAs she gingerly sat down on the soft cushion, Erika grinned and shook her head, observing me undress. With my cock swinging heavily between my legs, I stepped out of my pants and started to untangle the suit. \n\n\"Nope. I figured that it would be more fun to let him find out when they walk through the door.\" \n\nAlthough it wasn't hard yet, my cock had begun to thicken and fill, stretching out away from my thighs. Both girls watched as I slid the cloth sheath down my swelling shaft, working the shiny nylon until it encased the entire length of my pole. Erika called out. \n\n\"Make sure it's tight.\" \n\nBending over, I wrapped the blue pouch around my balls and started to lace the first strap around both my cock and balls, pulling it snug before looping the end between the pair of double O rings. Blood started to surge into my cock as I took the next strap and circled the base of my shaft, again cinching the nylon it firmly as it pressed against the underside of my now bulging balls. The next one I wrapped around the thickened middle of my stalk while the last strap circled just behind the prominent ridge of my cockhead. \n\n\"Tighter!\" \n\nResponding to my trainer's directive, I tugged on the final strap, stretching the shiny nylon across the rounded bulb, so tight that indentation of my cockhole was plainly visible. Straightening, I faced the seated Erika and she nodded approvingly. \n\nNow fully erect, my cock was snugly bound inside the sheath and pouch, encased in the brilliant blue nylon like a present waiting to be unwrapped, twitching in anticipation. As it jutted straight out from between my thighs, I turned toward Valerie causing it to sway ominously back and forth. Smiling broadly, she finished rearranging the easels in a semi-circle around the high stool. There were four of them. \n\n\"They're going to love that.\" \n\n\"Who?\" \n\nIgnoring my question, Erika responded to the other brunette. \n\n\"I'm not so sure. I think they were hoping he would be totally nude.\" \n\nStepping back to survey her work, Valerie rested her hands on the hips and nodded. \n\n\"You may be right. How bad does his backside look?\" \n\nErika shrugged. \n\n\"Not good. His back is pretty well striped too. His punishment was much worse than mine. Turn around and show her.\" \n\nThe last was directed to me, so I spun around and presented my bare ass to Valerie. \n\n\"Oh my! He does have a lot of wicked looking welts, on his ass as well as across his back.\" \n\nWhen she ran her cool fingers across the curves of my butt, I jumped, causing my protruding hard-on to bob up and down. Eyeing the bouncing pole, my trainer noted wryly. \n\n\"I don't think it will matter. No one's going to be drawing his butt.\" \n\nValerie giggled as she withdrew her caressing hand and tossed me a robe. \n\n\"You're probably right. Put that on. The other students will be here shortly.\" \n\n\"Who are they?\" \n\nStill ignoring me, Valerie climbed up onto the platform as I donned the robe. She picked up another soft cushion from the couch and handed it to me, grinning. \n\n\"You'll find out soon enough. Here, this should make sitting on the posing stool a little easier.\" \n\nThe four easels were pretty close to the stool, much closer than normal, and as I balanced the cushion on top of the wooden seat, I asked. \n\n\"Why are they so close?\" \n\n\"The other students had wanted to draw some detailed close-ups, and since they're paying for it, it seemed only fair.\" \n\nI didn't have to wonder what would be the object of their attention. It was tenting the front of my robe, sticking straight out from between my thighs and rippling the thin cloth with every little movement I made. \n\n\"They're paying for it?\" \n\nShe nodded. \n\n\"It'll be credited to your campus account, just like all the other sessions.\" \n\nWho would pay to draw me? I was still turning that over in my mind as I heard excited female voices echo down the hallway. The question was answered as the girls from Ms. Reynolds' Intermediate Drawing class burst through the door. Popularly known as the Gang of Three, they were overcome with waves of giggles as they found their easels, exchanging glances with each other as they also cast sly looks at me. I remembered they'd asked if I did any private modeling (WVC Ch.7: The Intermediate Drawing Class #1), and I guess this was it. They must have been anticipating this private session. \n\nIt had been a month since I'd posed for that class and I hadn't seen any of them since. I'd forgotten just how large Whitney's breasts were, full melons swaying heavily beneath the loose top she wore. Although the blue-eyed blonde was a bit overweight, she carried it well, her shapely curves seeming to receive all the extra pounds. Her chest moved so freely under the sleeveless blouse, I wasn't sure if she was wearing a bra. \n\nClearly, the tall brunette with the closely clipped hair wasn't. Blair's pert nipples threatened to poke through her thin t-shirt, darkly visible and obviously already erect. Tiny shorts revealed her long legs, tanned and muscular. As she turned and bent over to retrieve a pencil she dropped, I gasped at the sight of the under curve of firm ass cheeks, unmistakably bare beneath the shorts. She was either wearing a minuscule t-back, or she was going commando. \n\nThe third member of the trio, cute Veronica smiled as she met my gaze before pointedly dropping her blue eyes down below my waist, focusing directly on the twitching tent in my lap. Her tight t-shirt did little to conceal her high rounded breasts, topped with reddish brown nipples dimly visible through the white cotton. I couldn't tell if she wore a bra underneath or not. Like the other girls, the small shorts revealed most of her shapely legs. \n\nAs the three of them gathered around the easels, each finding her own, Valerie locked the door and then returned to the semi-circle. \n\n\"Erika's going to review some ground rules before we get started.\" \n\nCollectively, the three girls groaned. From her seat on the edge of the platform, Erika held up a hand for silence. \n\n\"First, there will be no touching of the model. He is here for you to draw, not to play with. Also, no mention of this session will ever be made to another student. Although Ms. Reynolds knows of our arrangement, no one else does. Any questions?\"  \n\nWhitney raised her hand, not looking at me. \n\n\"Okay, so we can't touch him. You've set the easels really close to where he's going to posing. Is there a minimum distance that we need to stay back?\" \n\nStumped by the question, my trainer hesitated and looked for guidance from Valerie. The curly haired brunette shrugged her shoulders as she assumed her place in the semi-circle, on the end closest to Erika. \n\n\"I guess not. Go ahead and start. Do you want him standing?\" \n\nThe last question was directed toward Valerie, and the curly haired brunette shrugged. \n\n\"Sure.\" \n\nFingering the belt that kept the obscuring robe secure around my waist, I was suddenly struck by feral look in their eyes. \n\n\"Lose the robe, Bill. We don't have all afternoon.\" \n\nI swallowed and let the thin cotton slide off my shoulders, falling all the way to the floor. Immediately, the Gang of Three focused on the bright blue sheath jutting eagerly from my crotch, trembling as it stretching out toward them, parallel to the ground. Standing between Valerie and Blair, the disappointment on Whitney's rosy cheeked face was unmistakable. \n\n\"I thought he was going to be nude.\" \n\nErika smiled. \n\n\"Be patient. You'll get your money's worth.\" \n\nThe busty blonde frowned, eyeing the neon display suit. Across the semi-circle, brown haired Veronica cleared her throat. \n\n\"He looks really big, even bigger than I remember.\" \n\nAs Valerie smoothed the paper on her easel, she observed. \n\n\"For all the other classes, he wore a black posing pouch, right? Wearing a lighter color, like that blue, that may make him look bigger.\" \n\nLooking skeptical, the cute brunette started her sketch as Blair grinned, gazing down at my twitching sheath. \n\n\"I think it's kind of cute, having his dick wrapped up like a birthday present, a gaily decorated package just waiting to be opened.\" \n\nThat idea must have appealed to Whitney. She brightened at the comment and bent to her work, joining the others in drawing me as I stood facing them, relaxed with my hands hanging loosely at my sides. From five or six feet away, it was clear they were all sketching my lower torso. With the nylon strap cinched tightly around my cock and balls, I remained fully erect, my hard-on twitching slightly as the time ticked by. \n\nAfter about ten minutes, Veronica stopped and stretched, arching her back and thrusting her rounded breasts out toward me. The sharp points of her rigid nipples pressed against the white cotton, the reddish ovals of her areoles visible through the white material. My stiff cock jerked upward. Shaking her head, she stared down at the shiny display suit. \n\n\"How does he do that?\" \n\nFrom behind me, Erika replied with her own question. \n\n\"Do what?\" \n\n\"How does he keep his cock hard all the time? Most guys I know can't stay like that for very long.\" \n\nAn idea suddenly occurred to her, and she abruptly looked up at my face, but asked Erika. \n\n\"He is hard, isn't he?\" \n\nMy trainer didn't answer immediately. Her footsteps echoed behind me as she crossed the floor, and when she slid a cool hand around my shoulder, I jumped. She peeked around my chest, gazing down at the brightly colored suit and nodded. \n\"Probably.\" \n\n\"So how does he do that? Keep his cock hard for a whole class?\" \n\nCaressing my shoulder, Erika slid her other hand up my inner thigh, easing my legs farther apart. I could hear the smile in her low voice as she answered, indicating the blue strap that circled my cock and balls, tight against my lower abdomen. \n\n\"You see this strap?\" \n\nAll three girls nodded, although Whitney took a step closer and bent over, peering between my thighs to get a better look. The movement caused her oversized breasts to sway heavily inside the loose sleeveless blouse. \n\n\"It keeps the blood trapped in his penis, and helps him maintain an erection.\" \n\nVeronica persisted, watching my hard-on throb and twitch. \n\n\"So he wore something like that for class?\" \n\n\"I think so.\" \n\nStill rubbing my inner thigh, my trainer looked to Valerie for confirmation. Glancing up from her easel, the curly haired brunette nodded and smiled when she saw Erika teasing me. \n\n\"Let's have him change position.\" \n\nAgreeing with Veronica's suggestion, Blair flipped her paper over and added. \n\n\"How about having him turn sideways so we get a profile?\" \n\nNo one objected so Erika withdrew her hands. Shuffling my feet, I turned toward the two brunettes and away from Valerie and Whitney, the protruding sheath swinging back and forth in front of me. When the chesty blonde finally shifted her gaze from my stiff pole to my bare ass, she gasped. \n\n\"What happened to his butt?\" \n\nWith all the attention being paid to my bulging display suit, I'd completely forgotten about the stripes decorating my backside. Lightly running her fingers across the upper curves of my ass cheeks, Erika replied. \n\n\"He defied a direct order from someone he was supposed to obey, and this was the result.\" \n\n\"Wow! It looks like it really hurt.\" \n\n\"Did you give it to him?\" \n\nThe last question came from Whitney. Erika smiled before she answered. \n\n\"No. Not this time.\" \n\nShe didn't elaborate, instead turning toward the platform to retrieve the stool with the cushion on top. As she picked them up and placed them just inside the arc of the semi-circle, her smile grew mischievous. \n\n\"They want another pose, Bill. So let's give them one.\" \n\nSetting the stool down, she stepped back and nodded toward it. \n\n\"Stand on the other side of the stool and face the platform. \n\nObediently, I took the few steps to follow her instructions and faced away from the students. \n\n\"Put both hands on top of the stool and spread your feet apart. Wider!\" \n\nThe position my trainer was having me take exposed more than just my blistered ass. \n\n\"That's it. Now lean forward and bend over, resting your weight on the stool. Excellent! I want to make sure the students have a really good view.\" \n\nWith my feet farther apart than the legs of the stool, I was certain that view included my puckered sphincter. And because my hips were tilted forward, I was pretty sure that my brightly wrapped cock and balls were visible as they hung down between my open thighs. Not a word was spoken. The only sound in the room was the scratching on the paper as the four coeds drew. \n\nLeaving me bent over, Erika sauntered over to look at Veronica's work. When she moved out of the corner of my eye, I suspected that she was observing the other students as well. When she reappeared gazing at Valerie's easel many minutes later, I knew I'd guessed right. Coming full circle, she strolled back toward me until she stopped where she began, on the other side of the stool, a knowing sparkle in her deep blue eyes. \n\n\"I think it's time for one more pose. Stand up, Bill, and assume the position.\" \n\nFollowing her command, I straightened up and clasped my hands on top of my head. My feet were already spread well apart, so all I had to do was thrust my hips forward. Although my raging erection had begun to wilt, it still protruded out away from my crotch, hovering over the cushion perched on top of the stool. She gazed down at my jutting pole it as she spoke to the students. \n\n\"You may be impressed with his stamina in class, and have wondered how he can maintain an unmistakably erect penis for so long.\" \n\nI gasped as she casually reached down and curled her hand around the base of the blue sheath. Smiling at me, she began to squeeze and release, squeeze and release, encouraging me to swell in her grip. \n\n\"With a cock ring or leather strap, staying fully erect is not much of challenge.\" \n\nWith her smile growing broader, she halted her rhythmic action and started to unwrap the nylon straps, beginning with the one right below my cockhead. I was certain that the girls on the edges of the semi-circle, Valerie and Veronica, could see exactly what my trainer was doing. \n\n\"But to keep his penis hard and erect --\" \n\nShe unwound the two remaining straps that circled my thickened shaft, and began working to release the final one, the one that tightly cinched both my cock and balls. \n\n\"Without any type of genital restraint to help him --\" \n\nAfter untangling the last strap, she peeled the clingy material off my swollen balls, rolled it off the heavily veined stalk, and finally uncovered my engorged bulb, dark red and shiny. \n\n\"Now, that is a much more difficult test.\" \n\nDropping the jumble of blue straps onto the cushion, she wrapped one hand around the base of the stiffened shaft and started to squeeze and stroke, coaxing me back into a full erection. With the fingers of her other hand, she teased the rounded knob, her feathery touch playing over and around the taut skin, tickling the slit as I continued to swell in her grasp. Nodding her approval, she grinned and suddenly let go. Twitching and quivering with eager excitement, my stiff cock stuck straight out toward her. \n\n\"Yes, I definitely think he's ready for another pose.\" \n\nTaking me by my shoulders, she turned me around so that I was facing the four girls. With my hands still on top of my head and my erection jutting proudly out from between my thighs, I just stood there and let them look. Whitney gasped as the others stared, eyes wide at the sight of my trembling hard-on.t \n\n\"Omigod!\" \n\n\"I figured he was pretty big, but not like this.\" \n\nChuckling, Erika let her fingers slide down my back, caressing my skin. \n\n\"Yes, he is rather well endowed.\" \n\nThey were silent for a moment, watching my erection twitch and quiver. Trailing her soft fingers lower, my trainer cupped my right ass cheek and gently urged me forward, tilting my hips up toward their rapt stares, like I was offering my fully engorged cock up for their inspection. \n\n\"So are you girls going to draw him? Or are you just going to stand there and stare at his penis?\" \n\nStill, they didn't move, watching my jutting hard-on tremble. Whitney cleared her throat before she spoke. \n\n\"Can we move closer?\" \n\nI didn't see how much closer they could get and still have room for their easels, but Erika gave them the approval. \n\n\"Sure. However close you need to be. \" \n\nThat was all the girls needed to hear. Immediately, they pulled the tripods within a couple of feet from where I stood, angling the pads of paper so they could crowd around me. In the center, Whitney and Blair faced each other and placed their easels back to back. Valerie had hers right behind the busty blonde while cute Veronica was next to Blair. My rigid cock stuck straight out, pointing between the two in the middle. Once she'd arranged her pad of paper, Whitney paused, staring down at my quivering cock. \n\n\"Did they whip his dick? He's got some really red marks there too.\" \n\nAs she fondled my ass, Erika let her fingers slide down into the valley between my cheeks as she answered. \n\n\"Uh huh. And he deserved every stroke he got.\" \n\nTaking a quick peek down at my trembling pole, I saw that the raised welts remained red and angry looking. The sound of a pencil scratching paper caused me to glance back up. Valerie had resumed drawing and the other girls soon joined her. The last to pick up her pencil, Blair offered one observation. \n\n\"I looks like it was pretty painful.\" \n\nI didn't respond and soon, the soft scraping of the pencils was the only sound in the room. When my trainer's fingertips finally found my puckered sphincter, I caught my breath, wondering if she was going to go any farther right there in front of the other students. I didn't have to wait long to find out. Leaning against my back, Erika pressed one rounded breast into my side as she whispered, still teasing my crinkled hole. \n\n\"Let's see if they notice.\" \n\nWith that, she popped one finger into my rectum. I managed to suppress a gasp, but I wasn't able to keep my erection still. It jerked noticeably as she eased her entire finger slowly inside. Whitney stopped sketching and frowned, staring down at my bobbing erection. \n\n\"I can't draw his dick if it keeps jumping around like that.\" \n\nNo one responded until Valerie put down her pencil and took a step forward into the tiny circle. She reached out toward my jerking cock, and then suddenly stopped, leaving her hand to hover in midair as she looking questioningly up at Erika. \n\n\"I was going to hold him still. Or would that be violating one of the rules.\" \n\nWith her finger now firmly buried in my ass, Erika looked over my shoulder at her fellow Club member. \n\n\"As long as it's you, I guess it's okay.\" \n\nLooking up at me with a twinkle in her green eyes, the curly haired brunette wrapped her hand around the base of my shaft, gripping my cock tightly in her fist. Ever so slowly, my trainer withdrew her finger, my stiff pole pulsing eagerly in Valerie's grasp. As Erika flattened her full breast against my side, watching her friend squeeze my bloated cock. I could feel the sharpness of her erect nipple as it poked my skin. My breathing started to grow shallow as she eased her finger back inside. \n\nTightening her grip, the curly haired brunette glanced up at me again, a sly smile flickering on her lips. I think she knew exactly what Erika was doing. Gradually, my trainer picked up the pace, still managing to conceal her slowly accelerating action from the other girls. They were too busy staring and sketching. After several minutes, Veronica put down her pencil and turned to Valerie. \n\n\"Wouldn't you like to finish your drawing? I'd be willing to hold him.\" \n\nValerie raised her eyebrows, looking over my shoulder at Erika. With her finger deep inside my butt, my trainer paused and then shrugged, rubbing her erect nipple across my back as she answered. \n\n\"Oh, what the hell. Sure.\" \n\nWith a twist of her finger, Erika hissed in my ear. \n\n\"Don't make me regret this.\" \n\nReleasing her grip, Valerie stepped back to return to her easel, leaving my hard-on to twitch and throb enthusiastically in the air. The little brunette approached from the other side and cautiously reached out, carefully wrapping her small hand around the jerking pole. A good two thirds of my shaft extended up beyond her small fist. Lifting my thickened log up so that she was staring down at the top of my rounded cockhead, Veronica commented to no one in particular. \n\n\"I've wanted to hold his dick ever since the first day he posed in class.\" \n\nShe shivered as she squeezed, examining the purplish bulb in her grasp. \n\n\"It feels even better than I thought it would.\" \n\nErika wiggled her finger inside of me, grazing the tip of my prostate gland. I couldn't stop a reaction, and my hard-on surged higher in the girl's grip. She gasped. \n\n\"Oh my! He's got a really lively one.\" \n\nBlair stopped sketching and leaned over, peering at the end of my engorged cockhead. \n\n\"What did he just do, Ronnie?\" \n\n\"His cock. It jumped in my hand.\" \n\nWhitney had a smirk on her pretty face as she glanced up at me. \n\n\"Then you're just to going to have to hold him tighter.\" \n\nHer blue eyes wide, Veronica tentatively lifted her other hand and looked past me to my trainer. \n\n\"Can I use two hands?\" \n\nI could hear the smile in Erika's voice as she replied. \n\n\"Sure. Go ahead. He's still learning to control himself.\" \n\nEven with her second hand curled around my shaft, a good portion of the thickly veined stalk stuck out above her double fisted grip. The bright lights glinted off the shiny bulb, the skin stretched tight as Veronica squeezed me. \n\n\"I must apologize for Bill. He supposed to ignore any stimulus and remain absolutely still when he holds a position.\" \n\nAfter Erika's apology, the curvy blonde stopped drawing and gave me a long look up and down, lingering between my spread thighs. \n\n\"He looks very comfortable in that pose. Is it one you guys use in that secret club?\" \n\nGlancing sideways at Valerie, she continued. \n\n\"Both of you two are in it, right?\" \n\nSlowly pulling her finger back out of me, my trainer replied without specifically answering Whitney's questions. \n\n\"With his hands out of the way on top of his head, and with his feet spread well apart, this particular position forces Bill to remain quite vulnerable. And it allows easy access to his genitals. Wouldn't you agree?\" \n\nWith her blue eyes focused on the portion of my throbbing cock jutting up from her fists, Veronica eagerly concurred, her head bobbing up and down. Blair grinned as she kept sketching, but the blonde leaned sideways, trying to peer around my torso. \n\n\"What are doing to him?\" \n\nAgain ignoring the question, Erika gently slipped her finger back into my rectum. Whitney's eyes grew wide. \n\n\"You've got your finger up his butt!\" \n\nWithout missing a beat, my trainer continued to plunge her single digit farther inside until she brushed the tip of my prostate once more. I shivered, feeling my hard-on pulse in the little brunette's tight grasp. \n\n\"It also allows for easy entry into his ass.\" \n\nI swallowed, feeling an urgency in my balls as Erika gently wiggled her finger, tickling the gland deep inside of me. My rigid cock throbbed again as Veronica exclaimed. \n\n\"Wow! Look at how wide he's opened up!\" \n\nSo everyone looked. Even Valerie paused and gazed down at the engorged knob the cute brunette held high. The lips of my cockhole had indeed gaped open, the taut skin stretching even more as the slit yawned wide. And as we all watched, a single drop of pearly fluid emerged from the hole and perch precariously on the edge, glistening in the light. \n\n\"Omigod! Now he's starting to leak!\" \n\n\"Hold him right there. I want to get this.\" \n\nExcitedly, Whiney alternated between leaning over my crotch to study the engorged bulb with the burgeoning dewdrop, and turning back to her paper to sketch furiously. She was so close that I could feel her warm breath wash over the straining end. Behind me, Erika was absolutely still, her single finger buried deep within my ass, the tip just touching the sensitive gland. It only took a minute for the drop to swell and slide off the indented tip, dribbling down the underside of my cockhead, along the swollen shaft until it reached Veronica's top hand. Bending closer, she studied the trembling knob, now deep purple. \n\n\"Cool.\" \n\nAided by Erika gently massaging my prostate, the cute brunette squeezing the base of my pulsing shaft produced a second drop of clear fluid, and started whole process all over again. By the time Blair made a few finishing touches on her paper and tossed her pencil into the rack of her easel, the flow out of my cockslit had increased so that I was drooling all over the back of Veronica's hands. The taller brunette stepped from behind her tripod and began to edge into the circle \n\n\"I'm done, Ronnie. I'll hold him now so you can draw his dick.\" \n\nGrudgingly, Veronica let go, releasing my stiff cock so that it stuck straight out into the middle of the circle, twitching enthusiastically and dripping onto the floor below. As she stepped back behind her easel, Veronica held her hands awkwardly at her sides, like she wanted a towel to wipe them off. When she saw me watching her, she grinned and deliberately licked first one hand, and then the other, extending her pink tongue much farther out of her mouth than she needed, making a show of sliding the tip of all around her fingers. \n\nWith Erika's teasing finger still buried in my ass, I couldn't stop my jutting hard-on from bouncing eagerly up and down. Turning sideways to slide between the closely packed easels emphasized the thrust of Blair's erect nipples against her thin top. Keeping her brown eyes fastened on my bobbing cock, she sank to the floor at my feet. Reaching up, she curled one hand around the upper part of my shaft, lightly running the pad of her thumb back and forth cross the underside of my trembling knob. \n\n\"Umm. Very nice.\" \n\nAs she wet her lips, she slid her loose grip all the down to the base and squeezed, pressing the back of her hand firmly against my balls, stretching the already taut skin even tighter. As I exhaled, I shivered her strong grasp. Veronica must have spotted my slight quaking as she slid back behind her easel. \n\n\"Are you cold, Bill?\" \n\nI really hadn't thought about the room temperature. I'd been paying more to what the girls were doing between my legs. Before I could answer, the cute brunette continued. \n\n\"I'm not at all. In fact, I feel a little too warm.\" \n\nWatching my face, Veronica whipped her t-shirt up over her head and tossed it aside, revealing that she was wearing a bra, a small white lacy one that did little restrain her upturned mounds. Soft curves of flesh spilled from both sides of the narrow triangles while large reddish brown nipples poked excited and firmly erect through the thin nylon. She arched her back, thrusting her firm breasts out toward me and in response, my cock lurched in Blair's grip. \n\n\"Oh, wow! His dick just jumped in my hand.\" \n\nBreaking her gaze from the shiny cockhead she held, the kneeling girl glanced up at her friend. \n\n\"Ronnie, I think likes you.\" \n\nThe three girls still at their easels continued to draw, but spent more time studying my throbbing hard-on than sketching. Ever so slowly, Erika began to wiggle her fingertip to caress my prostate. More drops of clear liquid emerged from my gaping cockslit, oozing over the straining bulb, trickling along the underside of my thick shaft and coated the back of Blair's fist. With her eyes fixated on the end of my drooling bulb, she commented. \n\n\"Now he's leaking even more. I think he really likes you.\" \n\nNot to be outdone, Whitney slammed down her pencil and stripped off her own t-shirt, the oversized breasts jiggling inside the tiny triangles of her bra. The narrow slivers of white lace struggled to contain the heavy globes, crowned with bright pink nipples, the round areoles more than two inches across. Crinkling the shimmering cloth, they were quite obviously very aroused. Almost defiantly, she pulled her shoulders back so that her large mounds jutted out toward me, her blue eyes boring into mine as she asked. \n\n\"So, does he like me too?\" \n\nNot trusting my voice, I nodded, although no one but the chesty blonde was looking at my face. As my trainer kept teasing my prostate, the steady stream of lubricating fluid flowing out of my cockhole answered for me. Blair giggled as she tightened her grip around the base of my shaft. \n\n\"Boy, does he ever! He's leaking like a river now.\" \n\nSatisfied with her effect on me, Whitney picked up her pencil and resumed sketching. In silence that followed, the short haired brunette began to squeeze, almost imperceptibly at first, growing bolder as the juice kept bubbling out of the gaping slit and dribbling onto her fists. Gradually, the squeezes gradually grew larger until she was openly jacking me off, pausing to smear the clear fluid up and down my slick pole before she resumed milking my seeping hard-on. \n\nSmick, smick, smick -- the familiar sound echoed off the walls as Erika watched over my shoulder, her single finger still deep in my ass. My breathing became shallow and ragged as Blair kept pumping my drooling cock. Finally, Valerie dropped her pencil in the rack and spoke up. \n\"I think that's enough. Don't you, Erika?\" \n\nBehind me, the shapely brunette seemed to shake out of her reverie. \n\n\"You're absolutely right, Val. We don't want Bill to have an accident. We can't afford it.\" \n\nAbruptly, she yanked her finger out of me, leaving my sphincter wide open. I gasped as the rush of cool air flooded my rectum. \n\n\"My turn now.\" \n\nBlonde Whitney was eager to take her friend's place, edging into the tiny circle even before Blair had let me go. Nodding in somewhat reluctant agreement, the brunette released her grip and stood up. After glancing at her two bra clad classmates, she looked back down at my dripping cock, the wet bulb twitching uncontrollably. \n\n\"It is a little warm in here.\" \n\nWith that, she yanked her t-shirt off as well. She wore nothing underneath, and I gawked at the pair of dusky breasts that sprang free. Although nowhere near as full chested as her two friends, they filled her slim torso, and were topped with amazingly long nipples. Dark brown and wildly erect, they must have been close to an inch long. Bobbing up and down, my stiff cock showed approval at the sight of those surprising buds. \n\nSeizing her opportunity, Whitney stepped right up to me and grabbed the protruding pole, wrapping her hand around the base of my throbbing shaft, her small fist barely reaching around the swollen thickness. Looking down at the engorged knob, now deep purple and nearly bursting, she smiled. \n\n\"His dick feels even better than it looks.\" \n\nWithout any pretense, she started to pump up and down, furiously jacking me off. Stepping around me, Erika seized the other girl's wrist and stopped her. \n\n\"The same rules apply to you, Whitney. You just want to keep his penis hard so the others can draw it.\" \n\nGrudgingly, the busty blonde agreed, nodding but with a surly undertone. \n\n\"Okay. But another time --\" \n\nI wasn't sure if that was a promise, a request or a threat, as Valerie suggested to her. \n\n\"Why don't you kneel on the floor like Blair and just hold him still? We'll see about another time.\" \n\n\"Okay.\" \n\nSounding more agreeable this time, she dropped to her knees while still gripping my hard-on. With a glint in her blue eyes, she lifted her round face to meet my gaze as she slid her fist down to the base of my stalk. A sly smile flitted across her lips as she began to squeeze, keeping her rhythmic action small enough to escape detection by either Valerie or Erika. Staring up at me, she stuck out the tip of her tongue and licked her lips, sending me an obvious invitation \n\nAfter a few minutes, Valerie flipped her paper over and stretched. Cocking her head, she looked at me and made another suggestion. \n\n\"Why don't we have him sit for a while? One last pose?\" \n\nBehind me, my trainer retrieved the high stool, the sound of the legs of the backless chair scuffing the floor as she pulled it into position. Valerie continued with her instructions. \n\n\"Bill, the stool is right behind you. Lean back and sit on the edge. Use your hands if you need to.\" \n\nUnclasping my hands from on top of my head, I reached behind my hips, found the soft cushion and carefully sat down. Unwilling to let go, Whitney kept her fist tight around my hard-on, scooting forward on her knees as I edged backward. \n\n\"Good. Now lean back on your hands. A little farther.\" \n\nI was leaning so far back that I felt like I was nearly horizontal. \n\n\"Excellent! Now spread your thighs apart so Whitney can get closer.\" \n\nAs I followed her instructions and opened my legs wide, the kneeling blonde eagerly inched forward, her pretty face looming only inches above my quivering cock, fully engorged and jutting upright from her gripping hand. I could feel her hot breath on my cockhead, the skin stretched taut across the bulb. Without lifting her blue eyes from the swollen knob, Whitney asked. \n\n\"Can I use both hands? I want to make sure that he doesn't squirm.\" \n\nValerie shrugged her shoulders, causing her rounded breasts to sway beneath the dark green polo shirt. \n\n\"Sure.\" \n\nAs the eager blonde curled her second hand around my bloated shaft, Valerie tugged her tripod farther to the side, nodding to Blair as she did so. \n\n\"Whitney's head in the way, so you may need to move your easel to get a better view.\" \n\nThe tall brunette agreed and pulled her own stand so that it was next to Valerie's. Opposite the two of them, Veronica slid hers across the floor until all three remaining students had a profile view of my upright cock, angling their tripods so they could see me and sketch at the same time. Unable to suppress her enthusiasm, Whitney started squeezing again, small pulses that were unlikely to be noticed by anyone but me. \n\nAs the girls began drawing once more, the chesty blonde glanced up at me and winked. Her squeezes grew larger and more pronounced until finally they developed into short, sharp strokes. Valerie paused, and warned the blonde. \n\n\"Go easy on him, Whitney.\" \n\nPouting, she angled my stiffened cock so she could peer down into the yawning slit. \n\n\"I want his dick to start leaking again.\" \n\nWith a knowing glance at my trainer behind me, Valerie nodded as she put her pencil back to paper. \n\n\"Okay. Erika, can you help him out?\" \n\nAppearing at my right side and kneeling on the floor, Erika let her fingers trail along the underside of my leg until she reached just below the curve of my ass cheek. Her already low voice was even deeper in pitch as she massaged me, her fingertips working close to my balls hanging down just over the edge of the cushion. \n\n\"Slide a little lower so I can reach underneath you.\" \n\nNodding, I eased my hips farther off the stool so that most of my weight now rested on my hands and my ass was suspended in midair. Moving swiftly, Erika stretched her hand up between my spread legs, slipping her fingers into the valley between my buttocks. When she found my puckered hole, she tapped it lightly, waiting for me to relax as she spoke to the captivated blonde. \n\n\"Watch.\" \n\nWhitney didn't need any encouragement. Her blue were still focused on the crevice gaping wide at the straining tip of my cockhead. As my trainer plunged her finger back into my rectum, I grunted. She was rougher this time, reaching deep into my ass to find my prostate, rubbing the swollen gland. Immediately, what had been a dry hole of the end of my hard-on filled with clear fluid, sparkling in the bright light. Halting her doubled fisted pumping, the busty blonde pointed my rigid cock up toward the ceiling so that the drops of lubricating juice remained perched on the lip of my open cockslit. \n\n\"That's cool. And your finger up his butt is causing his dick to leak like this?\" \n\n\"Uh huh.' \n\nMischievously, Erika wiggled her the tip of her finger against my prostate, triggering another swelling of liquid up and out of my hole. Dribbling down the underside of my bulb, it ran along the length of my stalk until it coated the back of Whitney's top hand. \n\n\"Wow! That was quick!\" \n\nReleasing the hand shiny with my juice, she lifted it to her mouth and licked it clean. As her pink tongue snaked out from between her lips, she raised her blue eyes up to meet mine, running the flexible tip all around her the back of her hand. Smacking her lips softly, she smiled. \n\n\"Umm. That is really tasty. It's surprisingly sweet.\" \n\nAs more fluid bubbled up out of the gaping slit, Whitney reacted quickly. Wrapping her second hand back around my shaft, she ducked her head and extended her tongue again, flicking the end of my dripping knob. I caught my breath, waiting to see if either Valerie or my trainer objected to this stretching of the rules. But no one said a word. Valerie continued sketching while Erika slowly rotated her finger back and forth, causing my stiff pole to throb in the kneeling girl's grip. Taking advantage of the lack of protest, Whitney opened her mouth wide and swallowed my entire cockhead. \n\n\"Hey! I'm not sure that's a good idea.\" \n\nLooking alarmed, Valerie stopped drawing, her pencil poised in midair, but my trainer still said nothing, easing her finger out of my rectum. I thought she was going to call a halt to the posing session, but instead Erika plunged two fingers back inside, twisting and turning them both as she re-entered me. Gasping at the sudden intrusion, I involuntarily thrust my oozing hard-on farther between Whitney's lips. \n\nShe choked, spitting my dripping bulb out of her mouth as she tried to catch her breath. With both fists still gripping my rigid pole, she coughed and sputtered as Valerie started to smile. With the other members of the Gang of Three giggling, Erika continued to worm her fingers in and out of my ass, causing the steady flow of liquid to accelerate until it was streaming out of my cockhole and dripping onto the floor. \n\n\"Bit off more than you could chew, didn't you?\" \n\nThe busty blonde didn't answer. She was still gasping for air. Abruptly, my trainer yanked her hand out of my butt and slapped my right cheek, the sharp sound echoing off the walls of the studio. \n\n\"That's probably enough anyway.\" \n\nLeaning against me so her marvelous breasts pressed into my back, Erika gazed over my shoulder at the puddle that had collected on the floor. In my ear, she whispered. \n\n\"You were pretty close, weren't you?\" \n\n\"Yes Ma'am.\" \n\nBy this time, Whitney had regained her composure and leaned forward, sliding her lips over the rounded end of my shiny bulb. As she started to suck, she used both fists, stroking me into her mouth. Learning from her previous attempt, she kept my drooling cockhead barely between her lips, nursing on the open slit as she milked me into her slurping mouth. \n\n\"Hey!\" \n\nShocked, Valerie called out as the blonde jacked my hard-on, furiously trying to draw out more fluid. Even without Erika's help, my cock obliged, the flow of clear liquid out of my cockhole turning into a steady stream under Whitney's energetic pumping. I could feel a familiar churning in my balls, and my breath became short and shallow. Still, no one made a move to stop the kneeling blonde. \n\nPanting now, I started to thrust against her manic strokes, trying to plunge deeper into her mouth, but her double fisted grip kept my swollen cock from choking her again. I couldn't believe that the two Club members were going to stand by and let me cum in her mouth. When I began to grunt, I heard my trainer speak over my shoulder to Valerie. \n\n\"Think that's enough?\" \n\n\"Uh, yeah.\" \n\nAs she answered, Valerie sprang into action, darting out from behind her easel to seize Whitney's shoulders and trying to pull her away from me. Grabbing my hips, Erika kicked the stool aside and jerked me backwards, yanking my dripping cock out of the blonde's sucking mouth. The other two girls just stood there, dumbfounded, watching. \n\nStumbling back toward the platform, I tried to regain my balance with my wet hard-on swinging wildly back and forth, slinging drops of saliva and lubricating fluid all over the floor. Peering around my torso, Erika anxiously studied my rigid cock as it gradually came to a throbbing twitching halt. I stood still and let her look, instinctively sliding my hands back up on top of head, breathing heavily. Finally, my trainer heaved a big sigh and straightened up. She had a wry look as she patted my stomach, just above my trembling cock. \n\n\"Good boy. For a minute, I was afraid you were too far gone.\" \n\nWhitney remained on her knees, her chin glistening with the fluid I'd left there, disappointment obvious on her pretty face. Grinning down at her, Valerie helped her to her feet as the blonde's heavy breasts swung inside the flimsy bra cups, threatening to escape the tiny triangles. With her jaw firmly set, she glared down at my twitching hard-on as it pointed directly at her. \n\n\"I really wanted to taste cum. Is it as sweet as his other juice?\" \n\nShe didn't raise her gaze as she asked the question. The two Club members exchanged glances before Erika replied. \n\n\"Yes.\" \n\nWith her hands on Whitney's shoulders, Valerie gently guided the blonde back to her easel. After retrieving her discarded shirt, the full bodied blonde looked doubtful as Erika continued. \n\n\"You'll get your chance, Whitney. I promise.\" \n\n\"I'll hold you to that.\" \n\nLifting the stool back up onto the platform, Erika spoke over shoulder. \n\n\"That's all for today girls. Be sure and put those drawings away so no one else will see them.\" \n\nAs she rejoined the circle, no one moved. In the silence, all of the art students were watched my hard-on jerk and quiver, jutting straight out in front of me, still leaking fluid. A long silvery strand hung from the tip of the engorged cockhead, swinging back and forth as it grew longer and longer before finally dropping to the floor below. \n\n\"It's a shame to leave him all excited like this.\" \n\nFrom behind her easel, Veronica was studying my trembling cock as she slowly began to put away her materials. Erika was clear in her reply. \n\n\"He's used to it. Not being able to ejaculate is part of his training.\" \n\nRaising her deep blue eyes to meet mine, she smiled. \n\n\"And he's getting pretty good at it.\" \n\nPulling on her t-shirt, Blair covered up her stiff nipples, but couldn't hide her excitement as they poked eagerly through the thin cloth. \n\n\"Still, it must be uncomfortable for him to keep his cum bottled up in his balls all the time.\" \n\nValerie swept her paper pad off her easel and folded the tripod. \n\n\"Oh, he does get to empty them. Every so often. But only when he's given permission.\" \n\n\"And today wasn't one of those times. You can get dressed now, Bill.\" \n\nThose words from Erika were the first anyone had spoken directly to me in quite a while. With my shiny hard-on swaying heavily back and forth, I retrieved my clothes. As I stuffed my raging erection back into my shorts, the girls stopped putting away their paper and stands and watched. Carefully, I arranged my swollen cock inside and carefully zipped up. Heaving a sigh, Veronica pulled her top back on before she spoke. \n\n\"I'd really like to play with him another time.\" \n\nValerie finished restoring the room to its original order as Erika responded. \n\n\"I think that can be arranged. Are any of you girls in Ms. Redmond's photography class?\" \n\nSurprised at the question, both Blair and Veronica nodded as Whitney answered. She still hadn't retrieved her top, and I eyed her oversized breasts as they bulged from the sides of her skimpy bra cups. \n\n\"Yes. We all are. Why?\" \n\nErika just grinned. \n\n\"You'll see.\" \n\nDoes she always know everything before me?", "tags": ["femdom", "male exhibitionist", "ffm", "coed", "art class", "male model", "orgasm denial", "college", "male submissive", "female dominant"], "address": "https://literotica.com/s/wvc-ch-27-the-private-session"}}}