{"_default": {"1": {"title": "First Time Milking", "category": "Fetish", "author": "Kessler", "short_description": "Two women treat man to a 'milking'.", "story": "I had not seen Linds in a while. She stopped by with her friend Joan. I had never seen Joan before. She was beautiful, long brown hair and long slender shapely legs to match. They both wore short skirts that hugged their figure. They stopped by to pay a visit and check up on me. I quickly found out the real reason for their visit. They wanted to know if they could have a party at my place and to invite a few friends from college and the local area. I really did not have a problem with that but played like I did. And of course Linds knew just how to sway me over to her way of thinking. \n\nLinds got that look in her eyes that I know so well, and Joan smiled wickedly at me and turned to Linds saying, \"Well, I guess we will have to convince him somehow.\"\n\nLinds giggled, \"Hmmm, it has been a while since I had him between my feet and toes. Maybe that would work.\" I looked at her feet. She wore pumps and her high arches looked so inviting. \n\nI laughed, \"Ladies, that would definitely put me in the right frame of mind.\"\n\nThey both laughed and Linds said, \"To the bedroom then!\" We made our way up the stairs making sure I positioned myself behind them. Joan was directly in front of me and I had a great vantage point of her tight ass and shapely calves. \n\nJoan looked over her shoulder at me and smiled. \n\nLinds commented, \"Joan, you have to try that milking thing out on Mr. C.\" \n\nWe made our way into my bedroom and Linds said, \"Only if he wants to.\"\n\nI sat on the bed removing my clothes and asked them, \"What is this milking thing you two are talking about?\"\n\nLinds said, \"It is something Joan has been doing with her boyfriend. I will let her explain it to you.\"\n\nI had gotten over feeling uncomfortable in the nude in Linds presence. However, being naked in front of Joan, whom I just met, made me feel a bit uneasy. \n\nI stretched out on the bed and Joan smiled saying, \"Mmmmm, Linds you were right, for a 40 year old man he does not have a bad looking body.\" \n\nThis put me more at ease with her. I watched as they both slipped off their shoes. Joan's feet looked amazing. Linds was wearing pumps and Joan had on a pair of black mules. \n\nLinds sat on the bed cross-legged next to my right hip. She pulled her long hair back over her shoulders and then grabbed my already hard cock and began to fondle it. \n\nLinds approached the foot of the bed saying to me, \"Make room for me and spread your legs please.\"\n\nI did as she instructed and watched as she took a seat on the bed between my legs. She also sat crossed-legged. Her legs were amazingly long and shapely. Her calves were smooth and nicely formed. She lifted each of my legs up and rested them on top of her crossed thighs. With my legs raised atop her thighs she was able to scoot in closer to me between them. Linds continued to stroke my shaft causing me to moan. She leaned over me, her beautiful face hovering over mine smiling as she said, \"I love the way you feel in my hands.\"\n\nJoan said, \"Let me.\" And reached over grabbing my cock. Linds released me and leaned over to the bedside stand and pulled out the bottle of baby oil from the drawer. She applied a generous amount over my cock and Joan's stroking hand. Joan's fingers were slender and much longer than Linds and wrapped completely around my throbbing shaft. \n\nAs Linds applied a liberal amount of oil Joan smiled saying, \"That's better, I like the slippery feel and smacking sound a cock makes in my hand.\" \n\nAfter a few more strokes she stopped stroking my shaft and began to rub her long thumb very slowly up and down along the sensitive glands at the head of my cock. She finished each slow torturous thumb rub by squeezing the head of my cock firmly. Her doing this to me caused my body to tense up and raise my hips into the air. She saw what her thumb rubbing was doing to me and smiled. Linds saw this and reached in with her left hand grabbing the shaft of my cock between her fingers and stroked it while Joan continued to relentlessly rub and squeeze my sensitive head. \n\nLinds said, \"He likes it when you do that with your thumb.\"\n\nJoan replied, \"I can see that. His body is really tense.\"\n\nI moaned each time Joan's thumb passed over my cock's swollen head. She was relentless as was Linds who continued to pump my shaft. It did not take long before I started to ooze precum. I watched as it leaked out of my slit and on to Joan's thumb. \n\nJoan giggled saying, \"There it is. Amazing what my thumb can do.\" \n\nLinds said, \"His cock is throbbing in my hand.\"\n\nJoan said, \"That's a good sign.\"\n\nLinds and Joan stopped what they were doing and Joan began to fondle my balls as she explained to me about how she wanted to milk me. She explained that she would insert her finger up my ass pumping it against my prostrate. All the while keeping me hard. She said it would allow me to remain hard much longer and my orgasm would be much more intense and longer.\n\nAfter explaining all this to me I was pretty sure it was not for me. I said, \"I do not like anything stuck up my ass. I prefer to remain a virgin there.\"\n\nLinds laughed, \"Oh c'mon just try it once. I will keep playing with your cock while she does it.\"\n\nJoan said, \"It will not hurt you. I have done this many times to Ron, my boyfriend, and he says it is so intense. I know what I am doing and I promise to be gentle.\"\n\nThey both continued to talk to me about it trying to convince me. Joan kept playing with my balls. I watched as her slender fingers worked their magic. Finally after much deliberation I agreed. I further explained that the moment I said stop they would have to stop. They agreed.\n\nJoan slid my legs off of hers and got up from the bed. She made her way over to where she had placed her purse and brought back with her a small jar of KY jelly. I commented, \"Do you always carry that with you.\" \n\nShe smiled at me saying, \"I never leave home without it.\"\n\nShe assumed her position between my legs, only this time scooted herself in even closer causing my hips to spread even wider and my buttocks to tilt up higher towards her.\n\nLinds looked on and asked Joan what should she do?\n\nJoan told her to get me to the point of precum again while she does her thing.\n\nLinds immediately placed her foot in my lap and inserted my cock in between her big toe and second toe. She began to jerk my cock the length of my shaft all the way up to the head where she paused and gently wiggled her toes back and forth a few times then stroked me again. It was driving me crazy and she knew it. I fit very tightly between her toes. \n\nJoan said, \"I can tell u have done this before.\" She poked her finger in the jar and pulled out a healthy dollop of KY.\n\nLinds said, \"It shouldn't take too long before he starts oozing. I just have to work his head between my toes.\"\n\nHer toes were working me over good. I began moving my hips up and down and my moans of pleasure were coming more frequently.\n\nLinds raised up her other leg and laid it across my lower abdomen pressing it against the shaft of my cock propping it upright. The sight and weight of her smooth shapely calf across my abdomen excited me further. \n\nJoan reach down between my butt cheeks and I felt her gently separate them she lowered her face down a bit to get a better view. She smiled at me and said, \"Nice virgin bud you have there. Now you have to relax and let my finger slide in. Do not tighten it up. I promise it won't hurt.\"\n\nI felt her apply the lube against my rectum and then she gently entered her finger up to the first digit. I could not help but tighten my muscles. She smiled at me and said, \"Relax now, I am going to move it around a bit so you get use to my finger.\" Linds continued to stroke me between her toes as I felt Joan's finger moving up down and around inside me. After a while I felt her finger enter me further. I asked, \"Is that it?\"\n\nJoan laughed, \"Oh no. Only half way, I still got more to go sweetie. I can feel your muscles contracting around my finger. You have to relax and accept me.\" Then she smiled at me and said, \"I love pumping my fingers inside a virgin. At this moment you probably feel a sensation of being violated. That's okay, the feeling of being violated is normal, don't worry after a while the feeling will go away. You and I are going to be real close.\" Her smile broadened even wider as she pushed her finger in even further.\n\nI said, \"I am trying to relax but God u have long fingers!\"\n\nThey both laughed and Joan said, \"That's funny…Ron tells me the same thing.\" She then added, \"I am going to move it around again so you get use to it.\"\n\nI began to breath harder and Linds asked, \"How you doing sweetie? Does it feel okay?\"\n\nAll I could do was grunt and take short breaths.\n\nI tried to take my mind off of what Joan was doing to me as I concentrated on Lind's golden toes working over my cock. I could not help but move my hips up and down. She applied more oil to her toes and reached down with a free hand to stroke my shaft while her toes began to squeeze and work harder on the sensitive area of my head. \n\nJoan concentrated on what she was doing to me as I felt her finger move even further inside me. She said, \"almost there now.\" \n\nI gasped, \"Thank goodness.\"\n\nLinds commented on how my cock was throbbing and twitching.\n\nJoan said, \"That's good he is responding to what I am doing to him.\"\n\nLinds said excitedly, \"There it is, he is starting to precum now.\" \n\nI looked at Linds toes and saw beads of my precum ooze out of my slit and onto her beautiful toes.\n\nSuddenly I felt Joan's finger slip in further and press against what had to be my prostrate. I arched my back up and groaned loudly, \"Oh God!\" \n\nJoan said, \"That's it I am all the way in now. See how he responded Linds?\" Linds laughed, \"Hell yes! He bucked so high my knee almost rammed into my chin.\"\n\nJoan bent her head down further to examine what she was doing to me saying, \" I just poked something inside him never touched before.\" \n\nLinds said, \" That's so wonderful.\" \n\nI relaxed a bit then Joan moved the tip of her finger back and forth against my prostrate. she called it my squirt button. Each time she touched it I felt a tingle race down my legs and into my toes. I also felt a tingle at the head of my cock. \n\nJoan said, \"Now we start to milk him Linds. Stop stroking him for a while. Keep him between your toes. I am going to pump his squirt button.\" \n\nLinds kept my cock locked between her toes. Joan began to slowly pump her finger in and out of my rectum, each time ensuring she made contact with my so called squirt button. She was right about me feeling violated. Yet it felt amazing. I remained hard as I felt her finger move in and out of me. Each time her finger hit my button I felt it in my cock. Suddenly she created a new sensation as I felt her enter me with two fingers. She increased the speed of her thrusts and before long I saw my cum oozing out of my slit. At first I thought it was precum but there was too much of it and it flowed freely. The sensation was strange, as I had no prior feeling of it coming. The flow was beyond my control. Each time she made contact with my prostrate more would flow out in a steady stream. I could not help but moan as I watched it flow onto Lind's perfect toes and foot. \n\nLinds was beside herself as she looked on in awe, \"Oh my God he is leaking like crazy look at it, all over my foot! It feels so hot. I love it!\" \n\nJoan laughed, \"I know. It's great. All I have to do is keep hitting his button.\" \n\nJoan reached in with her free hand and lifted my heavy balls up fondling them as she increased the pace of her fingers inside me. After several minutes my tense muscles began to tire and I began to let myself go. I became more relaxed as Joan's relentless pounding continued. I could feel the knuckles of her remaining fingers push against my ass cheeks each time she shoved her fingers inside me. Joan recognized the state of relaxation I was feeling and looked up at me smiling, \"That's better now, just relax and let us milk you dry.\" She told Linds to start jerking me again while she tries something new.\n\nJoan removed her fingers from me and repositioned herself saying, \"So you like toes and feet eh, well I am gonna finish milking you with my toes.\" \n\nLinds said, \" You go girl, give him those long sweet toes, that's what he wants. \" \n\nI watched as Joan remained seated between my legs and pulled her knees up to her chest. She then reached back down spreading my cheeks with her hands. I felt one of her big toes enter my rectum slowly and smoothly. All the way in and then I felt it hit my squirt button just as her finger had done before. \n\nShe said, \"Oh yes he is very receptive, good and loose now.\"\n\nMy God! It felt amazing as she began to rub the tip of her toe against my prostrate up and down and around. Seeing her long beautiful legs between my legs and feeling her toe pressing against my insides excited me to no end. I rose up onto my elbows, my body shaking with sexual bliss. Linds looked at me and giggled as she continued to squeeze the head of my cock between her toes and stroke my shaft with her fingers. All the while Linds continued to flex her foot as her toe rubbed and pressed my button. \n\nI was shaking with excitement, delirious and on the edge as I watched a slow steady stream of cum ooze out onto Lind's foot every time Joan's slender ankle flexed, moving her toe inside me. I watched the muscles in Linds calf move each time her ankle flexed. I could not help but moan each time I saw this and felt her toe press inside me. \n\nEach time, my body shook uncontrollably when Lind's toe rubbed my sensitive head and Joan's toe hit my button. \n\nLinds said, \"Wow! I have never seen him like this. He is losing it Joan.\" Linds reached over and ran her hand gently along the side of my flushed face. \n\nJoan said, \"I know. That's what I like about milking a guy. It gives me complete control.\" \n\nI gasped through my excitement. \"Amazing! Your legs are so beautiful Joan.\" I leaned forward and tried to touch them but I could not. \n\nJoan laughed and said, \"Why thank you.\" She then raised her right leg and gently placed her calf across the top of my cock and began to rub it back and forth. My cum was flowing continuously as I watched it ooze onto her shapely calf. Her toe continued to work my rectum and Linds slid her toes down my shaft stroking it faster. \n\nJoan smiled wickedly at me and commented, \"That's nice isn't it?\"\n\nI fell back onto the bed closing my eyes as I felt myself being swallowed by these leggy vixens.\n\nSeeing me do this they both laughed as they continued to work me over with their hands, toes, and legs. \n\nLinds said, \"I think all this stimulation is almost more than he can stand. He does not know if he is cumming or going.\" \n\nJoan giggled, \"You don't know how true a statement that is. Right now his brain is telling him one thing but his body is doing something else.\"\n\nThe sensation caused by Joan's toe was incredible and prevented me from a complete orgasm. I continued to ooze my juices for several minutes. I could not control it. My level of excitement was controlled by the pressure of Joan's toe and Lind's feet and toes on my throbbing cock.\n\nIt was a strange sensation in that I was being held back from an exploding orgasm. At the same time the urge was not as strong. Joan had a lot to do with that, as she seemed to know just the right amount of pressure to apply with her toe. \n\nAfter what seemed like an eternity Joan finally said, \"Lets make him explode now.\" \n\nLinds smiled hungrily and said, \"Yes. Lets.\" Then she asked me, \"Are you ready to explode?\"\n\nMy senses were a wreck as I breathed heavily. My heart was racing and my blood felt like fire burning in my veins. I responded through heated breath, \"Yes…yes.\"\n\nJoan and Linds laughed seeing how I was struggling beneath them.\n\nJoan said, \"Okay. I am going to start pumping him and you work your magic Linds.\"\n\nLinds raised her left leg that was resting across my abdomen and locked the base of my shaft between the big toe and second toe. She kept the head of my cock locked between the same toes of her right foot and preceded to jerk me with her feet. Joan tucked her right leg back into her chest and inserted her other big toe into my hole. When she did this I came out of my skin shouting, \"No! no! Not both of them!\"\n\nJoan leaned forward placing both her hands on my hips saying, \"Sssshhhhhh, just relax and let it go,\" as she consoled me I felt her slowly push her other toe deeper inside me saying, \"almost there sweetie.\"\n\nI squirmed watching her as she looked down between my legs intensely. All the while feeling her toe slip further in along side the other one. Once I felt the tips of her remaining digits push against the outside of my rectum I knew her toe was fully inserted. She looked up and smiled at me and wrapped her arms around the front of her long tucked legs and resting her chin on top of her knees said, \"There that's not so bad now is it? Both my toes are inside all the way.\" I felt her wiggle them up and down inside me as she giggled. This caused me to thrust my hips up involuntarily as I released a long groan saying, \"Oh my God.\"\n\nLinds continued to pump my hard throbbing shaft and leaned over to look at Joan's feet saying , \"Oh my God, that looks awesome! I definitely want to try that.\"\n\nJoan said, \"Here we go.\" She started to slowly pump her toes in and out of me while Linds quickened her jerks on my cock. I matched their pumping and jerking as best I could with thrusts of my own. Each time I felt Joan's toes enter me and press against my squirt button I could not help but grunt. Linds matched Joan's pumping toes with her jerking of my shaft. After a while we reached a good rhythm. Both girls realized this as well and Linds said, \"Now we got it going good.\" \n\nJoan looked over at Linds saying, \"Yep, it won't be long now.\" \n\nJoan said, \"He is really loose down here now. He is getting use to my toes.\"\n\nShe began to pump her toes in and out much faster and harder. She unwrapped her arms from around her legs and grabbed my balls with both sets of her fingers and began to fondle them by gently squeezing them and pulling on them. She cupped my swollen balls from underneath with her left hand lifting them up and slowly ran the tips of her fingernails of her right hand across the taught skin sending more shivers through my body. The sensation of her nail tips rubbing back and forth across my nuts sack was a totally new sensation to me. The muscle tone in her legs looked amazing as she flexed her ankles and pumped her toes in and out of my hole. All the while the smile never left her petite pretty face as she concentrated on what she was doing to me. Feeling her fingers fondling my balls and watching her long legs while she smiled at me from above her knees was driving me crazy. My cock was twitching like never before between both sets of Linds toes as she began to concentrate most of her efforts on the swollen head of my cock. Seeing and feeling all this I could not help but raise up in the seated position almost shouting out, \"Oh God, oh God!\", in unison to Linds strokes and Joan's pumping toes. Their efforts felt so strong as my limp body was totally given to them. I could feel my body being physically rocked back and forth along the bed. They were pounding me pretty hard. Joan's legs were powerful as she was thrusting her toes into me. I was amazed at the strength I felt coming from her long legs and the seemingly tireless effort they exuded. Through prior experience I knew the same was true about Lind's legs. She studied dance and could go on for hours if need be. I knew I would not last long. Eventually it would all come out in the end...right between Linds magnificently tanned toes. \n\nJust as I was beginning to feel the desire to finally cum I felt Joan lift my nuts up between her groping fingers. She then pressed the tips of her toes harder than she had done before against my Squirt button and gently pinched it between them, gripping it firmly with her toes she began to lightly tug and push back and forth on it. \nI jerked completely upright into a seated position, releasing a loud half scream, half groan. I closed my eyes seeing colors red and white flashed across my mind. I opened my eyes to see Joan stretched out backwards on the bed and resting on her elbows. She smiled up at me saying, \"I never did this with my toes before. Normally I pinch it between my fingers and tug on the tiny squirt button. I got it between the tips of my toes now.\" \n\nI bent forward over Lind's pumping toes staring down at Joan's petite feet half buried between my ass cheeks. The looked back up at her incredibly beautiful long legs slightly bent at the knees. I watched her ankles flex slightly, the same time feeling the tug on my throbbing prostrate. I reached between my legs and grabbed each slender flexing ankle almost tempted to pull them away from between my legs. Instead I caressed them feeling the strength and smooth elegance they possessed. \n\nJoan turned to Linds and laughed saying, \"Look Linds, he is in sexual bliss.\"\n\nI closed my eyes hearing Linds say, \"I would have to say yes, because whatever you started doing to him with your toes has resulted in a real gusher between my toes. Look at my feet. He is leaking all over my them. They are completely soaked now.\"\n\nI opened my eyes and saw Linds was not exaggerating. Both her feet looked completely wet.\n\nHearing and seeing my response as I rose up and flopped back down caused them to both giggle and look at each other. My cum continued to leak steadily from my cock even more so than before as I could hear the smacking sound created by Lind's toe strokes. \n\nSuddenly the familiar sensation I had been waiting for arrived, as I felt the urge to explode begin to build up inside me. I reached over in front of me and clutched Lind's long shapely legs in my arms. A sign that Linds was familiar with, having given me many foot jobs in the past. It was a gentle display of submission on my behalf that I was on the verge of cumming. She knew this and smiled at me wrapping her left arm around my neck hugging me as I shook with excitement. \n\nShe pressed her lips against my ear whispering to me as she has done so many times in the past, \"That's it sweetie grab my legs and hold on. Let it come. I want to feel your hot seed all over my toes and feet. Rub my smooth legs. Let it all out.\" \n\nJoan said, \"Awwww, isn't that sweet. He is shaking like crazy.\"\n\nLinds said, \"He always hugs my legs like this when he is about to blow his load. I love it, feeling his body shake against my legs as he loses it.\"\n\nJoan sat back up with her knees tucked into her chest and finally released my prostrate from between the tips of her soft toes and continued to pump me. I felt her toes touch my sensitive squirt button more frequently. My body was tingling all over as my shakes became more violent. I clutched Lind's legs even harder into my chest feeling her smooth muscles flexing with each stroke as I shouted, \"I'm cumming! I'm cumming!\" \n\nJoan stopped her pumping and withdrew her toes halfway out of my hole and began to wiggle them up and down. With Joan's knees pressed tightly into my neck, I looked over at Joan's smiling face as I felt my cum rising up my shaft. \n\nLinds continued whispering in my ear as her toes stroked me in powerful jerks saying, \"Cum on my toes come on baby, come on.\"\n\nMy body locked up hard and Linds said, \"That's it he is cumming now!\" She pulled away to watch my cock blow between her toes as I clutched her powerful legs into my chest. I watched Joan fondle my balls even faster, rolling them between her fingertips and felt her slide her toes the rest of the way into my hole. Her timing was incredible as I felt the tip of her soft toes press against my squirt button as she wiggled them up and down. The last thing I remember seeing before closing my eyes in complete orgasmic bliss was her wickedly smiling face above her knees as she winked at me saying, \"blow hard for me baby.\"\n\nI did exactly that, as I grunted hard between my clenched teeth and felt the most incredible orgasm ever. I buried my face between the tops of Lind's knees as I felt her toes clench my shaft and head in one final powerful upward jerk. Feeling all this at once was too much as I threw myself back down on the bed feeling the first load leave my body. \n\nI heard Linds gasp, \"Oh my! Oh my! That one was incredible.\" \n\nI then felt Joan's toes flex again, rubbing across my squirt button, causing me to rise back up in tense excitement. I groaned, \"Oh God, I'm cumming!\"\n\nI heard Linds comment nonchalantly followed by a giggle, \"Hmmmm, didn't he say that already.\"\n\nI gripped Lind's shapely calves in my hands feeling them flex as she squeezed the head of my cock yet again between her toes jerking it quickly up and down in rapid fashion. I grunted and threw myself back down onto the bed a second time as I felt another load escape me. \n\nLinds said, \"Wow! That hit hard!\"\n\nI heard Joan giggle and yet again I felt the tips of her hot toes press even harder into my squirt button and wiggle up and down against it. \n\nMy body locked once again causing me to rise back up for the third time. I opened my eyes through a glaze and saw Joan looking down between my legs as she squeezed and pulled gently on my swollen balls. Linds continued to pump me between her toes and reached over with her index finger slowly rubbing the slit of my cock. I watched as she rubbed the cum from her fingertip into her calf smiling at me as she did this. She then jerked up with her toes causing her calves to flex in my clenching arms and against my chest, as I felt another load being pulled from me. I groaned, \"I'm cumming!\" as it left me.\n\nJoan laughed, \"Honey, you been cuming.\"\n\nI was breathing hard trying to catch my breath as yet again I felt Joan's toes rub against my throbbing squirt button, I could not believe I was still hard between Lind's toes. I could not rise up any more as I just lay there twitching uncontrollably watching Lind's strong legs rise up and down pulling out load after load from my tired body. The tips of Joan's toes felt like warm prods against my prostrate. My rectum felt completely numb around her toes. \n\nThroughout this all I watched as every so often Linds continued to rub the head of my cock with her finger and then rub the cum into her swaying shapely calf. Occasionally she let the cum pool up in the connecting skin between her toes and scoop it up on her finger rubbing it into her calf as well. \n\nI knew she could go on forever like this. There is not enough cum in the world to satisfy her. She was enjoying herself. Her golden tanned toes and legs were magnificent. I finally had enough and said, \"Joan stop. Pleeease stop.\" \n\nShe asked, \"Are you sure?\"\n\nI shouted, \"Oh God yes I am sure! You both are killing me!\"\n\nJoan laughed as she withdrew her toes from inside me. Linds responded with, \"My God! I had never seen so much. I was rubbing it all over my legs. Another hour and we could take a bath in it. He's still hard though?\"\n\nJoan laughed, \"That's okay we can gently finish of what is left.\"\n\nIt was amazing. As soon as Joan removed her toes from my rectum my body relaxed like a wet dish rag. I pulled myself up resting my back against the headboard breathing like I had just finished running a marathon. Linds released my cock from her toe grip as Joan scooted in further between my legs. She then placed her legs in my lap in such a way as to sandwich my hard cock between her right shin and left calf in a cross legged fashion. She looked at Linds and smiled asking, \"May I? I love finishing a guy off by sucking him dry.\" \n\nLinds giggled, \"By all means, you deserve it. Besides I don't think he will mind.\" Then she looked at me and smiled. Joan pulled her black hair away from her beautiful face smiled at me and swallowed my cock. Linds got on her knees and moved over behind me sliding in between my back and the headboard so that I rested in between her legs. She then wrapped her long legs around me resting them across my abdomen. Joan's mouth felt amazing, so warm and soft around the head of my cock. She used her hands to lift her legs up and down along my shaft while her tongue and mouth sucked on the head. \n\nI lay my head back onto Lind's chest and moaned, \"Oh Joan your mouth and legs are incredible.\" I gripped Lind's smooth calves that were crossed on top of my body and rubbed them as I watched Joan's head bob up and down and around the head of my cock. Occasionally Joan lifted her head, smacked her lips, and smiled at me. Linds spoke to me the whole time telling me about the orgasms I had just minutes ago between her toes. \n\nShe said, \"Your loads shot so hard and thick. One landed all the way up the inside of my knee. That one surprised me. Another one hit inside my left calf. My feet are completely soaked with your milk. I never have seen so much cum.\"\n\nI said, \"Oh God, oh God, I am about to cum again Joan.\" \n\nLinds laughed knowing how much I love to hear her talk dirty to me, and Joan moaned with my cock in her mouth and clenched my cock firmer between her shin and calf, jerking it up and down into her mouth. Feeling this I began to throw my hips up into Joan's beautiful sucking mouth. She firmly clenched her lips around the head as I felt the tip of her soft tongue sliding up and down over the sensitive gland of my head. \n\nLinds wrapped her beautiful shapely legs tighter around me and began running her slender fingers through my hair saying, \"Let it come sweetie. Shoot it out into Joan's warm mouth. Give it all to her.\" \n\nI arched my back up against Lind's clamping legs and threw my hips up against the weight of Joan's stroking legs in my lap, as best as I was able. I had little strength left in me after what they had done to me. \n\nJoan sensed my imminent orgasm and really started to work the head of my cock with her sweet mouth and twirling tongue. My body tightened as I jerked and groaned feeling my cum rise inside me. Joan raised her head up slightly opening her mouth above my cock resting the head of my cock against her tongue. She stared up at me as she did this and began to stroke my shaft in full measure between her legs. Up and down, up and down I watched her beautiful legs pump. Linds lowered her face to my ear saying, \"Look at that beautiful mouth. Cum into her mouth. Feel her legs stroking your cock.\" \n\nLinds continued to look at me as I saw an opened mouth smile cross her face. I continued to concentrate on my throbbing cock being stroked by her beautiful legs. \n\nMy body was quivering like crazy between Lind's legs. I could not believe I had not cum yet! Why? Was I completely spent from earlier?\n\nLinds said, \"Let me help before he has a heart attack.\"\n\nLinds lifted her incredibly long legs, resting the soles of her feet flat upon my lower abdomen and began rubbing them up and down, running her soft toes through my pubic hairs. She slipped her toes under Joan's pumping legs and then back up again. Back and forth she did this, curling her toes down into my skin, running my pubic hairs between her toes. She said to Joan, \"He likes the feel of my toes pressing into him down there. I like it too. Feeling his silky pubes running between my toes.\"\n\nLind's has the shapeliest calves I have ever seen on a woman. Watching her calves sway loosely back and forth in front of me as she did this was too much. I cupped them in my hands. \n\nLinds continued to run her fingers through my hair and in a soft gentle voice said, \"How's that sweetie, you gonna blow now? Concentrate on feeling my toes push your cum out of you.\"\n\nJoan felt it in my cock as well. She smiled again as I watched her legs pump up a final stroke forcing a load from my cock. It landed squarely on her tongue. Linds saw this as well and giggled. She curled her toes downward and slid them harder back down to the base of my cock. Joan's legs pumped another load out into her smiling open mouth. It landed on her upper lip and back onto her waiting tongue. Joan continued to stare at me as another load eeked out onto her warm tongue. Then she lowered her beautiful small face back down and closed her mouth around the very tip of my cock as she finished stroking me with her legs. \n\nMy body went limp, as did my cock. As my cock shriveled Joan took more and more of it into her mouth until I was completely flaccid. She twirled my flaccid member around with her soft tongue. \n\nI was completely spent. My body exhausted. I lay there between Lind's legs rubbing them as I caught my breath. Linds lifted her head but kept my flaccid cock between her lovely legs.\n\nI said, \"Ladies, that was incredible we need to do this again.\"\n\nThey laughed and Joan said to Linds, \"See I told you he would like being milked.\"\n\nI lay there amongst their fine bodies and beautiful Legs and feet with my eyes close as they spoke among themselves. Linds asked a lot of questions about how often should she milk a guy and what is too much. What does the prostrate feel like, etc?\n\nI thought it was kind of funny how they talked about it like I was a cow or something. \n\nAs they spoke Linds continued to apprehensively and gently fondle my cock and balls, occasionally looking down at it. All the while she addressed Linds questions. The dexterity of her slender fingers was amazing as she played with my genitals; it seemed to be second nature to her. As they talked, I passed out into a deep sleep between Lind's legs. I don't know for how long I was out but I awoke as Linds was slipping out from behind me. She saw me wake up and smiled saying, \"Sorry, I tried not to wake you.\"\n\nI said, \"That's okay, I don't want to miss the game tonight. I need to get up.\" I watched Joan leave the bed, pull her long hair back and slip on her mules. \n\nI said, \"You are so fine.\" \n\nShe smiled back at me saying, \"Thanks, anytime you want to be milked again let me know. I never used my toes before. I liked it. I like having my hands free for other things.\"\n\nI noticed Linds slipping on her pumps, my dried cum still covering her golden feet. \n\nI said, \"Your are so fine also Linds.\" They both laughed and Linds said to Joan, \"I think this is what you call after sex obsession.\" \n\nI laughed saying, \"I don't know about all that, but this time don't be away so long, I really do miss you.\" \n\nLinds turned to me and smiled holding up the jar of KY jelly and sticking it in her bag. She said, \"Don't worry about that. I am going to need someone to practice milking on and you are it.\" \n\nI flopped back on to the bed smiling as I watched them leave my room. As they walked out Joan hollered back, \"Call me anytime. Linds has my number. Bye.\"", "tags": ["linds continued", "linds laughed", "watched joan", "toes joan", "cock linds", "shapely calf", "linds giggled", "shaft linds", "linds commented", "locked toes"], "address": "https://www.literotica.com/s/first-time-milking"}}}